zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <module name="CAN" id="03723" name2="can_fd_u2003_v4" version="A">
          <instance name="CAN0">
            <register-group name="CAN0" name-in-module="CAN" address-space="base" offset="0x46002000"/>
            <signals>
              <signal group="RX" function="ENHANCED_CAN" pad="PA9"/>
              <signal group="TX" function="ENHANCED_CAN" pad="PA8"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="104" caption="Instance index for CAN0"/>
              <param name="GCLK_ID" value="28"/>
              <param name="CAN_PADDR_MSB" value="12"/>
              <param name="CAN_MSG_RAM_ADDR" value="0x20"/>
              <param name="CAN_EXT_TSTAMP_IMPLEMENTED" value="0"/>
              <param name="CAN_ECC_BERR_IMPLEMENTED" value="0"/>
              <param name="CAN_RXD_SYNC_METHOD" value="0"/>
              <param name="CAN_VERSION" value="0x30203"/>
              <param name="DMAC_ID_DBGMSG" value="67"/>
              <param name="PAC_ID" value="104" caption="Index for CAN0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="CAN1">
            <register-group name="CAN1" name-in-module="CAN" address-space="base" offset="0x46002400"/>
            <signals>
              <signal group="RX" function="1" pad="PA02" ioset="3"/>
              <signal group="RX" function="2" pad="PA08" ioset="3"/>
              <signal group="RX" function="3" pad="PA13" ioset="3"/>
              <signal group="RX" function="4" pad="PB02" ioset="3"/>
              <signal group="RX" function="5" pad="PB08" ioset="3"/>
              <signal group="RX" function="6" pad="PB13" ioset="3"/>
              <signal group="RX" function="7" pad="PC08" ioset="3"/>
              <signal group="RX" function="8" pad="PD02" ioset="3"/>
              <signal group="RX" function="9" pad="PE02" ioset="3"/>
              <signal group="RX" function="10" pad="PA04" ioset="3"/>
              <signal group="RX" function="11" pad="PB03" ioset="3"/>
              <signal group="RX" function="12" pad="PC01" ioset="3"/>
              <signal group="RX" function="13" pad="PD06" ioset="3"/>
              <signal group="RX" function="14" pad="PE00" ioset="3"/>
              <signal group="RX" function="15" pad="PA05" ioset="3"/>
              <signal group="RX" function="16" pad="PA09" ioset="3"/>
              <signal group="RX" function="17" pad="PB06" ioset="3"/>
              <signal group="RX" function="18" pad="PB10" ioset="3"/>
              <signal group="RX" function="19" pad="PA00" ioset="3"/>
              <signal group="RX" function="20" pad="PB01" ioset="3"/>
              <signal group="RX" function="21" pad="PB05" ioset="3"/>
              <signal group="RX" function="22" pad="PB09" ioset="3"/>
              <signal group="RX" function="23" pad="PA01" ioset="3"/>
              <signal group="RX" function="24" pad="PA12" ioset="3"/>
              <signal group="TX" function="38" pad="PA00" ioset="4"/>
              <signal group="TX" function="38" pad="PA01" ioset="4"/>
              <signal group="TX" function="38" pad="PA02" ioset="4"/>
              <signal group="TX" function="38" pad="PA03" ioset="4"/>
              <signal group="TX" function="38" pad="PA05" ioset="4"/>
              <signal group="TX" function="38" pad="PA06" ioset="4"/>
              <signal group="TX" function="38" pad="PA08" ioset="4"/>
              <signal group="TX" function="38" pad="PA09" ioset="4"/>
              <signal group="TX" function="38" pad="PA10" ioset="4"/>
              <signal group="TX" function="38" pad="PA13" ioset="4"/>
              <signal group="TX" function="38" pad="PA14" ioset="4"/>
              <signal group="TX" function="38" pad="PB02" ioset="4"/>
              <signal group="TX" function="38" pad="PB03" ioset="4"/>
              <signal group="TX" function="38" pad="PB04" ioset="4"/>
              <signal group="TX" function="38" pad="PB06" ioset="4"/>
              <signal group="TX" function="38" pad="PB07" ioset="4"/>
              <signal group="TX" function="38" pad="PB10" ioset="4"/>
              <signal group="TX" function="38" pad="PB11" ioset="4"/>
              <signal group="TX" function="38" pad="PC07" ioset="4"/>
              <signal group="TX" function="38" pad="PC09" ioset="4"/>
              <signal group="TX" function="38" pad="PD03" ioset="4"/>
              <signal group="TX" function="38" pad="PD07" ioset="4"/>
              <signal group="TX" function="38" pad="PE01" ioset="4"/>
              <signal group="TX" function="38" pad="PE03" ioset="4"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="105" caption="Instance index for CAN1"/>
              <param name="GCLK_ID" value="29"/>
              <param name="CAN_PADDR_MSB" value="12"/>
              <param name="CAN_MSG_RAM_ADDR" value="0x20"/>
              <param name="CAN_EXT_TSTAMP_IMPLEMENTED" value="0"/>
              <param name="CAN_ECC_BERR_IMPLEMENTED" value="0"/>
              <param name="CAN_RXD_SYNC_METHOD" value="0"/>
              <param name="CAN_VERSION" value="0x30203"/>
              <param name="DMAC_ID_DBGMSG" value="68"/>
              <param name="PAC_ID" value="105" caption="Index for CAN1 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="04702" name2="cla_ccl_u2225_v3" version="A">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="IN" index="0" function="1" pad="PA00" ioset="1"/>
              <signal group="IN" index="0" function="2" pad="PA06" ioset="1"/>
              <signal group="IN" index="0" function="3" pad="PA11" ioset="1"/>
              <signal group="IN" index="0" function="4" pad="PB00" ioset="1"/>
              <signal group="IN" index="0" function="5" pad="PB06" ioset="1"/>
              <signal group="IN" index="0" function="6" pad="PB11" ioset="1"/>
              <signal group="IN" index="0" function="7" pad="PC00" ioset="1"/>
              <signal group="IN" index="0" function="8" pad="PD06" ioset="1"/>
              <signal group="IN" index="0" function="9" pad="PE00" ioset="1"/>
              <signal group="IN" index="0" function="10" pad="PE06" ioset="1"/>
              <signal group="IN" index="0" function="11" pad="PB01" ioset="1"/>
              <signal group="IN" index="0" function="12" pad="PC09" ioset="1"/>
              <signal group="IN" index="0" function="13" pad="PD03" ioset="1"/>
              <signal group="IN" index="0" function="14" pad="PE04" ioset="1"/>
              <signal group="IN" index="0" function="15" pad="PA03" ioset="1"/>
              <signal group="IN" index="0" function="16" pad="PA07" ioset="1"/>
              <signal group="IN" index="0" function="17" pad="PB04" ioset="1"/>
              <signal group="IN" index="0" function="18" pad="PB08" ioset="1"/>
              <signal group="IN" index="0" function="19" pad="PB12" ioset="1"/>
              <signal group="IN" index="0" function="20" pad="PA02" ioset="1"/>
              <signal group="IN" index="0" function="21" pad="PA10" ioset="1"/>
              <signal group="IN" index="0" function="22" pad="PA14" ioset="1"/>
              <signal group="IN" index="0" function="23" pad="PB03" ioset="1"/>
              <signal group="IN" index="0" function="24" pad="PB07" ioset="1"/>
              <signal group="IN" index="0" function="25" pad="PA09" ioset="1"/>
              <signal group="IN" index="1" function="1" pad="PA01" ioset="2"/>
              <signal group="IN" index="1" function="2" pad="PA07" ioset="2"/>
              <signal group="IN" index="1" function="3" pad="PA12" ioset="2"/>
              <signal group="IN" index="1" function="4" pad="PB01" ioset="2"/>
              <signal group="IN" index="1" function="5" pad="PB07" ioset="2"/>
              <signal group="IN" index="1" function="6" pad="PC01" ioset="2"/>
              <signal group="IN" index="1" function="7" pad="PC07" ioset="2"/>
              <signal group="IN" index="1" function="8" pad="PD07" ioset="2"/>
              <signal group="IN" index="1" function="9" pad="PE01" ioset="2"/>
              <signal group="IN" index="1" function="10" pad="PA03" ioset="2"/>
              <signal group="IN" index="1" function="11" pad="PB02" ioset="2"/>
              <signal group="IN" index="1" function="12" pad="PC00" ioset="2"/>
              <signal group="IN" index="1" function="13" pad="PD04" ioset="2"/>
              <signal group="IN" index="1" function="14" pad="PE06" ioset="2"/>
              <signal group="IN" index="1" function="15" pad="PA04" ioset="2"/>
              <signal group="IN" index="1" function="16" pad="PA08" ioset="2"/>
              <signal group="IN" index="1" function="17" pad="PB12" ioset="2"/>
              <signal group="IN" index="1" function="18" pad="PB05" ioset="2"/>
              <signal group="IN" index="1" function="19" pad="PB09" ioset="2"/>
              <signal group="IN" index="1" function="20" pad="PB13" ioset="2"/>
              <signal group="IN" index="1" function="21" pad="PB00" ioset="2"/>
              <signal group="IN" index="1" function="22" pad="PB04" ioset="2"/>
              <signal group="IN" index="1" function="23" pad="PB08" ioset="2"/>
              <signal group="IN" index="1" function="24" pad="PA00" ioset="2"/>
              <signal group="IN" index="1" function="25" pad="PA11" ioset="2"/>
              <signal group="IN" index="2" function="1" pad="PA02" ioset="3"/>
              <signal group="IN" index="2" function="2" pad="PA08" ioset="3"/>
              <signal group="IN" index="2" function="3" pad="PA13" ioset="3"/>
              <signal group="IN" index="2" function="4" pad="PB02" ioset="3"/>
              <signal group="IN" index="2" function="5" pad="PB08" ioset="3"/>
              <signal group="IN" index="2" function="6" pad="PB13" ioset="3"/>
              <signal group="IN" index="2" function="7" pad="PC08" ioset="3"/>
              <signal group="IN" index="2" function="8" pad="PD02" ioset="3"/>
              <signal group="IN" index="2" function="9" pad="PE02" ioset="3"/>
              <signal group="IN" index="2" function="10" pad="PA04" ioset="3"/>
              <signal group="IN" index="2" function="11" pad="PB03" ioset="3"/>
              <signal group="IN" index="2" function="12" pad="PC01" ioset="3"/>
              <signal group="IN" index="2" function="13" pad="PD06" ioset="3"/>
              <signal group="IN" index="2" function="14" pad="PE00" ioset="3"/>
              <signal group="IN" index="2" function="15" pad="PA05" ioset="3"/>
              <signal group="IN" index="2" function="16" pad="PA09" ioset="3"/>
              <signal group="IN" index="2" function="17" pad="PB06" ioset="3"/>
              <signal group="IN" index="2" function="18" pad="PB10" ioset="3"/>
              <signal group="IN" index="2" function="19" pad="PA00" ioset="3"/>
              <signal group="IN" index="2" function="20" pad="PB01" ioset="3"/>
              <signal group="IN" index="2" function="21" pad="PB05" ioset="3"/>
              <signal group="IN" index="2" function="22" pad="PB09" ioset="3"/>
              <signal group="IN" index="2" function="23" pad="PA01" ioset="3"/>
              <signal group="IN" index="2" function="24" pad="PA12" ioset="3"/>
              <signal group="IN" index="3" function="1" pad="PA00" ioset="1"/>
              <signal group="IN" index="3" function="2" pad="PA06" ioset="1"/>
              <signal group="IN" index="3" function="3" pad="PA11" ioset="1"/>
              <signal group="IN" index="3" function="4" pad="PB00" ioset="1"/>
              <signal group="IN" index="3" function="5" pad="PB06" ioset="1"/>
              <signal group="IN" index="3" function="6" pad="PB11" ioset="1"/>
              <signal group="IN" index="3" function="7" pad="PC00" ioset="1"/>
              <signal group="IN" index="3" function="8" pad="PD06" ioset="1"/>
              <signal group="IN" index="3" function="9" pad="PE00" ioset="1"/>
              <signal group="IN" index="3" function="10" pad="PE06" ioset="1"/>
              <signal group="IN" index="3" function="11" pad="PB01" ioset="1"/>
              <signal group="IN" index="3" function="12" pad="PC09" ioset="1"/>
              <signal group="IN" index="3" function="13" pad="PD03" ioset="1"/>
              <signal group="IN" index="3" function="14" pad="PE04" ioset="1"/>
              <signal group="IN" index="3" function="15" pad="PA03" ioset="1"/>
              <signal group="IN" index="3" function="16" pad="PA07" ioset="1"/>
              <signal group="IN" index="3" function="17" pad="PB04" ioset="1"/>
              <signal group="IN" index="3" function="18" pad="PB08" ioset="1"/>
              <signal group="IN" index="3" function="19" pad="PB12" ioset="1"/>
              <signal group="IN" index="3" function="20" pad="PA02" ioset="1"/>
              <signal group="IN" index="3" function="21" pad="PA10" ioset="1"/>
              <signal group="IN" index="3" function="22" pad="PA14" ioset="1"/>
              <signal group="IN" index="3" function="23" pad="PB03" ioset="1"/>
              <signal group="IN" index="3" function="24" pad="PB07" ioset="1"/>
              <signal group="IN" index="3" function="25" pad="PA09" ioset="1"/>
              <signal group="IN" index="4" function="1" pad="PA01" ioset="2"/>
              <signal group="IN" index="4" function="2" pad="PA07" ioset="2"/>
              <signal group="IN" index="4" function="3" pad="PA12" ioset="2"/>
              <signal group="IN" index="4" function="4" pad="PB01" ioset="2"/>
              <signal group="IN" index="4" function="5" pad="PB07" ioset="2"/>
              <signal group="IN" index="4" function="6" pad="PC01" ioset="2"/>
              <signal group="IN" index="4" function="7" pad="PC07" ioset="2"/>
              <signal group="IN" index="4" function="8" pad="PD07" ioset="2"/>
              <signal group="IN" index="4" function="9" pad="PE01" ioset="2"/>
              <signal group="IN" index="4" function="10" pad="PA03" ioset="2"/>
              <signal group="IN" index="4" function="11" pad="PB02" ioset="2"/>
              <signal group="IN" index="4" function="12" pad="PC00" ioset="2"/>
              <signal group="IN" index="4" function="13" pad="PD04" ioset="2"/>
              <signal group="IN" index="4" function="14" pad="PE06" ioset="2"/>
              <signal group="IN" index="4" function="15" pad="PA04" ioset="2"/>
              <signal group="IN" index="4" function="16" pad="PA08" ioset="2"/>
              <signal group="IN" index="4" function="17" pad="PB12" ioset="2"/>
              <signal group="IN" index="4" function="18" pad="PB05" ioset="2"/>
              <signal group="IN" index="4" function="19" pad="PB09" ioset="2"/>
              <signal group="IN" index="4" function="20" pad="PB13" ioset="2"/>
              <signal group="IN" index="4" function="21" pad="PB00" ioset="2"/>
              <signal group="IN" index="4" function="22" pad="PB04" ioset="2"/>
              <signal group="IN" index="4" function="23" pad="PB08" ioset="2"/>
              <signal group="IN" index="4" function="24" pad="PA00" ioset="2"/>
              <signal group="IN" index="4" function="25" pad="PA11" ioset="2"/>
              <signal group="IN" index="5" function="1" pad="PA02" ioset="3"/>
              <signal group="IN" index="5" function="2" pad="PA08" ioset="3"/>
              <signal group="IN" index="5" function="3" pad="PA13" ioset="3"/>
              <signal group="IN" index="5" function="4" pad="PB02" ioset="3"/>
              <signal group="IN" index="5" function="5" pad="PB08" ioset="3"/>
              <signal group="IN" index="5" function="6" pad="PB13" ioset="3"/>
              <signal group="IN" index="5" function="7" pad="PC08" ioset="3"/>
              <signal group="IN" index="5" function="8" pad="PD02" ioset="3"/>
              <signal group="IN" index="5" function="9" pad="PE02" ioset="3"/>
              <signal group="IN" index="5" function="10" pad="PA04" ioset="3"/>
              <signal group="IN" index="5" function="11" pad="PB03" ioset="3"/>
              <signal group="IN" index="5" function="12" pad="PC01" ioset="3"/>
              <signal group="IN" index="5" function="13" pad="PD06" ioset="3"/>
              <signal group="IN" index="5" function="14" pad="PE00" ioset="3"/>
              <signal group="IN" index="5" function="15" pad="PA05" ioset="3"/>
              <signal group="IN" index="5" function="16" pad="PA09" ioset="3"/>
              <signal group="IN" index="5" function="17" pad="PB06" ioset="3"/>
              <signal group="IN" index="5" function="18" pad="PB10" ioset="3"/>
              <signal group="IN" index="5" function="19" pad="PA00" ioset="3"/>
              <signal group="IN" index="5" function="20" pad="PB01" ioset="3"/>
              <signal group="IN" index="5" function="21" pad="PB05" ioset="3"/>
              <signal group="IN" index="5" function="22" pad="PB09" ioset="3"/>
              <signal group="IN" index="5" function="23" pad="PA01" ioset="3"/>
              <signal group="IN" index="5" function="24" pad="PA12" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA00" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA01" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA02" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA04" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA05" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA08" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA09" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA12" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA13" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PB01" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PB02" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PB03" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PB05" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PB06" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PB08" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PB09" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PB10" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PB13" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PC01" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PC08" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PD02" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PD06" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PE00" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PE02" ioset="3"/>
              <signal group="OUT" index="0" function="1" pad="PA01" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PA04" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PA10" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PA15" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PB00" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PB04" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PB10" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PB14" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PB15" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PC08" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PC10" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PC11" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PD00" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PD01" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PD02" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PD04" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PE02" ioset="5"/>
              <signal group="OUT" index="0" function="1" pad="PE04" ioset="5"/>
              <signal group="OUT" index="1" function="1" pad="PA00" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PA01" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PA03" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PA04" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PA07" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PA08" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PA11" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PA12" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB00" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB01" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB02" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB04" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB05" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB07" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB08" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB09" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB12" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PB13" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PC00" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PC01" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PC07" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PD04" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PD07" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PE01" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PE06" ioset="2"/>
              <signal group="OUT" index="1" function="1" pad="PA00" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA01" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA02" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA03" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA05" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA06" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA08" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA09" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA10" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA13" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PA14" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PB02" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PB03" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PB04" ioset="4"/>
              <signal group="OUT" index="1" function="1" pad="PB06" ioset="4"/>
