zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
          </instance>
        </module>
        <module name="DAC_CTRL" id="05063" name2="dac_7bit_ctrl_v1" version="A.3 Draft">
          <instance name="DAC_CTRL">
            <register-group name="DAC_CTRL" name-in-module="DAC_CTRL" address-space="base" offset="0x44002E00"/>
            <signals>
              <signal group="DACOUT" function="DAC" pad="PA3"/>
            </signals>
          </instance>
        </module>
        <module name="DMAC" id="04587" name2="dma_u2503_v2" version="A">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41004000"/>
            <parameters>
              <param name="TRIG_NUM" value="67"/>
              <param name="DMA_EVIN_NUM" value="8"/>
              <param name="DMA_CH_NUM" value="16"/>
              <param name="DMA_EVOUT_NUM" value="4"/>
              <param name="DMA_FIFO_SIZE" value="16"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for DMAC"/>
              <param name="PAC_ID" value="34" caption="Index for DMAC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DMT" id="01520" name2="wdt_dmt_upb_v1" version="A">
          <instance name="DMT">
            <register-group name="DMT" name-in-module="DMT" address-space="base" offset="0x44000E00"/>
            <parameters>
              <param name="DMT_HOLDREG_PRESENT" value="1" caption="Used for 16 bit devices only"/>
              <param name="UPB_ADDRL" value="0xE00" caption="Base address for the macro"/>
            </parameters>
          </instance>
        </module>
        <module name="DSCON" id="04824" name2="lpwr_xdpslp_ctrl_v2" version="A">
          <instance name="DSCON">
            <register-group name="DSCON" name-in-module="DSCON" address-space="base" offset="0x42011000"/>
            <parameters>
              <param name="DS_NUM_XSEMA_REGS" value="1"/>
              <param name="SYS_DATA_WIDTH" value="32"/>
              <param name="KEYRAMEN_BIT_PRESENT" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="05006" name2="icd_dsu_u2410_v4" version="A">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41000000"/>
            <signals>
              <signal group="MSA" function="TEST_MODES" pad="PB10"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DCC0" value="2"/>
              <param name="DMAC_ID_DCC1" value="3"/>
              <param name="PERM_ADDR_START1" value="0x44000600" caption="Permissible address range start"/>
              <param name="PERM_ADDR_END1" value="0x440007FF" caption="Permissible address range end"/>
              <param name="PERM_ADDR_START2" value="0x44003000" caption="Second permissible address range start"/>
              <param name="PERM_ADDR_END2" value="0x44003FFF" caption="Second permissible address range end"/>
              <param name="FLASH_ADDR_START" value="0x00800000" caption="Flash address start"/>
              <param name="FLASH_ADDR_END" value="0x011FFFFF" caption="Flash address end"/>
              <param name="MBIST_IMPLEMENTED" value="1" caption="MBIST Controller Enabled"/>
              <param name="INSTANCE_ID" value="32" caption="Instance index for DSU"/>
              <param name="DSU_DMAC_ID_DCC0" value="2"/>
              <param name="DSU_DMAC_ID_DCC1" value="3"/>
              <param name="PAC_ID" value="32" caption="Index for DSU registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DWT" id="SYSTEM_IP" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
          </instance>
        </module>
        <module name="EIC" id="04714" name2="int_eic_u2254_v4" version="A">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="EXTINT" index="0" function="1" pad="PA00" ioset="1"/>
              <signal group="EXTINT" index="0" function="2" pad="PA06" ioset="1"/>
              <signal group="EXTINT" index="0" function="3" pad="PA11" ioset="1"/>
              <signal group="EXTINT" index="0" function="4" pad="PB00" ioset="1"/>
              <signal group="EXTINT" index="0" function="5" pad="PB06" ioset="1"/>
              <signal group="EXTINT" index="0" function="6" pad="PB11" ioset="1"/>
              <signal group="EXTINT" index="0" function="7" pad="PC00" ioset="1"/>
              <signal group="EXTINT" index="0" function="8" pad="PD06" ioset="1"/>
              <signal group="EXTINT" index="0" function="9" pad="PE00" ioset="1"/>
              <signal group="EXTINT" index="0" function="10" pad="PE06" ioset="1"/>
              <signal group="EXTINT" index="0" function="11" pad="PB01" ioset="1"/>
              <signal group="EXTINT" index="0" function="12" pad="PC09" ioset="1"/>
              <signal group="EXTINT" index="0" function="13" pad="PD03" ioset="1"/>
              <signal group="EXTINT" index="0" function="14" pad="PE04" ioset="1"/>
              <signal group="EXTINT" index="0" function="15" pad="PA03" ioset="1"/>
              <signal group="EXTINT" index="0" function="16" pad="PA07" ioset="1"/>
              <signal group="EXTINT" index="0" function="17" pad="PB04" ioset="1"/>
              <signal group="EXTINT" index="0" function="18" pad="PB08" ioset="1"/>
              <signal group="EXTINT" index="0" function="19" pad="PB12" ioset="1"/>
              <signal group="EXTINT" index="0" function="20" pad="PA02" ioset="1"/>
              <signal group="EXTINT" index="0" function="21" pad="PA10" ioset="1"/>
              <signal group="EXTINT" index="0" function="22" pad="PA14" ioset="1"/>
              <signal group="EXTINT" index="0" function="23" pad="PB03" ioset="1"/>
              <signal group="EXTINT" index="0" function="24" pad="PB07" ioset="1"/>
              <signal group="EXTINT" index="0" function="25" pad="PA09" ioset="1"/>
              <signal group="EXTINT" index="1" function="1" pad="PA01" ioset="2"/>
              <signal group="EXTINT" index="1" function="2" pad="PA07" ioset="2"/>
              <signal group="EXTINT" index="1" function="3" pad="PA12" ioset="2"/>
              <signal group="EXTINT" index="1" function="4" pad="PB01" ioset="2"/>
              <signal group="EXTINT" index="1" function="5" pad="PB07" ioset="2"/>
              <signal group="EXTINT" index="1" function="6" pad="PC01" ioset="2"/>
              <signal group="EXTINT" index="1" function="7" pad="PC07" ioset="2"/>
              <signal group="EXTINT" index="1" function="8" pad="PD07" ioset="2"/>
              <signal group="EXTINT" index="1" function="9" pad="PE01" ioset="2"/>
              <signal group="EXTINT" index="1" function="10" pad="PA03" ioset="2"/>
              <signal group="EXTINT" index="1" function="11" pad="PB02" ioset="2"/>
              <signal group="EXTINT" index="1" function="12" pad="PC00" ioset="2"/>
              <signal group="EXTINT" index="1" function="13" pad="PD04" ioset="2"/>
              <signal group="EXTINT" index="1" function="14" pad="PE06" ioset="2"/>
              <signal group="EXTINT" index="1" function="15" pad="PA04" ioset="2"/>
              <signal group="EXTINT" index="1" function="16" pad="PA08" ioset="2"/>
              <signal group="EXTINT" index="1" function="17" pad="PB12" ioset="2"/>
              <signal group="EXTINT" index="1" function="18" pad="PB05" ioset="2"/>
              <signal group="EXTINT" index="1" function="19" pad="PB09" ioset="2"/>
              <signal group="EXTINT" index="1" function="20" pad="PB13" ioset="2"/>
              <signal group="EXTINT" index="1" function="21" pad="PB00" ioset="2"/>
              <signal group="EXTINT" index="1" function="22" pad="PB04" ioset="2"/>
              <signal group="EXTINT" index="1" function="23" pad="PB08" ioset="2"/>
              <signal group="EXTINT" index="1" function="24" pad="PA00" ioset="2"/>
              <signal group="EXTINT" index="1" function="25" pad="PA11" ioset="2"/>
              <signal group="EXTINT" index="2" function="1" pad="PA02" ioset="3"/>
              <signal group="EXTINT" index="2" function="2" pad="PA08" ioset="3"/>
              <signal group="EXTINT" index="2" function="3" pad="PA13" ioset="3"/>
              <signal group="EXTINT" index="2" function="4" pad="PB02" ioset="3"/>
              <signal group="EXTINT" index="2" function="5" pad="PB08" ioset="3"/>
              <signal group="EXTINT" index="2" function="6" pad="PB13" ioset="3"/>
              <signal group="EXTINT" index="2" function="7" pad="PC08" ioset="3"/>
              <signal group="EXTINT" index="2" function="8" pad="PD02" ioset="3"/>
              <signal group="EXTINT" index="2" function="9" pad="PE02" ioset="3"/>
              <signal group="EXTINT" index="2" function="10" pad="PA04" ioset="3"/>
              <signal group="EXTINT" index="2" function="11" pad="PB03" ioset="3"/>
              <signal group="EXTINT" index="2" function="12" pad="PC01" ioset="3"/>
              <signal group="EXTINT" index="2" function="13" pad="PD06" ioset="3"/>
              <signal group="EXTINT" index="2" function="14" pad="PE00" ioset="3"/>
              <signal group="EXTINT" index="2" function="15" pad="PA05" ioset="3"/>
              <signal group="EXTINT" index="2" function="16" pad="PA09" ioset="3"/>
              <signal group="EXTINT" index="2" function="17" pad="PB06" ioset="3"/>
              <signal group="EXTINT" index="2" function="18" pad="PB10" ioset="3"/>
              <signal group="EXTINT" index="2" function="19" pad="PA00" ioset="3"/>
              <signal group="EXTINT" index="2" function="20" pad="PB01" ioset="3"/>
              <signal group="EXTINT" index="2" function="21" pad="PB05" ioset="3"/>
              <signal group="EXTINT" index="2" function="22" pad="PB09" ioset="3"/>
              <signal group="EXTINT" index="2" function="23" pad="PA01" ioset="3"/>
              <signal group="EXTINT" index="2" function="24" pad="PA12" ioset="3"/>
              <signal group="EXTINT" index="3" function="1" pad="PA03" ioset="4"/>
              <signal group="EXTINT" index="3" function="2" pad="PA09" ioset="4"/>
              <signal group="EXTINT" index="3" function="3" pad="PA14" ioset="4"/>
              <signal group="EXTINT" index="3" function="4" pad="PB03" ioset="4"/>
              <signal group="EXTINT" index="3" function="5" pad="PC09" ioset="4"/>
              <signal group="EXTINT" index="3" function="6" pad="PD03" ioset="4"/>
              <signal group="EXTINT" index="3" function="7" pad="PE03" ioset="4"/>
              <signal group="EXTINT" index="3" function="8" pad="PA00" ioset="4"/>
              <signal group="EXTINT" index="3" function="9" pad="PB04" ioset="4"/>
              <signal group="EXTINT" index="3" function="10" pad="PC07" ioset="4"/>
              <signal group="EXTINT" index="3" function="11" pad="PD07" ioset="4"/>
              <signal group="EXTINT" index="3" function="12" pad="PE01" ioset="4"/>
              <signal group="EXTINT" index="3" function="13" pad="PA06" ioset="4"/>
              <signal group="EXTINT" index="3" function="14" pad="PA10" ioset="4"/>
              <signal group="EXTINT" index="3" function="15" pad="PB07" ioset="4"/>
              <signal group="EXTINT" index="3" function="16" pad="PB11" ioset="4"/>
              <signal group="EXTINT" index="3" function="17" pad="PA01" ioset="4"/>
              <signal group="EXTINT" index="3" function="18" pad="PA05" ioset="4"/>
              <signal group="EXTINT" index="3" function="19" pad="PA13" ioset="4"/>
              <signal group="EXTINT" index="3" function="20" pad="PB02" ioset="4"/>
              <signal group="EXTINT" index="3" function="21" pad="PB06" ioset="4"/>
              <signal group="EXTINT" index="3" function="22" pad="PB10" ioset="4"/>
              <signal group="EXTINT" index="3" function="23" pad="PA08" ioset="4"/>
              <signal group="EXTINT" index="3" function="24" pad="PA02" ioset="4"/>
              <signal group="NMI" function="1" pad="PA03" ioset="4"/>
              <signal group="NMI" function="2" pad="PA09" ioset="4"/>
              <signal group="NMI" function="3" pad="PA14" ioset="4"/>
              <signal group="NMI" function="4" pad="PB03" ioset="4"/>
              <signal group="NMI" function="5" pad="PC09" ioset="4"/>
              <signal group="NMI" function="6" pad="PD03" ioset="4"/>
              <signal group="NMI" function="7" pad="PE03" ioset="4"/>
              <signal group="NMI" function="8" pad="PA00" ioset="4"/>
              <signal group="NMI" function="9" pad="PB04" ioset="4"/>
              <signal group="NMI" function="10" pad="PC07" ioset="4"/>
              <signal group="NMI" function="11" pad="PD07" ioset="4"/>
              <signal group="NMI" function="12" pad="PE01" ioset="4"/>
              <signal group="NMI" function="13" pad="PA06" ioset="4"/>
              <signal group="NMI" function="14" pad="PA10" ioset="4"/>
              <signal group="NMI" function="15" pad="PB07" ioset="4"/>
              <signal group="NMI" function="16" pad="PB11" ioset="4"/>
              <signal group="NMI" function="17" pad="PA01" ioset="4"/>
              <signal group="NMI" function="18" pad="PA05" ioset="4"/>
              <signal group="NMI" function="19" pad="PA13" ioset="4"/>
              <signal group="NMI" function="20" pad="PB02" ioset="4"/>
              <signal group="NMI" function="21" pad="PB06" ioset="4"/>
              <signal group="NMI" function="22" pad="PB10" ioset="4"/>
              <signal group="NMI" function="23" pad="PA08" ioset="4"/>
              <signal group="NMI" function="24" pad="PA02" ioset="4"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="0"/>
              <param name="CHIP_EIC_PADDR_MSB" value="9"/>
              <param name="CHIP_EIC_EXTINT_NUM" value="4"/>
              <param name="CHIP_EIC_NMISENSE_DEFAULT_VALUE" value="3"/>
              <param name="CHIP_EIC_NMI_FORCE_DETECTION" value="0"/>
              <param name="CHIP_EIC_NUMBER_OF_CONFIG_REGS" value="1" caption="(CHIP_EIC_EXTINT_NUM+7)/8"/>
              <param name="CHIP_EIC_NUMBER_OF_DPRESCALER_REGS" value="1" caption="(CHIP_EIC_EXTINT_NUM+7)/8"/>
              <param name="CHIP_EIC_NUMBER_OF_INTERRUPTS" value="4" caption="CHIP_EIC_EXTINT_NUM"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for EIC"/>
              <param name="PAC_ID" value="2" caption="Index for EIC registers write protection"/>
            </parameters>
          </instance>
        </module>
