zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <module name="EFUSE" id="EIP_00504" version="1.0.0">
          <instance name="EFUSE">
            <register-group name="EFUSE" name-in-module="EFUSE" address-space="fuses" offset="0x0"/>
          </instance>
        </module>
        <module name="ETH" id="03792" name2="eth_gem_apb_v1" version="A">
          <instance name="ETH">
            <register-group name="ETH" name-in-module="ETH" address-space="base" offset="0x4100A000"/>
            <signals>
              <signal group="TSUCOMP" function="14" pad="PA01" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PA04" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PA10" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PA15" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PB00" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PB04" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PB10" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PB14" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PB15" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PC08" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PC10" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PC11" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PD00" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PD01" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PD02" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PD04" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PE02" ioset="5"/>
              <signal group="TSUCOMP" function="14" pad="PE04" ioset="5"/>
              <signal group="GREFCLKOUT" function="GMAC_CLK_OUT" pad="RPC1"/>
              <signal group="GTX" index="0" function="GMAC_GTX0" pad="RPC0"/>
              <signal group="GTX" index="1" function="GMAC_GTX1" pad="RPE1"/>
              <signal group="GRX" index="0" function="GMAC_GRX0" pad="RPA14"/>
              <signal group="GRX" index="1" function="GMAC_GRX1" pad="RPA13"/>
              <signal group="GRXER" function="GMAC_GRXER" pad="RPC8"/>
              <signal group="GTXEN" function="GMAC_GTXEN" pad="RPC9"/>
              <signal group="GCRS_DV" function="GMAC_GCRS_DV" pad="RPE2"/>
              <signal group="GMDIO" function="GMAC_GMDIO" pad="RPD6"/>
              <signal group="GMDC" function="GMAC_GMDC" pad="RPD7"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="30"/>
              <param name="AXI_MSTR" value="0"/>
              <param name="MCU32_AXI" value="0"/>
              <param name="DATA_MSB" value="31"/>
              <param name="RXSRAM_SIZE" value="32768"/>
              <param name="TXSRAM_SIZE" value="32768"/>
              <param name="PAC_ID" value="37" caption="Index for ETH registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ETM" id="SYSTEM_IP" version="1.0.0">
          <instance name="ETM">
            <register-group name="ETM" name-in-module="ETM" address-space="base" offset="0xE0041000"/>
          </instance>
        </module>
        <module name="EVSYS" id="04712" name2="ptg_evsys_u2504_v3" version="A">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="INSTANCE_ID" value="35" caption="Instance index for EVSYS"/>
              <param name="GCLK_ID_0" value="12"/>
              <param name="GCLK_ID_1" value="13"/>
              <param name="GCLK_ID_2" value="14"/>
              <param name="GCLK_ID_3" value="15"/>
              <param name="GCLK_ID_4" value="16"/>
              <param name="GCLK_ID_5" value="17"/>
              <param name="GCLK_ID_6" value="18"/>
              <param name="GCLK_ID_7" value="19"/>
              <param name="GCLK_ID_8" value="20"/>
              <param name="GCLK_ID_9" value="21"/>
              <param name="GCLK_ID_10" value="22"/>
              <param name="GCLK_ID_11" value="23"/>
              <param name="CHIP_EVSYS_PADDR_MSB" value="12"/>
              <param name="CHIP_EVSYS_EXTEVT_NUM" value="0"/>
              <param name="CHIP_EVSYS_ASYNCHRONOUS_CHANNELS" value="32"/>
              <param name="CHIP_EVSYS_CHANNELS" value="32"/>
              <param name="CHIP_EVSYS_GENERATORS" value="89"/>
              <param name="CHIP_EVSYS_SYNCH_NUM" value="12"/>
              <param name="CHIP_EVSYS_USERS" value="59"/>
              <param name="CHIP_EVSYS_CHANNELS_BITS" value="5"/>
              <param name="CHIP_EVSYS_GENERATORS_BITS" value="7"/>
              <param name="CHIP_EVSYS_SYNCH_NUM_BITS" value="4"/>
              <param name="CHIP_EVSYS_USERS_BITS" value="6"/>
              <param name="PAC_ID" value="35" caption="Index for EVSYS registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPU">
            <register-group name="FPU" name-in-module="FPU" address-space="base" offset="0xE000EF30"/>
          </instance>
        </module>
        <module name="FREQM" id="04703" name2="clk_freqm_u2257_v4" version="A">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40000400"/>
            <parameters>
              <param name="INSTANCE_ID" value="1" caption="Instance index for FREQM"/>
              <param name="GCLK_ID_MSR" value="1"/>
              <param name="GCLK_ID_REF" value="2"/>
              <param name="PAC_ID" value="1" caption="Index for FREQM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="fuses" name2="fuses" version="A">
          <instance name="FUSES">
            <register-group name="FUSES_DEVICECFG" name-in-module="FUSES_DEVICECFG" address-space="base" offset="0x00810E80"/>
