zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
          </instance>
        </module>
        <module name="GPIO" id="02467" name2="gpio_ports_upb_v1" version="A">
          <instance name="GPIOE">
            <register-group name="GPIOE" name-in-module="GPIO" address-space="base" offset="0x44002D00"/>
            <signals>
              <signal group="IOCE" index="0" function="CHANGE_NOTIFICATION" pad="PE0"/>
              <signal group="IOCE" index="1" function="CHANGE_NOTIFICATION" pad="PE1"/>
              <signal group="IOCE" index="2" function="CHANGE_NOTIFICATION" pad="PE2"/>
              <signal group="IOCE" index="3" function="CHANGE_NOTIFICATION" pad="PE3"/>
              <signal group="IOCE" index="4" function="CHANGE_NOTIFICATION" pad="PE4"/>
              <signal group="IOCE" index="5" function="CHANGE_NOTIFICATION" pad="PE5"/>
              <signal group="IOCE" index="6" function="CHANGE_NOTIFICATION" pad="PE6"/>
              <signal group="RE" index="0" function="PORT_I_O" pad="PE0"/>
              <signal group="RE" index="1" function="PORT_I_O" pad="PE1"/>
              <signal group="RE" index="2" function="PORT_I_O" pad="PE2"/>
              <signal group="RE" index="3" function="PORT_I_O" pad="PE3"/>
              <signal group="RE" index="4" function="PORT_I_O" pad="PE4"/>
              <signal group="RE" index="5" function="PORT_I_O" pad="PE5"/>
              <signal group="RE" index="6" function="PORT_I_O" pad="PE6"/>
            </signals>
          </instance>
          <instance name="GPIOD">
            <register-group name="GPIOD" name-in-module="GPIO" address-space="base" offset="0x44002C00"/>
            <signals>
              <signal group="IOCD" index="2" function="CHANGE_NOTIFICATION" pad="PD2"/>
              <signal group="IOCD" index="3" function="CHANGE_NOTIFICATION" pad="PD3"/>
              <signal group="IOCD" index="4" function="CHANGE_NOTIFICATION" pad="PD4"/>
              <signal group="IOCD" index="5" function="CHANGE_NOTIFICATION" pad="PD5"/>
              <signal group="IOCD" index="6" function="CHANGE_NOTIFICATION" pad="PD6"/>
              <signal group="IOCD" index="7" function="CHANGE_NOTIFICATION" pad="PD7"/>
              <signal group="RD" index="0" function="PORT_I_O" pad="PD0"/>
              <signal group="RD" index="1" function="PORT_I_O" pad="PD1"/>
              <signal group="RD" index="2" function="PORT_I_O" pad="PD2"/>
              <signal group="RD" index="3" function="PORT_I_O" pad="PD3"/>
              <signal group="RD" index="4" function="PORT_I_O" pad="PD4"/>
              <signal group="RD" index="5" function="PORT_I_O" pad="PD5"/>
              <signal group="RD" index="6" function="PORT_I_O" pad="PD6"/>
              <signal group="RD" index="7" function="PORT_I_O" pad="PD7"/>
            </signals>
          </instance>
          <instance name="GPIOC">
            <register-group name="GPIOC" name-in-module="GPIO" address-space="base" offset="0x44002B00"/>
            <signals>
              <signal group="IOCC" index="0" function="CHANGE_NOTIFICATION" pad="PC0"/>
              <signal group="IOCC" index="1" function="CHANGE_NOTIFICATION" pad="PC1"/>
              <signal group="IOCC" index="7" function="CHANGE_NOTIFICATION" pad="PC7"/>
              <signal group="IOCC" index="8" function="CHANGE_NOTIFICATION" pad="PC8"/>
              <signal group="IOCC" index="9" function="CHANGE_NOTIFICATION" pad="PC9"/>
              <signal group="RC" index="0" function="PORT_I_O" pad="PC0"/>
              <signal group="RC" index="1" function="PORT_I_O" pad="PC1"/>
              <signal group="RC" index="7" function="PORT_I_O" pad="PC7"/>
              <signal group="RC" index="8" function="PORT_I_O" pad="PC8"/>
              <signal group="RC" index="9" function="PORT_I_O" pad="PC9"/>
              <signal group="RC" index="10" function="PORT_I_O" pad="PC10"/>
              <signal group="RC" index="11" function="PORT_I_O" pad="PC11"/>
            </signals>
          </instance>
          <instance name="GPIOB">
            <register-group name="GPIOB" name-in-module="GPIO" address-space="base" offset="0x44002A00"/>
            <signals>
              <signal group="IOCB" index="0" function="CHANGE_NOTIFICATION" pad="PB0"/>
              <signal group="IOCB" index="1" function="CHANGE_NOTIFICATION" pad="PB1"/>
              <signal group="IOCB" index="2" function="CHANGE_NOTIFICATION" pad="PB2"/>
              <signal group="IOCB" index="3" function="CHANGE_NOTIFICATION" pad="PB3"/>
              <signal group="IOCB" index="4" function="CHANGE_NOTIFICATION" pad="PB4"/>
              <signal group="IOCB" index="5" function="CHANGE_NOTIFICATION" pad="PB5"/>
              <signal group="IOCB" index="6" function="CHANGE_NOTIFICATION" pad="PB6"/>
              <signal group="IOCB" index="7" function="CHANGE_NOTIFICATION" pad="PB7"/>
              <signal group="IOCB" index="8" function="CHANGE_NOTIFICATION" pad="PB8"/>
              <signal group="IOCB" index="9" function="CHANGE_NOTIFICATION" pad="PB9"/>
              <signal group="IOCB" index="10" function="CHANGE_NOTIFICATION" pad="PB10"/>
              <signal group="IOCB" index="11" function="CHANGE_NOTIFICATION" pad="PB11"/>
              <signal group="IOCB" index="12" function="CHANGE_NOTIFICATION" pad="PB12"/>
              <signal group="IOCB" index="13" function="CHANGE_NOTIFICATION" pad="PB13"/>
              <signal group="IOCB" index="14" function="CHANGE_NOTIFICATION" pad="PB14"/>
              <signal group="IOCB" index="15" function="CHANGE_NOTIFICATION" pad="PB15"/>
              <signal group="RB" index="0" function="PORT_I_O" pad="PB0"/>
              <signal group="RB" index="1" function="PORT_I_O" pad="PB1"/>
              <signal group="RB" index="2" function="PORT_I_O" pad="PB2"/>
              <signal group="RB" index="3" function="PORT_I_O" pad="PB3"/>
              <signal group="RB" index="4" function="PORT_I_O" pad="PB4"/>
              <signal group="RB" index="5" function="PORT_I_O" pad="PB5"/>
              <signal group="RB" index="6" function="PORT_I_O" pad="PB6"/>
              <signal group="RB" index="7" function="PORT_I_O" pad="PB7"/>
              <signal group="RB" index="8" function="PORT_I_O" pad="PB8"/>
              <signal group="RB" index="9" function="PORT_I_O" pad="PB9"/>
              <signal group="RB" index="10" function="PORT_I_O" pad="PB10"/>
              <signal group="RB" index="11" function="PORT_I_O" pad="PB11"/>
              <signal group="RB" index="12" function="PORT_I_O" pad="PB12"/>
              <signal group="RB" index="13" function="PORT_I_O" pad="PB13"/>
              <signal group="RB" index="14" function="PORT_I_O" pad="PB14"/>
              <signal group="RB" index="15" function="PORT_I_O" pad="PB15"/>
            </signals>
          </instance>
          <instance name="GPIOA">
            <register-group name="GPIOA" name-in-module="GPIO" address-space="base" offset="0x44002900"/>
            <signals>
              <signal group="IOCA" index="0" function="CHANGE_NOTIFICATION" pad="PA0"/>
              <signal group="IOCA" index="1" function="CHANGE_NOTIFICATION" pad="PA1"/>
              <signal group="IOCA" index="2" function="CHANGE_NOTIFICATION" pad="PA2"/>
              <signal group="IOCA" index="3" function="CHANGE_NOTIFICATION" pad="PA3"/>
              <signal group="IOCA" index="4" function="CHANGE_NOTIFICATION" pad="PA4"/>
              <signal group="IOCA" index="5" function="CHANGE_NOTIFICATION" pad="PA5"/>
              <signal group="IOCA" index="6" function="CHANGE_NOTIFICATION" pad="PA6"/>
              <signal group="IOCA" index="7" function="CHANGE_NOTIFICATION" pad="PA7"/>
              <signal group="IOCA" index="8" function="CHANGE_NOTIFICATION" pad="PA8"/>
              <signal group="IOCA" index="9" function="CHANGE_NOTIFICATION" pad="PA9"/>
              <signal group="IOCA" index="10" function="CHANGE_NOTIFICATION" pad="PA10"/>
              <signal group="IOCA" index="11" function="CHANGE_NOTIFICATION" pad="PA11"/>
              <signal group="IOCA" index="12" function="CHANGE_NOTIFICATION" pad="PA12"/>
              <signal group="IOCA" index="13" function="CHANGE_NOTIFICATION" pad="PA13"/>
              <signal group="IOCA" index="14" function="CHANGE_NOTIFICATION" pad="PA14"/>
              <signal group="IOCA" index="15" function="CHANGE_NOTIFICATION" pad="PA15"/>
              <signal group="RA" index="0" function="PORT_I_O" pad="PA0"/>
              <signal group="RA" index="1" function="PORT_I_O" pad="PA1"/>
              <signal group="RA" index="2" function="PORT_I_O" pad="PA2"/>
              <signal group="RA" index="3" function="PORT_I_O" pad="PA3"/>
              <signal group="RA" index="4" function="PORT_I_O" pad="PA4"/>
              <signal group="RA" index="5" function="PORT_I_O" pad="PA5"/>
              <signal group="RA" index="6" function="PORT_I_O" pad="PA6"/>
              <signal group="RA" index="7" function="PORT_I_O" pad="PA7"/>
              <signal group="RA" index="8" function="PORT_I_O" pad="PA8"/>
              <signal group="RA" index="9" function="PORT_I_O" pad="PA9"/>
              <signal group="RA" index="10" function="PORT_I_O" pad="PA10"/>
              <signal group="RA" index="11" function="PORT_I_O" pad="PA11"/>
              <signal group="RA" index="12" function="PORT_I_O" pad="PA12"/>
              <signal group="RA" index="13" function="PORT_I_O" pad="PA13"/>
              <signal group="RA" index="14" function="PORT_I_O" pad="PA14"/>
              <signal group="RA" index="15" function="PORT_I_O" pad="PA15"/>
            </signals>
          </instance>
        </module>
