zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
            <signals>
              <signal group="HOME" index="0" function="1" pad="PA00" ioset="1"/>
              <signal group="HOME" index="0" function="2" pad="PA06" ioset="1"/>
              <signal group="HOME" index="0" function="3" pad="PA11" ioset="1"/>
              <signal group="HOME" index="0" function="4" pad="PB00" ioset="1"/>
              <signal group="HOME" index="0" function="5" pad="PB06" ioset="1"/>
              <signal group="HOME" index="0" function="6" pad="PB11" ioset="1"/>
              <signal group="HOME" index="0" function="7" pad="PC00" ioset="1"/>
              <signal group="HOME" index="0" function="8" pad="PD06" ioset="1"/>
              <signal group="HOME" index="0" function="9" pad="PE00" ioset="1"/>
              <signal group="HOME" index="0" function="10" pad="PE06" ioset="1"/>
              <signal group="HOME" index="0" function="11" pad="PB01" ioset="1"/>
              <signal group="HOME" index="0" function="12" pad="PC09" ioset="1"/>
              <signal group="HOME" index="0" function="13" pad="PD03" ioset="1"/>
              <signal group="HOME" index="0" function="14" pad="PE04" ioset="1"/>
              <signal group="HOME" index="0" function="15" pad="PA03" ioset="1"/>
              <signal group="HOME" index="0" function="16" pad="PA07" ioset="1"/>
              <signal group="HOME" index="0" function="17" pad="PB04" ioset="1"/>
              <signal group="HOME" index="0" function="18" pad="PB08" ioset="1"/>
              <signal group="HOME" index="0" function="19" pad="PB12" ioset="1"/>
              <signal group="HOME" index="0" function="20" pad="PA02" ioset="1"/>
              <signal group="HOME" index="0" function="21" pad="PA10" ioset="1"/>
              <signal group="HOME" index="0" function="22" pad="PA14" ioset="1"/>
              <signal group="HOME" index="0" function="23" pad="PB03" ioset="1"/>
              <signal group="HOME" index="0" function="24" pad="PB07" ioset="1"/>
              <signal group="HOME" index="0" function="25" pad="PA09" ioset="1"/>
              <signal group="HOME" index="0" function="1" pad="PA01" ioset="2"/>
              <signal group="HOME" index="0" function="2" pad="PA07" ioset="2"/>
              <signal group="HOME" index="0" function="3" pad="PA12" ioset="2"/>
              <signal group="HOME" index="0" function="4" pad="PB01" ioset="2"/>
              <signal group="HOME" index="0" function="5" pad="PB07" ioset="2"/>
              <signal group="HOME" index="0" function="6" pad="PC01" ioset="2"/>
              <signal group="HOME" index="0" function="7" pad="PC07" ioset="2"/>
              <signal group="HOME" index="0" function="8" pad="PD07" ioset="2"/>
              <signal group="HOME" index="0" function="9" pad="PE01" ioset="2"/>
              <signal group="HOME" index="0" function="10" pad="PA03" ioset="2"/>
              <signal group="HOME" index="0" function="11" pad="PB02" ioset="2"/>
              <signal group="HOME" index="0" function="12" pad="PC00" ioset="2"/>
              <signal group="HOME" index="0" function="13" pad="PD04" ioset="2"/>
              <signal group="HOME" index="0" function="14" pad="PE06" ioset="2"/>
              <signal group="HOME" index="0" function="15" pad="PA04" ioset="2"/>
              <signal group="HOME" index="0" function="16" pad="PA08" ioset="2"/>
              <signal group="HOME" index="0" function="17" pad="PB12" ioset="2"/>
              <signal group="HOME" index="0" function="18" pad="PB05" ioset="2"/>
              <signal group="HOME" index="0" function="19" pad="PB09" ioset="2"/>
              <signal group="HOME" index="0" function="20" pad="PB13" ioset="2"/>
              <signal group="HOME" index="0" function="21" pad="PB00" ioset="2"/>
              <signal group="HOME" index="0" function="22" pad="PB04" ioset="2"/>
              <signal group="HOME" index="0" function="23" pad="PB08" ioset="2"/>
              <signal group="HOME" index="0" function="24" pad="PA00" ioset="2"/>
              <signal group="HOME" index="0" function="25" pad="PA11" ioset="2"/>
              <signal group="INDX" index="0" function="1" pad="PA01" ioset="2"/>
              <signal group="INDX" index="0" function="2" pad="PA07" ioset="2"/>
              <signal group="INDX" index="0" function="3" pad="PA12" ioset="2"/>
              <signal group="INDX" index="0" function="4" pad="PB01" ioset="2"/>
              <signal group="INDX" index="0" function="5" pad="PB07" ioset="2"/>
              <signal group="INDX" index="0" function="6" pad="PC01" ioset="2"/>
              <signal group="INDX" index="0" function="7" pad="PC07" ioset="2"/>
              <signal group="INDX" index="0" function="8" pad="PD07" ioset="2"/>
              <signal group="INDX" index="0" function="9" pad="PE01" ioset="2"/>
              <signal group="INDX" index="0" function="10" pad="PA03" ioset="2"/>
              <signal group="INDX" index="0" function="11" pad="PB02" ioset="2"/>
              <signal group="INDX" index="0" function="12" pad="PC00" ioset="2"/>
              <signal group="INDX" index="0" function="13" pad="PD04" ioset="2"/>
              <signal group="INDX" index="0" function="14" pad="PE06" ioset="2"/>
              <signal group="INDX" index="0" function="15" pad="PA04" ioset="2"/>
              <signal group="INDX" index="0" function="16" pad="PA08" ioset="2"/>
              <signal group="INDX" index="0" function="17" pad="PB12" ioset="2"/>
              <signal group="INDX" index="0" function="18" pad="PB05" ioset="2"/>
              <signal group="INDX" index="0" function="19" pad="PB09" ioset="2"/>
              <signal group="INDX" index="0" function="20" pad="PB13" ioset="2"/>
              <signal group="INDX" index="0" function="21" pad="PB00" ioset="2"/>
              <signal group="INDX" index="0" function="22" pad="PB04" ioset="2"/>
              <signal group="INDX" index="0" function="23" pad="PB08" ioset="2"/>
              <signal group="INDX" index="0" function="24" pad="PA00" ioset="2"/>
              <signal group="INDX" index="0" function="25" pad="PA11" ioset="2"/>
              <signal group="INDX" index="0" function="1" pad="PA02" ioset="3"/>
              <signal group="INDX" index="0" function="2" pad="PA08" ioset="3"/>
              <signal group="INDX" index="0" function="3" pad="PA13" ioset="3"/>
              <signal group="INDX" index="0" function="4" pad="PB02" ioset="3"/>
              <signal group="INDX" index="0" function="5" pad="PB08" ioset="3"/>
              <signal group="INDX" index="0" function="6" pad="PB13" ioset="3"/>
              <signal group="INDX" index="0" function="7" pad="PC08" ioset="3"/>
              <signal group="INDX" index="0" function="8" pad="PD02" ioset="3"/>
              <signal group="INDX" index="0" function="9" pad="PE02" ioset="3"/>
              <signal group="INDX" index="0" function="10" pad="PA04" ioset="3"/>
              <signal group="INDX" index="0" function="11" pad="PB03" ioset="3"/>
              <signal group="INDX" index="0" function="12" pad="PC01" ioset="3"/>
              <signal group="INDX" index="0" function="13" pad="PD06" ioset="3"/>
              <signal group="INDX" index="0" function="14" pad="PE00" ioset="3"/>
              <signal group="INDX" index="0" function="15" pad="PA05" ioset="3"/>
              <signal group="INDX" index="0" function="16" pad="PA09" ioset="3"/>
              <signal group="INDX" index="0" function="17" pad="PB06" ioset="3"/>
              <signal group="INDX" index="0" function="18" pad="PB10" ioset="3"/>
              <signal group="INDX" index="0" function="19" pad="PA00" ioset="3"/>
              <signal group="INDX" index="0" function="20" pad="PB01" ioset="3"/>
              <signal group="INDX" index="0" function="21" pad="PB05" ioset="3"/>
              <signal group="INDX" index="0" function="22" pad="PB09" ioset="3"/>
              <signal group="INDX" index="0" function="23" pad="PA01" ioset="3"/>
              <signal group="INDX" index="0" function="24" pad="PA12" ioset="3"/>
              <signal group="QEA" index="0" function="1" pad="PA02" ioset="3"/>
              <signal group="QEA" index="0" function="2" pad="PA08" ioset="3"/>
              <signal group="QEA" index="0" function="3" pad="PA13" ioset="3"/>
              <signal group="QEA" index="0" function="4" pad="PB02" ioset="3"/>
              <signal group="QEA" index="0" function="5" pad="PB08" ioset="3"/>
              <signal group="QEA" index="0" function="6" pad="PB13" ioset="3"/>
              <signal group="QEA" index="0" function="7" pad="PC08" ioset="3"/>
              <signal group="QEA" index="0" function="8" pad="PD02" ioset="3"/>
              <signal group="QEA" index="0" function="9" pad="PE02" ioset="3"/>
              <signal group="QEA" index="0" function="10" pad="PA04" ioset="3"/>
              <signal group="QEA" index="0" function="11" pad="PB03" ioset="3"/>
              <signal group="QEA" index="0" function="12" pad="PC01" ioset="3"/>
              <signal group="QEA" index="0" function="13" pad="PD06" ioset="3"/>
              <signal group="QEA" index="0" function="14" pad="PE00" ioset="3"/>
              <signal group="QEA" index="0" function="15" pad="PA05" ioset="3"/>
              <signal group="QEA" index="0" function="16" pad="PA09" ioset="3"/>
              <signal group="QEA" index="0" function="17" pad="PB06" ioset="3"/>
              <signal group="QEA" index="0" function="18" pad="PB10" ioset="3"/>
              <signal group="QEA" index="0" function="19" pad="PA00" ioset="3"/>
              <signal group="QEA" index="0" function="20" pad="PB01" ioset="3"/>
              <signal group="QEA" index="0" function="21" pad="PB05" ioset="3"/>
              <signal group="QEA" index="0" function="22" pad="PB09" ioset="3"/>
              <signal group="QEA" index="0" function="23" pad="PA01" ioset="3"/>
              <signal group="QEA" index="0" function="24" pad="PA12" ioset="3"/>
              <signal group="QEA" index="0" function="1" pad="PA03" ioset="4"/>
              <signal group="QEA" index="0" function="2" pad="PA09" ioset="4"/>
              <signal group="QEA" index="0" function="3" pad="PA14" ioset="4"/>
              <signal group="QEA" index="0" function="4" pad="PB03" ioset="4"/>
              <signal group="QEA" index="0" function="5" pad="PC09" ioset="4"/>
              <signal group="QEA" index="0" function="6" pad="PD03" ioset="4"/>
              <signal group="QEA" index="0" function="7" pad="PE03" ioset="4"/>
              <signal group="QEA" index="0" function="8" pad="PA00" ioset="4"/>
              <signal group="QEA" index="0" function="9" pad="PB04" ioset="4"/>
              <signal group="QEA" index="0" function="10" pad="PC07" ioset="4"/>
              <signal group="QEA" index="0" function="11" pad="PD07" ioset="4"/>
              <signal group="QEA" index="0" function="12" pad="PE01" ioset="4"/>
              <signal group="QEA" index="0" function="13" pad="PA06" ioset="4"/>
              <signal group="QEA" index="0" function="14" pad="PA10" ioset="4"/>
              <signal group="QEA" index="0" function="15" pad="PB07" ioset="4"/>
              <signal group="QEA" index="0" function="16" pad="PB11" ioset="4"/>
              <signal group="QEA" index="0" function="17" pad="PA01" ioset="4"/>
              <signal group="QEA" index="0" function="18" pad="PA05" ioset="4"/>
              <signal group="QEA" index="0" function="19" pad="PA13" ioset="4"/>
              <signal group="QEA" index="0" function="20" pad="PB02" ioset="4"/>
              <signal group="QEA" index="0" function="21" pad="PB06" ioset="4"/>
              <signal group="QEA" index="0" function="22" pad="PB10" ioset="4"/>
              <signal group="QEA" index="0" function="23" pad="PA08" ioset="4"/>
              <signal group="QEA" index="0" function="24" pad="PA02" ioset="4"/>
              <signal group="QEB" index="0" function="1" pad="PA03" ioset="4"/>
              <signal group="QEB" index="0" function="2" pad="PA09" ioset="4"/>
              <signal group="QEB" index="0" function="3" pad="PA14" ioset="4"/>
              <signal group="QEB" index="0" function="4" pad="PB03" ioset="4"/>
              <signal group="QEB" index="0" function="5" pad="PC09" ioset="4"/>
              <signal group="QEB" index="0" function="6" pad="PD03" ioset="4"/>
              <signal group="QEB" index="0" function="7" pad="PE03" ioset="4"/>
              <signal group="QEB" index="0" function="8" pad="PA00" ioset="4"/>
              <signal group="QEB" index="0" function="9" pad="PB04" ioset="4"/>
              <signal group="QEB" index="0" function="10" pad="PC07" ioset="4"/>
              <signal group="QEB" index="0" function="11" pad="PD07" ioset="4"/>
              <signal group="QEB" index="0" function="12" pad="PE01" ioset="4"/>
              <signal group="QEB" index="0" function="13" pad="PA06" ioset="4"/>
              <signal group="QEB" index="0" function="14" pad="PA10" ioset="4"/>
              <signal group="QEB" index="0" function="15" pad="PB07" ioset="4"/>
              <signal group="QEB" index="0" function="16" pad="PB11" ioset="4"/>
              <signal group="QEB" index="0" function="17" pad="PA01" ioset="4"/>
              <signal group="QEB" index="0" function="18" pad="PA05" ioset="4"/>
              <signal group="QEB" index="0" function="19" pad="PA13" ioset="4"/>
              <signal group="QEB" index="0" function="20" pad="PB02" ioset="4"/>
              <signal group="QEB" index="0" function="21" pad="PB06" ioset="4"/>
              <signal group="QEB" index="0" function="22" pad="PB10" ioset="4"/>
              <signal group="QEB" index="0" function="23" pad="PA08" ioset="4"/>
              <signal group="QEB" index="0" function="24" pad="PA02" ioset="4"/>
              <signal group="QEB" index="0" function="1" pad="PA04" ioset="5"/>
              <signal group="QEB" index="0" function="2" pad="PA10" ioset="5"/>
              <signal group="QEB" index="0" function="3" pad="PB04" ioset="5"/>
              <signal group="QEB" index="0" function="4" pad="PB10" ioset="5"/>
              <signal group="QEB" index="0" function="5" pad="PD04" ioset="5"/>
              <signal group="QEB" index="0" function="6" pad="PE04" ioset="5"/>
              <signal group="QEB" index="0" function="7" pad="PA01" ioset="5"/>
              <signal group="QEB" index="0" function="8" pad="PB00" ioset="5"/>
              <signal group="QEB" index="0" function="9" pad="PC08" ioset="5"/>
              <signal group="QEB" index="0" function="10" pad="PD02" ioset="5"/>
              <signal group="QEB" index="0" function="11" pad="PE02" ioset="5"/>
              <signal group="QEB" index="0" function="12" pad="PC10" ioset="5"/>
              <signal group="QEB" index="0" function="13" pad="PC11" ioset="5"/>
              <signal group="QEB" index="0" function="14" pad="PA15" ioset="5"/>
              <signal group="QEB" index="0" function="15" pad="PB14" ioset="5"/>
              <signal group="QEB" index="0" function="16" pad="PB15" ioset="5"/>
              <signal group="QEB" index="0" function="17" pad="PD00" ioset="5"/>
              <signal group="QEB" index="0" function="18" pad="PD01" ioset="5"/>
              <signal group="CCMP" index="0" function="31" pad="PA00" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PA02" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PA03" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PA06" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PA07" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PA09" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PA10" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PA11" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PA14" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PB00" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PB01" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PB03" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PB04" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PB06" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PB07" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PB08" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PB11" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PB12" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PC00" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PC09" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PD03" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PD06" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PE00" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PE04" ioset="1"/>
              <signal group="CCMP" index="0" function="31" pad="PE06" ioset="1"/>
              <signal group="CCMP" index="0" function="13" pad="PA01" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PA04" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PA10" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PA15" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PB00" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PB04" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PB10" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PB14" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PB15" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PC08" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PC10" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PC11" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PD00" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PD01" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PD02" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PD04" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PE02" ioset="5"/>
              <signal group="CCMP" index="0" function="13" pad="PE04" ioset="5"/>
            </signals>
            <parameters>
              <param name="UPB_ADDRL" value="0x500"/>
              <param name="SET_CLR_INV_PRESENT" value="1" caption="Present"/>
            </parameters>
          </instance>
        </module>
