zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <module name="QSPI" id="04708" name2="com_qspi_u2008_v2" version="A">
          <instance name="QSPI">
            <register-group name="QSPI" name-in-module="QSPI" address-space="base" offset="0x42000000"/>
            <signals>
              <signal group="CS" function="SQI" pad="PB13"/>
              <signal group="DATA" index="0" function="SQI" pad="PA0"/>
              <signal group="DATA" index="1" function="SQI" pad="PB12"/>
              <signal group="DATA" index="2" function="SQI" pad="PB11"/>
              <signal group="DATA" index="3" function="SQI" pad="PA2"/>
              <signal group="SCK" function="SQI" pad="PA1"/>
              <signal group="CS" function="27" pad="PA00" ioset="1"/>
              <signal group="CS" function="27" pad="PA02" ioset="1"/>
              <signal group="CS" function="27" pad="PA03" ioset="1"/>
              <signal group="CS" function="27" pad="PA06" ioset="1"/>
              <signal group="CS" function="27" pad="PA07" ioset="1"/>
              <signal group="CS" function="27" pad="PA09" ioset="1"/>
              <signal group="CS" function="27" pad="PA10" ioset="1"/>
              <signal group="CS" function="27" pad="PA11" ioset="1"/>
              <signal group="CS" function="27" pad="PA14" ioset="1"/>
              <signal group="CS" function="27" pad="PB00" ioset="1"/>
              <signal group="CS" function="27" pad="PB01" ioset="1"/>
              <signal group="CS" function="27" pad="PB03" ioset="1"/>
              <signal group="CS" function="27" pad="PB04" ioset="1"/>
              <signal group="CS" function="27" pad="PB06" ioset="1"/>
              <signal group="CS" function="27" pad="PB07" ioset="1"/>
              <signal group="CS" function="27" pad="PB08" ioset="1"/>
              <signal group="CS" function="27" pad="PB11" ioset="1"/>
              <signal group="CS" function="27" pad="PB12" ioset="1"/>
              <signal group="CS" function="27" pad="PC00" ioset="1"/>
              <signal group="CS" function="27" pad="PC09" ioset="1"/>
              <signal group="CS" function="27" pad="PD03" ioset="1"/>
              <signal group="CS" function="27" pad="PD06" ioset="1"/>
              <signal group="CS" function="27" pad="PE00" ioset="1"/>
              <signal group="CS" function="27" pad="PE04" ioset="1"/>
              <signal group="CS" function="27" pad="PE06" ioset="1"/>
              <signal group="CS" function="34" pad="PA00" ioset="2"/>
              <signal group="CS" function="34" pad="PA01" ioset="2"/>
              <signal group="CS" function="34" pad="PA03" ioset="2"/>
              <signal group="CS" function="34" pad="PA04" ioset="2"/>
              <signal group="CS" function="34" pad="PA07" ioset="2"/>
              <signal group="CS" function="34" pad="PA08" ioset="2"/>
              <signal group="CS" function="34" pad="PA11" ioset="2"/>
              <signal group="CS" function="34" pad="PA12" ioset="2"/>
              <signal group="CS" function="34" pad="PB00" ioset="2"/>
              <signal group="CS" function="34" pad="PB01" ioset="2"/>
              <signal group="CS" function="34" pad="PB02" ioset="2"/>
              <signal group="CS" function="34" pad="PB04" ioset="2"/>
              <signal group="CS" function="34" pad="PB05" ioset="2"/>
              <signal group="CS" function="34" pad="PB07" ioset="2"/>
              <signal group="CS" function="34" pad="PB08" ioset="2"/>
              <signal group="CS" function="34" pad="PB09" ioset="2"/>
              <signal group="CS" function="34" pad="PB12" ioset="2"/>
              <signal group="CS" function="34" pad="PB13" ioset="2"/>
              <signal group="CS" function="34" pad="PC00" ioset="2"/>
              <signal group="CS" function="34" pad="PC01" ioset="2"/>
              <signal group="CS" function="34" pad="PC07" ioset="2"/>
              <signal group="CS" function="34" pad="PD04" ioset="2"/>
              <signal group="CS" function="34" pad="PD07" ioset="2"/>
              <signal group="CS" function="34" pad="PE01" ioset="2"/>
              <signal group="CS" function="34" pad="PE06" ioset="2"/>
              <signal group="CS" function="34" pad="PA00" ioset="3"/>
              <signal group="CS" function="34" pad="PA01" ioset="3"/>
              <signal group="CS" function="34" pad="PA02" ioset="3"/>
              <signal group="CS" function="34" pad="PA04" ioset="3"/>
              <signal group="CS" function="34" pad="PA05" ioset="3"/>
              <signal group="CS" function="34" pad="PA08" ioset="3"/>
              <signal group="CS" function="34" pad="PA09" ioset="3"/>
              <signal group="CS" function="34" pad="PA12" ioset="3"/>
              <signal group="CS" function="34" pad="PA13" ioset="3"/>
              <signal group="CS" function="34" pad="PB01" ioset="3"/>
              <signal group="CS" function="34" pad="PB02" ioset="3"/>
              <signal group="CS" function="34" pad="PB03" ioset="3"/>
              <signal group="CS" function="34" pad="PB05" ioset="3"/>
              <signal group="CS" function="34" pad="PB06" ioset="3"/>
              <signal group="CS" function="34" pad="PB08" ioset="3"/>
              <signal group="CS" function="34" pad="PB09" ioset="3"/>
              <signal group="CS" function="34" pad="PB10" ioset="3"/>
              <signal group="CS" function="34" pad="PB13" ioset="3"/>
              <signal group="CS" function="34" pad="PC01" ioset="3"/>
              <signal group="CS" function="34" pad="PC08" ioset="3"/>
              <signal group="CS" function="34" pad="PD02" ioset="3"/>
              <signal group="CS" function="34" pad="PD06" ioset="3"/>
              <signal group="CS" function="34" pad="PE00" ioset="3"/>
              <signal group="CS" function="34" pad="PE02" ioset="3"/>
              <signal group="CS" function="30" pad="PA00" ioset="4"/>
              <signal group="CS" function="30" pad="PA01" ioset="4"/>
              <signal group="CS" function="30" pad="PA02" ioset="4"/>
              <signal group="CS" function="30" pad="PA03" ioset="4"/>
              <signal group="CS" function="30" pad="PA05" ioset="4"/>
              <signal group="CS" function="30" pad="PA06" ioset="4"/>
              <signal group="CS" function="30" pad="PA08" ioset="4"/>
              <signal group="CS" function="30" pad="PA09" ioset="4"/>
              <signal group="CS" function="30" pad="PA10" ioset="4"/>
              <signal group="CS" function="30" pad="PA13" ioset="4"/>
              <signal group="CS" function="30" pad="PA14" ioset="4"/>
              <signal group="CS" function="30" pad="PB02" ioset="4"/>
              <signal group="CS" function="30" pad="PB03" ioset="4"/>
              <signal group="CS" function="30" pad="PB04" ioset="4"/>
              <signal group="CS" function="30" pad="PB06" ioset="4"/>
              <signal group="CS" function="30" pad="PB07" ioset="4"/>
              <signal group="CS" function="30" pad="PB10" ioset="4"/>
              <signal group="CS" function="30" pad="PB11" ioset="4"/>
              <signal group="CS" function="30" pad="PC07" ioset="4"/>
              <signal group="CS" function="30" pad="PC09" ioset="4"/>
              <signal group="CS" function="30" pad="PD03" ioset="4"/>
              <signal group="CS" function="30" pad="PD07" ioset="4"/>
              <signal group="CS" function="30" pad="PE01" ioset="4"/>
              <signal group="CS" function="30" pad="PE03" ioset="4"/>
              <signal group="CS" function="12" pad="PA01" ioset="5"/>
              <signal group="CS" function="12" pad="PA04" ioset="5"/>
              <signal group="CS" function="12" pad="PA10" ioset="5"/>
              <signal group="CS" function="12" pad="PA15" ioset="5"/>
              <signal group="CS" function="12" pad="PB00" ioset="5"/>
              <signal group="CS" function="12" pad="PB04" ioset="5"/>
              <signal group="CS" function="12" pad="PB10" ioset="5"/>
              <signal group="CS" function="12" pad="PB14" ioset="5"/>
              <signal group="CS" function="12" pad="PB15" ioset="5"/>
              <signal group="CS" function="12" pad="PC08" ioset="5"/>
              <signal group="CS" function="12" pad="PC10" ioset="5"/>
              <signal group="CS" function="12" pad="PC11" ioset="5"/>
              <signal group="CS" function="12" pad="PD00" ioset="5"/>
              <signal group="CS" function="12" pad="PD01" ioset="5"/>
              <signal group="CS" function="12" pad="PD02" ioset="5"/>
              <signal group="CS" function="12" pad="PD04" ioset="5"/>
              <signal group="CS" function="12" pad="PE02" ioset="5"/>
              <signal group="CS" function="12" pad="PE04" ioset="5"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PA00" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PA01" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PA03" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PA04" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PA07" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PA08" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PA11" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PA12" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB00" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB01" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB02" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB04" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB05" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB07" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB08" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB09" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB12" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PB13" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PC00" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PC01" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PC07" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PD04" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PD07" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PE01" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="35" pad="PE06" ioset="2"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PA00" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PA01" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PA02" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PA04" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PA05" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PA08" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PA09" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PA12" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PA13" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PB01" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PB02" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PB03" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PB05" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PB06" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PB08" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PB09" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PB10" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PB13" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PC01" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PC08" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PD02" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PD06" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PE00" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="36" pad="PE02" ioset="3"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA00" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA01" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA02" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA03" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA05" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA06" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA08" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA09" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA10" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA13" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PA14" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PB02" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PB03" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PB04" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PB06" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PB07" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PB10" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PB11" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PC07" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PC09" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PD03" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PD07" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PE01" ioset="4"/>
              <signal group="DATA_OUT" index="0" function="33" pad="PE03" ioset="4"/>
              <signal group="DATA_IN" index="0" function="1" pad="PA03" ioset="4"/>
              <signal group="DATA_IN" index="0" function="2" pad="PA09" ioset="4"/>
              <signal group="DATA_IN" index="0" function="3" pad="PA14" ioset="4"/>
              <signal group="DATA_IN" index="0" function="4" pad="PB03" ioset="4"/>
              <signal group="DATA_IN" index="0" function="5" pad="PC09" ioset="4"/>
              <signal group="DATA_IN" index="0" function="6" pad="PD03" ioset="4"/>
              <signal group="DATA_IN" index="0" function="7" pad="PE03" ioset="4"/>
              <signal group="DATA_IN" index="0" function="8" pad="PA00" ioset="4"/>
              <signal group="DATA_IN" index="0" function="9" pad="PB04" ioset="4"/>
              <signal group="DATA_IN" index="0" function="10" pad="PC07" ioset="4"/>
              <signal group="DATA_IN" index="0" function="11" pad="PD07" ioset="4"/>
              <signal group="DATA_IN" index="0" function="12" pad="PE01" ioset="4"/>
              <signal group="DATA_IN" index="0" function="13" pad="PA06" ioset="4"/>
              <signal group="DATA_IN" index="0" function="14" pad="PA10" ioset="4"/>
              <signal group="DATA_IN" index="0" function="15" pad="PB07" ioset="4"/>
              <signal group="DATA_IN" index="0" function="16" pad="PB11" ioset="4"/>
              <signal group="DATA_IN" index="0" function="17" pad="PA01" ioset="4"/>
              <signal group="DATA_IN" index="0" function="18" pad="PA05" ioset="4"/>
              <signal group="DATA_IN" index="0" function="19" pad="PA13" ioset="4"/>
              <signal group="DATA_IN" index="0" function="20" pad="PB02" ioset="4"/>
              <signal group="DATA_IN" index="0" function="21" pad="PB06" ioset="4"/>
              <signal group="DATA_IN" index="0" function="22" pad="PB10" ioset="4"/>
              <signal group="DATA_IN" index="0" function="23" pad="PA08" ioset="4"/>
              <signal group="DATA_IN" index="0" function="24" pad="PA02" ioset="4"/>
              <signal group="DATA_IN" index="1" function="1" pad="PA00" ioset="1"/>
              <signal group="DATA_IN" index="1" function="2" pad="PA06" ioset="1"/>
              <signal group="DATA_IN" index="1" function="3" pad="PA11" ioset="1"/>
              <signal group="DATA_IN" index="1" function="4" pad="PB00" ioset="1"/>
              <signal group="DATA_IN" index="1" function="5" pad="PB06" ioset="1"/>
              <signal group="DATA_IN" index="1" function="6" pad="PB11" ioset="1"/>
              <signal group="DATA_IN" index="1" function="7" pad="PC00" ioset="1"/>
              <signal group="DATA_IN" index="1" function="8" pad="PD06" ioset="1"/>
              <signal group="DATA_IN" index="1" function="9" pad="PE00" ioset="1"/>
              <signal group="DATA_IN" index="1" function="10" pad="PE06" ioset="1"/>
              <signal group="DATA_IN" index="1" function="11" pad="PB01" ioset="1"/>
              <signal group="DATA_IN" index="1" function="12" pad="PC09" ioset="1"/>
              <signal group="DATA_IN" index="1" function="13" pad="PD03" ioset="1"/>
              <signal group="DATA_IN" index="1" function="14" pad="PE04" ioset="1"/>
              <signal group="DATA_IN" index="1" function="15" pad="PA03" ioset="1"/>
              <signal group="DATA_IN" index="1" function="16" pad="PA07" ioset="1"/>
              <signal group="DATA_IN" index="1" function="17" pad="PB04" ioset="1"/>
              <signal group="DATA_IN" index="1" function="18" pad="PB08" ioset="1"/>
              <signal group="DATA_IN" index="1" function="19" pad="PB12" ioset="1"/>
              <signal group="DATA_IN" index="1" function="20" pad="PA02" ioset="1"/>
              <signal group="DATA_IN" index="1" function="21" pad="PA10" ioset="1"/>
              <signal group="DATA_IN" index="1" function="22" pad="PA14" ioset="1"/>
              <signal group="DATA_IN" index="1" function="23" pad="PB03" ioset="1"/>
              <signal group="DATA_IN" index="1" function="24" pad="PB07" ioset="1"/>
              <signal group="DATA_IN" index="1" function="25" pad="PA09" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PA00" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PA02" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PA03" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PA06" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PA07" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PA09" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PA10" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PA11" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PA14" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PB00" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PB01" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PB03" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PB04" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PB06" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PB07" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PB08" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PB11" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PB12" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PC00" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PC09" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PD03" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PD06" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PE00" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PE04" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="30" pad="PE06" ioset="1"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PA00" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PA01" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PA02" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PA04" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PA05" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PA08" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PA09" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PA12" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PA13" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PB01" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PB02" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PB03" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PB05" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PB06" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PB08" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PB09" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PB10" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PB13" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PC01" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PC08" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PD02" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PD06" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PE00" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="35" pad="PE02" ioset="3"/>
              <signal group="DATA_OUT" index="1" function="32" pad="PA00" ioset="4"/>
              <signal group="DATA_OUT" index="1" function="32" pad="PA01" ioset="4"/>
              <signal group="DATA_OUT" index="1" function="32" pad="PA02" ioset="4"/>
              <signal group="DATA_OUT" index="1" function="32" pad="PA03" ioset="4"/>
              <signal group="DATA_OUT" index="1" function="32" pad="PA05" ioset="4"/>
              <signal group="DATA_OUT" index="1" function="32" pad="PA06" ioset="4"/>
