zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
              <signal group="PAD_OUT" index="0" function="5" pad="PB04" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PB06" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PB07" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PB10" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PB11" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PC07" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PC09" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PD03" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PD07" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PE01" ioset="4"/>
              <signal group="PAD_OUT" index="0" function="5" pad="PE03" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PA01" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PA04" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PA10" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PA15" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PB00" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PB04" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PB10" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PB14" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PB15" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PC08" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PC10" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PC11" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PD00" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PD01" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PD02" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PD04" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PE02" ioset="5"/>
              <signal group="PAD_OUT" index="3" function="2" pad="PE04" ioset="5"/>
              <signal group="PAD_IN" index="1" function="0" pad="PA05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="1" pad="PB05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="2" pad="PB09" ioset="6"/>
              <signal group="PAD_IN" index="1" function="3" pad="PD05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="4" pad="PE05" ioset="6"/>
              <signal group="PAD_IN" index="1" function="5" pad="PA03" ioset="6"/>
              <signal group="PAD_IN" index="1" function="6" pad="PA06" ioset="6"/>
              <signal group="PAD_IN" index="1" function="7" pad="PA07" ioset="6"/>
              <signal group="PAD_IN" index="1" function="8" pad="PB06" ioset="6"/>
              <signal group="PAD_IN" index="1" function="9" pad="PB08" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PA03" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PA05" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PA06" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PA07" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PB05" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PB06" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PB08" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PB09" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PD05" ioset="6"/>
              <signal group="PAD_OUT" index="1" function="2" pad="PE05" ioset="6"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_SLOW" value="4"/>
              <param name="GCLK_ID_CORE" value="4"/>
              <param name="DMAC_ID_RX" value="6"/>
              <param name="DMAC_ID_TX" value="7"/>
              <param name="CHIP_SERCOM_PADDR_MSB" value="9"/>
              <param name="CHIP_SERCOM_CLK_REDUCTION" value="1"/>
              <param name="CHIP_SERCOM_DMA" value="1"/>
              <param name="CHIP_SERCOM_FIFO_DEPTH_POWER" value="1"/>
              <param name="CHIP_SERCOM_RETENTION_SUPPORT" value="0"/>
              <param name="CHIP_SERCOM_SPI" value="1"/>
              <param name="CHIP_SERCOM_SPI_HW_SS_CTRL" value="1"/>
              <param name="CHIP_SERCOM_SPI_ICSPACE_EXT" value="1"/>
              <param name="CHIP_SERCOM_SPI_OZMO" value="0"/>
              <param name="CHIP_SERCOM_SPI_WAKE_ON_SSL" value="1"/>
              <param name="CHIP_SERCOM_TTBIT_EXTENSION" value="1"/>
              <param name="CHIP_SERCOM_TWIM" value="1"/>
              <param name="CHIP_SERCOM_TWIS" value="1"/>
              <param name="CHIP_SERCOM_TWIS_AUTO_ACK" value="1"/>
              <param name="CHIP_SERCOM_TWIS_GROUP_CMD" value="1"/>
              <param name="CHIP_SERCOM_TWIS_SDASETUP_CNT_SIZE" value="8"/>
              <param name="CHIP_SERCOM_TWIS_SDASETUP_SIZE" value="4"/>
              <param name="CHIP_SERCOM_TWIS_SUDAT" value="1"/>
              <param name="CHIP_SERCOM_TWI_FASTMP" value="1"/>
              <param name="CHIP_SERCOM_TWI_HSMODE" value="1"/>
              <param name="CHIP_SERCOM_TWI_SCLSM_MODE" value="1"/>
              <param name="CHIP_SERCOM_TWI_SMB_TIMEOUTS" value="1"/>
              <param name="CHIP_SERCOM_TWI_TENBIT_ADR" value="1"/>
              <param name="CHIP_SERCOM_USART" value="1"/>
              <param name="CHIP_SERCOM_USART_AUTOBAUD" value="1"/>
              <param name="CHIP_SERCOM_USART_COLDET" value="1"/>
              <param name="CHIP_SERCOM_USART_FLOW_CTRL" value="1"/>
              <param name="CHIP_SERCOM_USART_FRAC_BAUD" value="1"/>
              <param name="CHIP_SERCOM_USART_IRDA" value="1"/>
              <param name="CHIP_SERCOM_USART_ISO7816" value="1"/>
              <param name="CHIP_SERCOM_USART_LIN_MASTER" value="1"/>
              <param name="CHIP_SERCOM_USART_RS485" value="1"/>
              <param name="CHIP_SERCOM_USART_SAMPA_EXT" value="1"/>
              <param name="CHIP_SERCOM_USART_SAMPR_EXT" value="1"/>
              <param name="CHIP_SERCOM_DLY_COMPENSATION" value="1"/>
              <param name="CHIP_SERCOM_SE_CNT" value="1"/>
              <param name="INSTANCE_ID" value="4" caption="Instance index for SERCOM1"/>
              <param name="PAC_ID" value="4" caption="Index for SERCOM1 registers write protection"/>
            </parameters>
          </instance>
