zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
              <signal group="PAD_OUT" index="2" function="10" pad="PC07" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PD07" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PE01" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PA06" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PA10" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PB07" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PB11" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PA01" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PA05" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PA13" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PB02" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PB06" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PB10" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PA08" ioset="4"/>
              <signal group="PAD_OUT" index="2" function="10" pad="PA02" ioset="4"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PA00" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PA06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PA11" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PB00" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PB06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PB11" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PC00" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PD06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PE00" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PE06" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PB01" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PC09" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PD03" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PE04" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PA03" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PA07" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PB04" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PB08" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PB12" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PA02" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PA10" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PA14" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PB03" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PB07" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="9" pad="PA09" ioset="1"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA12" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PC01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PC07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PD07" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PE01" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA03" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB02" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PC00" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PD04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PE06" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA08" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB12" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB05" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB09" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB13" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB00" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB04" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB08" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA00" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA11" ioset="2"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA13" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB13" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PC08" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PD02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PE02" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA04" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB03" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PC01" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PD06" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PE00" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA05" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA09" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB06" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB10" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA00" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB01" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB05" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PB09" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA01" ioset="3"/>
              <signal group="PAD_OUT" index="3" function="13" pad="PA12" ioset="3"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_SLOW" value="5"/>
              <param name="GCLK_ID_CORE" value="5"/>
              <param name="DMAC_ID_RX" value="12"/>
              <param name="DMAC_ID_TX" value="13"/>
              <param name="CHIP_SERCOM_PADDR_MSB" value="9"/>
              <param name="CHIP_SERCOM_CLK_REDUCTION" value="1"/>
              <param name="CHIP_SERCOM_DMA" value="1"/>
              <param name="CHIP_SERCOM_FIFO_DEPTH_POWER" value="1"/>
              <param name="CHIP_SERCOM_RETENTION_SUPPORT" value="0"/>
              <param name="CHIP_SERCOM_SPI" value="1"/>
              <param name="CHIP_SERCOM_SPI_HW_SS_CTRL" value="1"/>
              <param name="CHIP_SERCOM_SPI_ICSPACE_EXT" value="1"/>
              <param name="CHIP_SERCOM_SPI_OZMO" value="0"/>
              <param name="CHIP_SERCOM_SPI_WAKE_ON_SSL" value="1"/>
              <param name="CHIP_SERCOM_TTBIT_EXTENSION" value="1"/>
              <param name="CHIP_SERCOM_TWIM" value="0"/>
              <param name="CHIP_SERCOM_TWIS" value="0"/>
              <param name="CHIP_SERCOM_USART" value="1"/>
              <param name="CHIP_SERCOM_USART_AUTOBAUD" value="1"/>
              <param name="CHIP_SERCOM_USART_COLDET" value="1"/>
              <param name="CHIP_SERCOM_USART_FLOW_CTRL" value="1"/>
              <param name="CHIP_SERCOM_USART_FRAC_BAUD" value="1"/>
              <param name="CHIP_SERCOM_USART_IRDA" value="1"/>
              <param name="CHIP_SERCOM_USART_ISO7816" value="1"/>
              <param name="CHIP_SERCOM_USART_LIN_MASTER" value="1"/>
              <param name="CHIP_SERCOM_USART_RS485" value="1"/>
              <param name="CHIP_SERCOM_USART_SAMPA_EXT" value="1"/>
              <param name="CHIP_SERCOM_USART_SAMPR_EXT" value="1"/>
              <param name="CHIP_SERCOM_DLY_COMPENSATION" value="1"/>
              <param name="CHIP_SERCOM_SE_CNT" value="1"/>
              <param name="INSTANCE_ID" value="98" caption="Instance index for SERCOM4"/>
              <param name="PAC_ID" value="98" caption="Index for SERCOM4 registers write protection"/>
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x46000C00"/>
