zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
          </instance>
        </module>
        <module name="SysTick" id="SYSTEM_IP" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" id="SYSTEM_IP" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="TC" id="04705" name2="tmr_tc_u2249_v5" version="A">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="WO_OUT" index="0" function="18" pad="PA00" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PA01" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PA02" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PA04" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PA05" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PA08" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PA09" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PA12" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PA13" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PB01" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PB02" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PB03" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PB05" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PB06" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PB08" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PB09" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PB10" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PB13" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PC01" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PC08" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PD02" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PD06" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PE00" ioset="3"/>
              <signal group="WO_OUT" index="0" function="18" pad="PE02" ioset="3"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA00" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA01" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA02" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA03" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA05" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA06" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA08" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA09" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA10" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA13" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PA14" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PB02" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PB03" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PB04" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PB06" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PB07" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PB10" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PB11" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PC07" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PC09" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PD03" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PD07" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PE01" ioset="4"/>
              <signal group="WO_OUT" index="0" function="21" pad="PE03" ioset="4"/>
              <signal group="WO_OUT" index="1" function="18" pad="PA00" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PA02" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PA03" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PA06" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PA07" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PA09" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PA10" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PA11" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PA14" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PB00" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PB01" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PB03" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PB04" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PB06" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PB07" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PB08" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PB11" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PB12" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PC00" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PC09" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PD03" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PD06" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PE00" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PE04" ioset="1"/>
              <signal group="WO_OUT" index="1" function="18" pad="PE06" ioset="1"/>
              <signal group="WO_OUT" index="1" function="24" pad="PA00" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PA01" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PA03" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PA04" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PA07" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PA08" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PA11" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PA12" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB00" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB01" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB02" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB04" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB05" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB07" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB08" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB09" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB12" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PB13" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PC00" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PC01" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PC07" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PD04" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PD07" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PE01" ioset="2"/>
              <signal group="WO_OUT" index="1" function="24" pad="PE06" ioset="2"/>
              <signal group="WO_IN" index="0" function="1" pad="PA00" ioset="1"/>
              <signal group="WO_IN" index="0" function="2" pad="PA06" ioset="1"/>
              <signal group="WO_IN" index="0" function="3" pad="PA11" ioset="1"/>
              <signal group="WO_IN" index="0" function="4" pad="PB00" ioset="1"/>
              <signal group="WO_IN" index="0" function="5" pad="PB06" ioset="1"/>
              <signal group="WO_IN" index="0" function="6" pad="PB11" ioset="1"/>
              <signal group="WO_IN" index="0" function="7" pad="PC00" ioset="1"/>
              <signal group="WO_IN" index="0" function="8" pad="PD06" ioset="1"/>
              <signal group="WO_IN" index="0" function="9" pad="PE00" ioset="1"/>
              <signal group="WO_IN" index="0" function="10" pad="PE06" ioset="1"/>
              <signal group="WO_IN" index="0" function="11" pad="PB01" ioset="1"/>
              <signal group="WO_IN" index="0" function="12" pad="PC09" ioset="1"/>
              <signal group="WO_IN" index="0" function="13" pad="PD03" ioset="1"/>
              <signal group="WO_IN" index="0" function="14" pad="PE04" ioset="1"/>
              <signal group="WO_IN" index="0" function="15" pad="PA03" ioset="1"/>
              <signal group="WO_IN" index="0" function="16" pad="PA07" ioset="1"/>
              <signal group="WO_IN" index="0" function="17" pad="PB04" ioset="1"/>
              <signal group="WO_IN" index="0" function="18" pad="PB08" ioset="1"/>
              <signal group="WO_IN" index="0" function="19" pad="PB12" ioset="1"/>
              <signal group="WO_IN" index="0" function="20" pad="PA02" ioset="1"/>
              <signal group="WO_IN" index="0" function="21" pad="PA10" ioset="1"/>
              <signal group="WO_IN" index="0" function="22" pad="PA14" ioset="1"/>
              <signal group="WO_IN" index="0" function="23" pad="PB03" ioset="1"/>
              <signal group="WO_IN" index="0" function="24" pad="PB07" ioset="1"/>
              <signal group="WO_IN" index="0" function="25" pad="PA09" ioset="1"/>
              <signal group="WO_IN" index="0" function="1" pad="PA01" ioset="2"/>
              <signal group="WO_IN" index="0" function="2" pad="PA07" ioset="2"/>
              <signal group="WO_IN" index="0" function="3" pad="PA12" ioset="2"/>
              <signal group="WO_IN" index="0" function="4" pad="PB01" ioset="2"/>
              <signal group="WO_IN" index="0" function="5" pad="PB07" ioset="2"/>
              <signal group="WO_IN" index="0" function="6" pad="PC01" ioset="2"/>
              <signal group="WO_IN" index="0" function="7" pad="PC07" ioset="2"/>
              <signal group="WO_IN" index="0" function="8" pad="PD07" ioset="2"/>
              <signal group="WO_IN" index="0" function="9" pad="PE01" ioset="2"/>
              <signal group="WO_IN" index="0" function="10" pad="PA03" ioset="2"/>
              <signal group="WO_IN" index="0" function="11" pad="PB02" ioset="2"/>
              <signal group="WO_IN" index="0" function="12" pad="PC00" ioset="2"/>
              <signal group="WO_IN" index="0" function="13" pad="PD04" ioset="2"/>
              <signal group="WO_IN" index="0" function="14" pad="PE06" ioset="2"/>
              <signal group="WO_IN" index="0" function="15" pad="PA04" ioset="2"/>
              <signal group="WO_IN" index="0" function="16" pad="PA08" ioset="2"/>
              <signal group="WO_IN" index="0" function="17" pad="PB12" ioset="2"/>
              <signal group="WO_IN" index="0" function="18" pad="PB05" ioset="2"/>
              <signal group="WO_IN" index="0" function="19" pad="PB09" ioset="2"/>
              <signal group="WO_IN" index="0" function="20" pad="PB13" ioset="2"/>
              <signal group="WO_IN" index="0" function="21" pad="PB00" ioset="2"/>
              <signal group="WO_IN" index="0" function="22" pad="PB04" ioset="2"/>
              <signal group="WO_IN" index="0" function="23" pad="PB08" ioset="2"/>
              <signal group="WO_IN" index="0" function="24" pad="PA00" ioset="2"/>
              <signal group="WO_IN" index="0" function="25" pad="PA11" ioset="2"/>
              <signal group="WO_IN" index="1" function="1" pad="PA02" ioset="3"/>
              <signal group="WO_IN" index="1" function="2" pad="PA08" ioset="3"/>
              <signal group="WO_IN" index="1" function="3" pad="PA13" ioset="3"/>
              <signal group="WO_IN" index="1" function="4" pad="PB02" ioset="3"/>
              <signal group="WO_IN" index="1" function="5" pad="PB08" ioset="3"/>
              <signal group="WO_IN" index="1" function="6" pad="PB13" ioset="3"/>
              <signal group="WO_IN" index="1" function="7" pad="PC08" ioset="3"/>
              <signal group="WO_IN" index="1" function="8" pad="PD02" ioset="3"/>
              <signal group="WO_IN" index="1" function="9" pad="PE02" ioset="3"/>
              <signal group="WO_IN" index="1" function="10" pad="PA04" ioset="3"/>
              <signal group="WO_IN" index="1" function="11" pad="PB03" ioset="3"/>
              <signal group="WO_IN" index="1" function="12" pad="PC01" ioset="3"/>
              <signal group="WO_IN" index="1" function="13" pad="PD06" ioset="3"/>
              <signal group="WO_IN" index="1" function="14" pad="PE00" ioset="3"/>
              <signal group="WO_IN" index="1" function="15" pad="PA05" ioset="3"/>
              <signal group="WO_IN" index="1" function="16" pad="PA09" ioset="3"/>
              <signal group="WO_IN" index="1" function="17" pad="PB06" ioset="3"/>
              <signal group="WO_IN" index="1" function="18" pad="PB10" ioset="3"/>
              <signal group="WO_IN" index="1" function="19" pad="PA00" ioset="3"/>
              <signal group="WO_IN" index="1" function="20" pad="PB01" ioset="3"/>
              <signal group="WO_IN" index="1" function="21" pad="PB05" ioset="3"/>
              <signal group="WO_IN" index="1" function="22" pad="PB09" ioset="3"/>
              <signal group="WO_IN" index="1" function="23" pad="PA01" ioset="3"/>
              <signal group="WO_IN" index="1" function="24" pad="PA12" ioset="3"/>
              <signal group="WO_IN" index="1" function="1" pad="PA03" ioset="4"/>
              <signal group="WO_IN" index="1" function="2" pad="PA09" ioset="4"/>
              <signal group="WO_IN" index="1" function="3" pad="PA14" ioset="4"/>
              <signal group="WO_IN" index="1" function="4" pad="PB03" ioset="4"/>
              <signal group="WO_IN" index="1" function="5" pad="PC09" ioset="4"/>
              <signal group="WO_IN" index="1" function="6" pad="PD03" ioset="4"/>
              <signal group="WO_IN" index="1" function="7" pad="PE03" ioset="4"/>
              <signal group="WO_IN" index="1" function="8" pad="PA00" ioset="4"/>
              <signal group="WO_IN" index="1" function="9" pad="PB04" ioset="4"/>
              <signal group="WO_IN" index="1" function="10" pad="PC07" ioset="4"/>
              <signal group="WO_IN" index="1" function="11" pad="PD07" ioset="4"/>
              <signal group="WO_IN" index="1" function="12" pad="PE01" ioset="4"/>
              <signal group="WO_IN" index="1" function="13" pad="PA06" ioset="4"/>
              <signal group="WO_IN" index="1" function="14" pad="PA10" ioset="4"/>
              <signal group="WO_IN" index="1" function="15" pad="PB07" ioset="4"/>
              <signal group="WO_IN" index="1" function="16" pad="PB11" ioset="4"/>
              <signal group="WO_IN" index="1" function="17" pad="PA01" ioset="4"/>
              <signal group="WO_IN" index="1" function="18" pad="PA05" ioset="4"/>
              <signal group="WO_IN" index="1" function="19" pad="PA13" ioset="4"/>
              <signal group="WO_IN" index="1" function="20" pad="PB02" ioset="4"/>
              <signal group="WO_IN" index="1" function="21" pad="PB06" ioset="4"/>
              <signal group="WO_IN" index="1" function="22" pad="PB10" ioset="4"/>
              <signal group="WO_IN" index="1" function="23" pad="PA08" ioset="4"/>
              <signal group="WO_IN" index="1" function="24" pad="PA02" ioset="4"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="6"/>
              <param name="DMAC_ID_OVF" value="35"/>
              <param name="DMAC_ID_MC0" value="36"/>
              <param name="DMAC_ID_MC1" value="37"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for TC0"/>
              <param name="PAC_ID" value="5" caption="Index for TC0 registers write protection"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x40001800"/>
