zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
          <instance name="TC8">
            <register-group name="TC8" name-in-module="TC" address-space="base" offset="0x46001000"/>
            <signals>
              <signal group="WO_OUT" index="0" function="26" pad="PA00" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PA02" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PA03" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PA06" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PA07" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PA09" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PA10" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PA11" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PA14" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PB00" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PB01" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PB03" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PB04" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PB06" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PB07" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PB08" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PB11" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PB12" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PC00" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PC09" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PD03" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PD06" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PE00" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PE04" ioset="1"/>
              <signal group="WO_OUT" index="0" function="26" pad="PE06" ioset="1"/>
              <signal group="WO_OUT" index="0" function="32" pad="PA00" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PA01" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PA02" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PA04" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PA05" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PA08" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PA09" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PA12" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PA13" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PB01" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PB02" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PB03" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PB05" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PB06" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PB08" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PB09" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PB10" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PB13" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PC01" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PC08" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PD02" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PD06" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PE00" ioset="3"/>
              <signal group="WO_OUT" index="0" function="32" pad="PE02" ioset="3"/>
              <signal group="WO_OUT" index="1" function="32" pad="PA00" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PA01" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PA03" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PA04" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PA07" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PA08" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PA11" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PA12" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB00" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB01" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB02" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB04" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB05" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB07" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB08" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB09" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB12" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PB13" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PC00" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PC01" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PC07" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PD04" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PD07" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PE01" ioset="2"/>
              <signal group="WO_OUT" index="1" function="32" pad="PE06" ioset="2"/>
              <signal group="WO_OUT" index="1" function="10" pad="PA01" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PA04" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PA10" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PA15" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PB00" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PB04" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PB10" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PB14" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PB15" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PC08" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PC10" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PC11" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PD00" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PD01" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PD02" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PD04" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PE02" ioset="5"/>
              <signal group="WO_OUT" index="1" function="10" pad="PE04" ioset="5"/>
              <signal group="WO_IN" index="0" function="1" pad="PA00" ioset="1"/>
              <signal group="WO_IN" index="0" function="2" pad="PA06" ioset="1"/>
              <signal group="WO_IN" index="0" function="3" pad="PA11" ioset="1"/>
              <signal group="WO_IN" index="0" function="4" pad="PB00" ioset="1"/>
              <signal group="WO_IN" index="0" function="5" pad="PB06" ioset="1"/>
              <signal group="WO_IN" index="0" function="6" pad="PB11" ioset="1"/>
              <signal group="WO_IN" index="0" function="7" pad="PC00" ioset="1"/>
              <signal group="WO_IN" index="0" function="8" pad="PD06" ioset="1"/>
              <signal group="WO_IN" index="0" function="9" pad="PE00" ioset="1"/>
              <signal group="WO_IN" index="0" function="10" pad="PE06" ioset="1"/>
              <signal group="WO_IN" index="0" function="11" pad="PB01" ioset="1"/>
              <signal group="WO_IN" index="0" function="12" pad="PC09" ioset="1"/>
              <signal group="WO_IN" index="0" function="13" pad="PD03" ioset="1"/>
              <signal group="WO_IN" index="0" function="14" pad="PE04" ioset="1"/>
              <signal group="WO_IN" index="0" function="15" pad="PA03" ioset="1"/>
              <signal group="WO_IN" index="0" function="16" pad="PA07" ioset="1"/>
              <signal group="WO_IN" index="0" function="17" pad="PB04" ioset="1"/>
              <signal group="WO_IN" index="0" function="18" pad="PB08" ioset="1"/>
              <signal group="WO_IN" index="0" function="19" pad="PB12" ioset="1"/>
              <signal group="WO_IN" index="0" function="20" pad="PA02" ioset="1"/>
              <signal group="WO_IN" index="0" function="21" pad="PA10" ioset="1"/>
              <signal group="WO_IN" index="0" function="22" pad="PA14" ioset="1"/>
              <signal group="WO_IN" index="0" function="23" pad="PB03" ioset="1"/>
              <signal group="WO_IN" index="0" function="24" pad="PB07" ioset="1"/>
              <signal group="WO_IN" index="0" function="25" pad="PA09" ioset="1"/>
              <signal group="WO_IN" index="0" function="1" pad="PA02" ioset="3"/>
              <signal group="WO_IN" index="0" function="2" pad="PA08" ioset="3"/>
              <signal group="WO_IN" index="0" function="3" pad="PA13" ioset="3"/>
              <signal group="WO_IN" index="0" function="4" pad="PB02" ioset="3"/>
              <signal group="WO_IN" index="0" function="5" pad="PB08" ioset="3"/>
              <signal group="WO_IN" index="0" function="6" pad="PB13" ioset="3"/>
              <signal group="WO_IN" index="0" function="7" pad="PC08" ioset="3"/>
              <signal group="WO_IN" index="0" function="8" pad="PD02" ioset="3"/>
              <signal group="WO_IN" index="0" function="9" pad="PE02" ioset="3"/>
              <signal group="WO_IN" index="0" function="10" pad="PA04" ioset="3"/>
              <signal group="WO_IN" index="0" function="11" pad="PB03" ioset="3"/>
              <signal group="WO_IN" index="0" function="12" pad="PC01" ioset="3"/>
              <signal group="WO_IN" index="0" function="13" pad="PD06" ioset="3"/>
              <signal group="WO_IN" index="0" function="14" pad="PE00" ioset="3"/>
              <signal group="WO_IN" index="0" function="15" pad="PA05" ioset="3"/>
              <signal group="WO_IN" index="0" function="16" pad="PA09" ioset="3"/>
              <signal group="WO_IN" index="0" function="17" pad="PB06" ioset="3"/>
              <signal group="WO_IN" index="0" function="18" pad="PB10" ioset="3"/>
              <signal group="WO_IN" index="0" function="19" pad="PA00" ioset="3"/>
              <signal group="WO_IN" index="0" function="20" pad="PB01" ioset="3"/>
              <signal group="WO_IN" index="0" function="21" pad="PB05" ioset="3"/>
              <signal group="WO_IN" index="0" function="22" pad="PB09" ioset="3"/>
              <signal group="WO_IN" index="0" function="23" pad="PA01" ioset="3"/>
              <signal group="WO_IN" index="0" function="24" pad="PA12" ioset="3"/>
              <signal group="WO_IN" index="1" function="1" pad="PA01" ioset="2"/>
              <signal group="WO_IN" index="1" function="2" pad="PA07" ioset="2"/>
              <signal group="WO_IN" index="1" function="3" pad="PA12" ioset="2"/>
              <signal group="WO_IN" index="1" function="4" pad="PB01" ioset="2"/>
              <signal group="WO_IN" index="1" function="5" pad="PB07" ioset="2"/>
              <signal group="WO_IN" index="1" function="6" pad="PC01" ioset="2"/>
              <signal group="WO_IN" index="1" function="7" pad="PC07" ioset="2"/>
              <signal group="WO_IN" index="1" function="8" pad="PD07" ioset="2"/>
              <signal group="WO_IN" index="1" function="9" pad="PE01" ioset="2"/>
              <signal group="WO_IN" index="1" function="10" pad="PA03" ioset="2"/>
              <signal group="WO_IN" index="1" function="11" pad="PB02" ioset="2"/>
              <signal group="WO_IN" index="1" function="12" pad="PC00" ioset="2"/>
              <signal group="WO_IN" index="1" function="13" pad="PD04" ioset="2"/>
              <signal group="WO_IN" index="1" function="14" pad="PE06" ioset="2"/>
              <signal group="WO_IN" index="1" function="15" pad="PA04" ioset="2"/>
              <signal group="WO_IN" index="1" function="16" pad="PA08" ioset="2"/>
              <signal group="WO_IN" index="1" function="17" pad="PB12" ioset="2"/>
              <signal group="WO_IN" index="1" function="18" pad="PB05" ioset="2"/>
              <signal group="WO_IN" index="1" function="19" pad="PB09" ioset="2"/>
              <signal group="WO_IN" index="1" function="20" pad="PB13" ioset="2"/>
              <signal group="WO_IN" index="1" function="21" pad="PB00" ioset="2"/>
              <signal group="WO_IN" index="1" function="22" pad="PB04" ioset="2"/>
              <signal group="WO_IN" index="1" function="23" pad="PB08" ioset="2"/>
              <signal group="WO_IN" index="1" function="24" pad="PA00" ioset="2"/>
              <signal group="WO_IN" index="1" function="25" pad="PA11" ioset="2"/>
              <signal group="WO_IN" index="1" function="1" pad="PA04" ioset="5"/>
              <signal group="WO_IN" index="1" function="2" pad="PA10" ioset="5"/>
              <signal group="WO_IN" index="1" function="3" pad="PB04" ioset="5"/>
              <signal group="WO_IN" index="1" function="4" pad="PB10" ioset="5"/>
              <signal group="WO_IN" index="1" function="5" pad="PD04" ioset="5"/>
              <signal group="WO_IN" index="1" function="6" pad="PE04" ioset="5"/>
              <signal group="WO_IN" index="1" function="7" pad="PA01" ioset="5"/>
              <signal group="WO_IN" index="1" function="8" pad="PB00" ioset="5"/>
              <signal group="WO_IN" index="1" function="9" pad="PC08" ioset="5"/>
              <signal group="WO_IN" index="1" function="10" pad="PD02" ioset="5"/>
              <signal group="WO_IN" index="1" function="11" pad="PE02" ioset="5"/>
              <signal group="WO_IN" index="1" function="12" pad="PC10" ioset="5"/>
              <signal group="WO_IN" index="1" function="13" pad="PC11" ioset="5"/>
              <signal group="WO_IN" index="1" function="14" pad="PA15" ioset="5"/>
              <signal group="WO_IN" index="1" function="15" pad="PB14" ioset="5"/>
              <signal group="WO_IN" index="1" function="16" pad="PB15" ioset="5"/>
              <signal group="WO_IN" index="1" function="17" pad="PD00" ioset="5"/>
              <signal group="WO_IN" index="1" function="18" pad="PD01" ioset="5"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="11"/>
              <param name="DMAC_ID_OVF" value="59"/>
              <param name="DMAC_ID_MC0" value="60"/>
              <param name="DMAC_ID_MC1" value="61"/>
              <param name="INSTANCE_ID" value="100" caption="Instance index for TC8"/>
              <param name="PAC_ID" value="100" caption="Index for TC8 registers write protection"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
            </parameters>
          </instance>
          <instance name="TC9">
            <register-group name="TC9" name-in-module="TC" address-space="base" offset="0x46001400"/>
