zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
            <parameters>
              <param name="GCLK_ID" value="24"/>
              <param name="DMAC_ID_OVF" value="18"/>
              <param name="DMAC_ID_MC0" value="19"/>
              <param name="DMAC_ID_MC1" value="20"/>
              <param name="DMAC_ID_MC2" value="21"/>
              <param name="DMAC_ID_MC3" value="22"/>
              <param name="DMAC_ID_MC4" value="23"/>
              <param name="DMAC_ID_MC5" value="24"/>
              <param name="SIZE" value="24"/>
              <param name="MASTER_SLAVE_MODE" value="1"/>
              <param name="CC_NUM" value="6"/>
              <param name="OW_NUM" value="6"/>
              <param name="DITHERING" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="DTI" value="2"/>
              <param name="SWAP" value="4"/>
              <param name="PG" value="8"/>
              <param name="INSTANCE_ID" value="13" caption="Instance index for TCC0"/>
              <param name="PAC_ID" value="13" caption="Index for TCC0 registers write protection"/>
            </parameters>
            <signals>
              <signal group="WO" index="0" function="13" pad="PA00" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PA02" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PA03" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PA06" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PA07" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PA09" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PA10" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PA11" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PA14" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PB00" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PB01" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PB03" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PB04" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PB06" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PB07" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PB08" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PB11" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PB12" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PC00" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PC09" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PD03" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PD06" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PE00" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PE04" ioset="1"/>
              <signal group="WO" index="0" function="13" pad="PE06" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PA00" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PA02" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PA03" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PA06" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PA07" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PA09" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PA10" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PA11" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PA14" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PB00" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PB01" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PB03" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PB04" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PB06" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PB07" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PB08" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PB11" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PB12" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PC00" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PC09" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PD03" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PD06" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PE00" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PE04" ioset="1"/>
              <signal group="WO" index="4" function="14" pad="PE06" ioset="1"/>
              <signal group="WO" index="1" function="17" pad="PA00" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PA01" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PA03" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PA04" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PA07" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PA08" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PA11" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PA12" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB00" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB01" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB02" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB04" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB05" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB07" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB08" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB09" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB12" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PB13" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PC00" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PC01" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PC07" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PD04" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PD07" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PE01" ioset="2"/>
              <signal group="WO" index="1" function="17" pad="PE06" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PA00" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PA01" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PA03" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PA04" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PA07" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PA08" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PA11" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PA12" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB00" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB01" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB02" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB04" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB05" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB07" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB08" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB09" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB12" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PB13" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PC00" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PC01" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PC07" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PD04" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PD07" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PE01" ioset="2"/>
              <signal group="WO" index="3" function="19" pad="PE06" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PA00" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PA01" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PA03" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PA04" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PA07" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PA08" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PA11" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PA12" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB00" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB01" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB02" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB04" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB05" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB07" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB08" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB09" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB12" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PB13" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PC00" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PC01" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PC07" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PD04" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PD07" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PE01" ioset="2"/>
              <signal group="WO" index="5" function="18" pad="PE06" ioset="2"/>
              <signal group="WO" index="0" function="18" pad="PA00" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PA01" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PA02" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PA04" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PA05" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PA08" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PA09" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PA12" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PA13" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PB01" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PB02" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PB03" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PB05" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PB06" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PB08" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PB09" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PB10" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PB13" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PC01" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PC08" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PD02" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PD06" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PE00" ioset="3"/>
              <signal group="WO" index="0" function="18" pad="PE02" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PA00" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PA01" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PA02" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PA04" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PA05" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PA08" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PA09" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PA12" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PA13" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PB01" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PB02" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PB03" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PB05" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PB06" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PB08" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PB09" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PB10" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PB13" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PC01" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PC08" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PD02" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PD06" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PE00" ioset="3"/>
              <signal group="WO" index="2" function="17" pad="PE02" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PA00" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PA01" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PA02" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PA04" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PA05" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PA08" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PA09" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PA12" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PA13" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PB01" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PB02" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PB03" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PB05" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PB06" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PB08" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PB09" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PB10" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PB13" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PC01" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PC08" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PD02" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PD06" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PE00" ioset="3"/>
              <signal group="WO" index="4" function="19" pad="PE02" ioset="3"/>
              <signal group="WO" index="1" function="15" pad="PA00" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA01" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA02" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA03" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA05" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA06" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA08" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA09" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA10" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA13" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PA14" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PB02" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PB03" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PB04" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PB06" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PB07" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PB10" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PB11" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PC07" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PC09" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PD03" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PD07" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PE01" ioset="4"/>
              <signal group="WO" index="1" function="15" pad="PE03" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA00" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA01" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA02" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA03" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA05" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA06" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA08" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA09" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA10" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA13" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PA14" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PB02" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PB03" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PB04" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PB06" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PB07" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PB10" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PB11" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PC07" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PC09" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PD03" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PD07" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PE01" ioset="4"/>
              <signal group="WO" index="3" function="14" pad="PE03" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA00" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA01" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA02" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA03" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA05" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA06" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA08" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA09" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA10" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA13" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PA14" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PB02" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PB03" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PB04" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PB06" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PB07" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PB10" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PB11" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PC07" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PC09" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PD03" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PD07" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PE01" ioset="4"/>
              <signal group="WO" index="5" function="16" pad="PE03" ioset="4"/>
              <signal group="WO" index="1" function="6" pad="PA01" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PA04" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PA10" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PA15" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PB00" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PB04" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PB10" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PB14" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PB15" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PC08" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PC10" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PC11" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PD00" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PD01" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PD02" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PD04" ioset="5"/>
              <signal group="WO" index="1" function="6" pad="PE02" ioset="5"/>
