zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
              <signal group="WO" index="5" function="19" pad="PA02" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA03" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA05" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA06" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA08" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA09" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA10" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA13" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PA14" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB02" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB03" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB04" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB06" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB07" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB10" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PB11" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PC07" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PC09" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PD03" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PD07" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PE01" ioset="4"/>
              <signal group="WO" index="5" function="19" pad="PE03" ioset="4"/>
              <signal group="WO" index="1" function="9" pad="PA01" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PA04" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PA10" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PA15" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PB00" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PB04" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PB10" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PB14" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PB15" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PC08" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PC10" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PC11" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PD00" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PD01" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PD02" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PD04" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PE02" ioset="5"/>
              <signal group="WO" index="1" function="9" pad="PE04" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PA01" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PA04" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PA10" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PA15" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PB00" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PB04" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PB10" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PB14" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PB15" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PC08" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PC10" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PC11" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PD00" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PD01" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PD02" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PD04" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PE02" ioset="5"/>
              <signal group="WO" index="2" function="8" pad="PE04" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PA01" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PA04" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PA10" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PA15" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PB00" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PB04" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PB10" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PB14" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PB15" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PC08" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PC10" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PC11" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PD00" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PD01" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PD02" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PD04" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PE02" ioset="5"/>
              <signal group="WO" index="4" function="7" pad="PE04" ioset="5"/>
            </signals>
          </instance>
