zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x40003C00"/>
            <parameters>
              <param name="GCLK_ID" value="25"/>
              <param name="DMAC_ID_OVF" value="32"/>
              <param name="DMAC_ID_MC0" value="33"/>
              <param name="DMAC_ID_MC1" value="34"/>
              <param name="SIZE" value="16"/>
              <param name="MASTER_SLAVE_MODE" value="0"/>
              <param name="CC_NUM" value="2"/>
              <param name="OW_NUM" value="2"/>
              <param name="DITHERING" value="1"/>
              <param name="OTMX" value="1"/>
              <param name="DTI" value="2"/>
              <param name="SWAP" value="4"/>
              <param name="PG" value="8"/>
              <param name="INSTANCE_ID" value="15" caption="Instance index for TCC2"/>
              <param name="PAC_ID" value="15" caption="Index for TCC2 registers write protection"/>
            </parameters>
            <signals>
              <signal group="WO" index="0" function="17" pad="PA00" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PA02" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PA03" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PA06" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PA07" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PA09" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PA10" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PA11" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PA14" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PB00" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PB01" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PB03" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PB04" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PB06" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PB07" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PB08" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PB11" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PB12" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PC00" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PC09" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PD03" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PD06" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PE00" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PE04" ioset="1"/>
              <signal group="WO" index="0" function="17" pad="PE06" ioset="1"/>
              <signal group="WO" index="1" function="23" pad="PA00" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PA01" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PA03" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PA04" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PA07" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PA08" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PA11" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PA12" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB00" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB01" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB02" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB04" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB05" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB07" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB08" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB09" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB12" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PB13" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PC00" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PC01" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PC07" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PD04" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PD07" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PE01" ioset="2"/>
              <signal group="WO" index="1" function="23" pad="PE06" ioset="2"/>
              <signal group="WO" index="0" function="23" pad="PA00" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PA01" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PA02" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PA04" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PA05" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PA08" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PA09" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PA12" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PA13" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PB01" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PB02" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PB03" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PB05" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PB06" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PB08" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PB09" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PB10" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PB13" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PC01" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PC08" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PD02" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PD06" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PE00" ioset="3"/>
              <signal group="WO" index="0" function="23" pad="PE02" ioset="3"/>
              <signal group="WO" index="1" function="20" pad="PA00" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA01" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA02" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA03" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA05" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA06" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA08" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA09" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA10" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA13" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PA14" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PB02" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PB03" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PB04" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PB06" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PB07" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PB10" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PB11" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PC07" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PC09" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PD03" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PD07" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PE01" ioset="4"/>
              <signal group="WO" index="1" function="20" pad="PE03" ioset="4"/>
            </signals>
          </instance>
        </module>
