zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="ADCDMASTAT" offset="0x310" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RAF0" caption="" mask="0x1"/>
          <bitfield name="RAF_IEN0" caption="" mask="0x100"/>
          <bitfield name="DMA_CNT_EN" caption="" mask="0x8000"/>
          <bitfield name="RBF0" caption="" mask="0x10000"/>
          <bitfield name="WR_OVF_ERR" caption="" mask="0x800000"/>
          <bitfield name="RBF_IEN0" caption="" mask="0x1000000"/>
          <bitfield name="DMAEN" caption="" mask="0x80000000"/>
        </register>
        <register name="ADCCNTB" offset="0x320" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCCNTB" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDMAB" offset="0x330" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADDMAB" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCTRGSNS" offset="0x340" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="LVL0" caption="" mask="0x1"/>
          <bitfield name="LVL1" caption="" mask="0x2"/>
          <bitfield name="LVL2" caption="" mask="0x4"/>
          <bitfield name="LVL3" caption="" mask="0x8"/>
          <bitfield name="LVL4" caption="" mask="0x10"/>
          <bitfield name="LVL5" caption="" mask="0x20"/>
          <bitfield name="LVL6" caption="" mask="0x40"/>
          <bitfield name="LVL7" caption="" mask="0x80"/>
        </register>
        <register name="ADC0TIME" offset="0x350" rw="RW" size="4" caption="Dedicated High-Speed ADC Timing Register ('x' = 0)">
          <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC"/>
          <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV"/>
          <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN"/>
          <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC0TIME__SELRES"/>
          <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS"/>
        </register>
        <register name="ADCANCON" offset="0x400" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ANEN0" caption="" mask="0x1"/>
          <bitfield name="ANEN7" caption="" mask="0x80"/>
          <bitfield name="WKRDY0" caption="" mask="0x100"/>
          <bitfield name="WKRDY7" caption="" mask="0x8000"/>
          <bitfield name="WKIEN0" caption="" mask="0x10000"/>
          <bitfield name="WKIEN7" caption="" mask="0x800000"/>
          <bitfield name="WKUPCLKCNT" caption="" mask="0xf000000"/>
        </register>
        <register name="ADC7CFG" offset="0x670" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADC7CFG" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCSYSCFG0" offset="0x700" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield mask="0x00000001" name="AN0"/>
          <bitfield mask="0x00000002" name="AN1"/>
          <bitfield mask="0x00000004" name="AN2"/>
          <bitfield mask="0x00000008" name="AN3"/>
          <bitfield mask="0x00000010" name="AN4"/>
          <bitfield mask="0x00000020" name="AN5"/>
          <bitfield mask="0x00000040" name="AN6"/>
          <bitfield mask="0x00000080" name="AN7"/>
          <bitfield mask="0x00000100" name="AN8"/>
          <bitfield mask="0x00000200" name="AN9"/>
          <bitfield mask="0x00000400" name="AN10"/>
          <bitfield mask="0x00000800" name="AN11"/>
          <bitfield mask="0x00001000" name="AN12"/>
          <bitfield mask="0x00002000" name="AN13"/>
          <bitfield mask="0x00004000" name="AN14"/>
          <bitfield mask="0x00008000" name="AN15"/>
          <bitfield mask="0x00010000" name="AN16"/>
          <bitfield mask="0x00020000" name="AN17"/>
          <bitfield mask="0x00040000" name="AN18"/>
          <bitfield mask="0x00080000" name="AN19"/>
          <bitfield mask="0x00100000" name="AN20"/>
          <bitfield mask="0x00200000" name="AN21"/>
          <bitfield mask="0x00400000" name="AN22"/>
        </register>
        <register name="ADCDATA0" offset="0xa00" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA1" offset="0xa10" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA2" offset="0xa20" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA3" offset="0xa30" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA4" offset="0xa40" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA5" offset="0xa50" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA6" offset="0xa60" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA7" offset="0xa70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA8" offset="0xa80" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
