zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="ADCDATA9" offset="0xa90" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA10" offset="0xaa0" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA11" offset="0xab0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA12" offset="0xac0" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA13" offset="0xad0" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA14" offset="0xae0" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA15" offset="0xaf0" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA16" offset="0xb00" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA17" offset="0xb10" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA18" offset="0xb20" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA19" offset="0xb30" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA20" offset="0xb40" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA21" offset="0xb50" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCDATA22" offset="0xb60" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="ADCCON1CLR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCON1SET" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCON1INV" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCON2CLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCON2SET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCON2INV" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCON3CLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCON3SET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCON3INV" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCIMOD1CLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCIMOD1SET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCIMOD1INV" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCGIRQEN1CLR" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCGIRQEN1SET" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCGIRQEN1INV" offset="0x8c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCSS1CLR" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCSS1SET" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCSS1INV" offset="0xac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCDSTAT1CLR" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCDSTAT1SET" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCDSTAT1INV" offset="0xcc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCMPEN0CLR" offset="0xe4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="ADCCMPEN0SET" offset="0xe8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="ADCCMPEN0INV" offset="0xec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="ADCCMP0CLR" offset="0xf4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
