zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS2">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN2" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN2" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS3">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN3" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN3" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS4">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN4" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN4" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS5">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN5" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN5" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS6">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN6" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN6" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS7">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN7" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN7" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS8">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN8" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN8" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS9">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN9" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN9" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS10">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN10" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN10" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS11">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN11" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN11" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS12">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN12" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN12" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS13">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN13" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN13" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS14">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN14" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN14" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS15">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN15" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN15" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS16">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN16" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN16" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS17">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN17" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN17" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS18">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN18" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN18" value="0x0"/>
      </value-group>
