zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
      <value-group caption="AN9 Mode bit" name="ADCIMCON1__DIFF9">
        <value caption="Selects AN9 differential input pair as AN9+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN9 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN10 Signed Data Mode bit" name="ADCIMCON1__SIGN10">
        <value caption="AN10 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN10 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN10 Mode bit" name="ADCIMCON1__DIFF10">
        <value caption="Selects AN10 differential input pair as AN10+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN10 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN11 Signed Data Mode bit" name="ADCIMCON1__SIGN11">
        <value caption="AN11 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN11 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN11 Mode bit" name="ADCIMCON1__DIFF11">
        <value caption="Selects AN11 differential input pair as AN11+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN11 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN12 Signed Data Mode bit" name="ADCIMCON1__SIGN12">
        <value caption="AN12 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN12 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN12 Mode bit" name="ADCIMCON1__DIFF12">
        <value caption="Selects AN12 differential input pair as AN12+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN12 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN13 Signed Data Mode bit" name="ADCIMCON1__SIGN13">
        <value caption="AN13 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN13 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN13 Mode bit" name="ADCIMCON1__DIFF13">
        <value caption="Selects AN13 differential input pair as AN13+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN13 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN14 Signed Data Mode bit" name="ADCIMCON1__SIGN14">
        <value caption="AN14 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN14 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN14 Mode bit" name="ADCIMCON1__DIFF14">
        <value caption="Selects AN14 differential input pair as AN14+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN14 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN15 Signed Data Mode bit" name="ADCIMCON1__SIGN15">
        <value caption="AN15 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN15 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN15 Mode bit" name="ADCIMCON1__DIFF15">
        <value caption="Selects AN15 differential input pair as AN15+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN15 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN16 Signed Data Mode bit" name="ADCIMCON2__SIGN16">
        <value caption="AN16 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN16 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN16 Mode bit" name="ADCIMCON2__DIFF16">
        <value caption="Selects AN16 differential input pair as AN16+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN16 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN17 Signed Data Mode bit" name="ADCIMCON2__SIGN17">
        <value caption="AN17 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN17 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN17 Mode bit" name="ADCIMCON2__DIFF17">
        <value caption="Selects AN17 differential input pair as AN17+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN17 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN18 Signed Data Mode bit" name="ADCIMCON2__SIGN18">
        <value caption="AN18 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN18 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN18 Mode bit" name="ADCIMCON2__DIFF18">
        <value caption="Selects AN18 differential input pair as AN18+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN18 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN19 Signed Data Mode bit" name="ADCIMCON2__SIGN19">
        <value caption="AN19 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN19 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN19 Mode bit" name="ADCIMCON2__DIFF19">
        <value caption="Selects AN19 differential input pair as AN19+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN19 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN20 Signed Data Mode bit" name="ADCIMCON2__SIGN20">
        <value caption="AN20 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN20 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN20 Mode bit" name="ADCIMCON2__DIFF20">
        <value caption="Selects AN20 differential input pair as AN20+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN20 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
