zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN15">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN16">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN17">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN18">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN19">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN20">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN21">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN22">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC0TIME__SELRES">
        <value caption="12 bits" name="12_BITS" value="0x3"/>
        <value caption="10 bits" name="10_BITS" value="0x2"/>
        <value caption="8 bits" name="8_BITS" value="0x1"/>
        <value caption="6 bits" name="6_BITS" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Analog Input Select bit" name="ADCTRGMODE__SH0ALT">
        <value caption="ANB0" name="ANB0" value="0x2"/>
        <value caption="ANA0" name="ANA0" value="0x1"/>
        <value caption="AN0" name="AN0" value="0x0"/>
      </value-group>
    </module>
    <module caption="BLE" version="1.0" id="04999" name="BLE">
      <register-group caption="BLE" name="BLE">
        <!-- Turned bit fields into registers for Chris here -->
        <register name="DPLL_RG1" offset="0x04B8" rw="RW" size="2" caption="">
          <bitfield name="DPLL_RG1BITS" mask="0xFFFF" caption=""/>
        </register>
        <register name="DPLL_RG2" offset="0x04BA" rw="RW" size="2" caption="">
          <bitfield name="DPLL_RG2BITS" mask="0xFFFF" caption=""/>
        </register>
        <register name="SPI_WR_DATA" offset="0x1000" rw="RW" size="2" caption=""/>
        <register name="SPI_REG_ADDR" offset="0x1002" rw="RW" size="2" caption=""/>
        <register name="RFPWRMGMT" offset="0x1004" rw="RW" size="4" caption="">
          <bitfield name="xOCLK_EN_CFG" mask="0x1" caption=""/>
          <bitfield name="BxTLEN" mask="0x2" caption=""/>
          <bitfield name="RESERVED_4" mask="0x4" caption=""/>
          <bitfield name="RESERVED_3" mask="0x8" caption=""/>
          <bitfield name="BDCLK_POLARITY" mask="0x10" caption=""/>
          <bitfield name="BENxOANA" mask="0x20" caption=""/>
          <bitfield name="KEEP_ACLB_SPI_ACCESS_ON" mask="0x40" caption=""/>
          <bitfield name="FW_CONTROLS_MAIN_CLK_GATING" mask="0x80" caption=""/>
          <bitfield name="MAIN_CLK_EN" mask="0x100" caption=""/>
          <bitfield name="RESERVED_2" mask="0x3E00" caption=""/>
          <bitfield name="NO_RF_IDLE" mask="0x4000" caption=""/>
          <bitfield name="RESERVED_1" mask="0x8000" caption=""/>
          <bitfield name="RESERVED_7" mask="0x30000" caption=""/>
          <bitfield name="REG_RF_READ" mask="0x40000" caption=""/>
          <bitfield name="RESERVED_6" mask="0x80000" caption=""/>
          <bitfield name="REG_RF_PROG" mask="0x100000" caption=""/>
          <bitfield name="RESERVED_5" mask="0xFFE00000" caption=""/>
        </register>
      </register-group>
    </module>
    <module name="CAN" id="03723" name2="can_fd_u2003_v4" version="4a0" caption="Control Area Network">
      <register-group name="CAN" caption="Control Area Network">
        <register name="CREL" offset="0x0" rw="R" size="4" initval="0x32300000" caption="Core Release">
          <bitfield name="SUBSTEP" caption="Sub-step of Core Release" mask="0xF00000"/>
          <bitfield name="STEP" caption="Step of Core Release" mask="0xF000000"/>
          <bitfield name="REL" caption="Core Release" mask="0xF0000000"/>
        </register>
        <register name="ENDN" offset="0x4" rw="R" size="4" initval="0x87654321" caption="Endian">
          <bitfield name="ETV" caption="Endianness Test Value" mask="0xFFFFFFFF"/>
        </register>
