zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__EDGESEL">
        <value name="DISABLE" caption="Edge detector is disabled" value="0"/>
        <value name="ENABLE" caption="Edge detector is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL">
        <value name="MASK" caption="Masked input" value="0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="1"/>
        <value name="LINK" caption="Linked LUT input source" value="2"/>
        <value name="EVENT" caption="Event input source" value="3"/>
        <value name="IO" caption="I/O pin input source" value="4"/>
        <value name="AC" caption="AC input source" value="5"/>
        <value name="TC" caption="TC input source" value="6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="7"/>
        <value name="TCC" caption="TCC input source" value="8"/>
        <value name="SERCOM" caption="SERCOM input source" value="9"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INVEI">
        <value name="DISABLE" caption="Incoming event is not inverted" value="0"/>
        <value name="ENABLE" caption="Incoming event is inverted" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEI">
        <value name="DISABLE" caption="LUT incoming event is disabled" value="0"/>
        <value name="ENABLE" caption="LUT incoming event is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__LUTEO">
        <value name="DISABLE" caption="LUT event output is disabled" value="0"/>
        <value name="ENABLE" caption="LUT event output is enabled" value="1"/>
      </value-group>
    </module>
    <module name="CFG" id="chip_cfg_pb" version="A" caption="">
      <register-group name="CFG" caption="">
        <register name="CFGCON0" offset="0x0" rw="RW" size="4" access-size="4" initval="0x7960000b" caption="">
          <!-- TDOEN is not used as BigBuck only use 2-wire JTAG -->
          <bitfield name="SWOEN" caption="SWO enable on 2-wire debug interface" mask="0x02"/>
          <bitfield name="TROEN" caption="Trace Output Enable" mask="0x04"/>
          <bitfield name="JTAGEN" caption="JTAG Enable" mask="0x08"/>
          <bitfield name="ADCPOVR" caption="ADC Charge Pump Override" mask="0x10"/>
          <bitfield name="CPENFILT" caption="ADC CP Filter Enable" mask="0x80"/>
          <bitfield name="RTCIN0_ALTEN" caption="RTCIN0 Alternate Enable" mask="0x100"/>
          <bitfield name="RTCOUT_ALTEN" caption="RTCOUT Alternate Enable" mask="0x200"/>
          <bitfield name="PMULOCK" caption="PMU Controller Register LOCK" mask="0x400"/>
          <bitfield name="PGLCOK" caption="Permission Group LOCK" mask="0x800"/>
          <bitfield name="PMDLOCK" caption="Peripheral Module Disable (PMD) LOCK" mask="0x1000"/>
          <bitfield name="IOLOCK" caption="IO LOCK" mask="0x2000"/>
          <bitfield name="CFGCLOCK" caption="Configuration Register Lock" mask="0xc000"/>
          <bitfield name="USBSSEN" caption="USB Suspend Sleep Enable" mask="0x20000"/>
          <bitfield name="EPLLHWMD" caption="EWPLL HW Control Mode for PWDN and RESET" mask="0x40000"/>
          <bitfield name="UPLLHWMD" caption="UWPLL HW Control Mode for PWDN and RESET" mask="0x80000"/>
          <bitfield name="HPLUGDIS" caption="Hot Plugging Disable (Outside Fuse Loading)" mask="0x100000"/>
          <bitfield name="USBIDIO" caption="USB USBID Selection bit" mask="0x200000"/>
          <bitfield name="VBUSONIO" caption="USB VBUS_ON Selection bit" mask="0x400000"/>
          <bitfield name="SMBUS3EN2" caption="SMBus3 Enable for SERCOM2" mask="0x800000"/>
          <bitfield name="PCM" caption="PCHE I/D Cacheable Mode" mask="0x1000000"/>
          <bitfield name="INT0E" caption="INT0 Enable" mask="0x2000000"/>
          <bitfield name="INT0P" caption="INT0P Polarity" mask="0x4000000"/>
          <bitfield name="CMEN" caption="SPA/DPA Countermeasures Enable" mask="0x8000000"/>
          <bitfield name="FECCCON" caption="Flash ECC Control" mask="0x30000000"/>
          <bitfield name="FRECCDIS" caption="Flex RAM ECC Control" mask="0x40000000"/>
        </register>
        <register name="CFGCON1" offset="0x10" rw="RW" size="4" access-size="4" initval="0x1f00403b" caption="">
          <bitfield name="CAN0_PIN_EN" caption="CAN0 Pin Enable" mask="0x04"/>
          <bitfield name="TRCEN" caption="Trace Enable" mask="0x20"/>
          <bitfield name="CCL_OE" caption="CCL Pads (via PPS) Output Enable" mask="0x40"/>
          <bitfield name="ZBTWKSYS" caption="ZBT Subsystem External Wake-up source" mask="0x80"/>
          <bitfield name="CMP0_OE" caption="Analog Comparator-0 Output Enable" mask="0x100"/>
          <bitfield name="CMP1_OE" caption="Analog Comparator-1 Output Enable" mask="0x200"/>
          <bitfield name="QSPI_HSEN" caption="QSPI (Direct) Enable" mask="0x400"/>
          <bitfield name="SCOM0_HSEN" caption="SERCOM0 Direct (High Speed) Pin Enable" mask="0x800"/>
          <bitfield name="SCOM1_HSEN" caption="SERCOM1 Direct (High Speed) Pin Enable" mask="0x1000"/>
          <bitfield name="SCOM2_HSEN" caption="SERCOM2 Direct (High Speed) Pin Enable" mask="0x2000"/>
          <bitfield name="SMCLR" caption="Selects CRU handling of MCLR Control" mask="0x4000"/>
          <bitfield name="QSCHE_EN" caption="QSPI Address Space Cache Attribute" mask="0x8000"/>
          <bitfield name="USBDMFTRIM" caption="USB DM Fall Trim fuse bits" mask="0x30000"/>
          <bitfield name="USBDMRTRIM" caption="USB DM Rise Trim fuse bits" mask="0xC0000"/>
          <bitfield name="USBDPFTRIM" caption="USB DP Fall Trim fuse bits" mask="0x300000"/>
          <bitfield name="USBDPRTRIM" caption="USB DP Rise Trim fuse bits" mask="0xC00000"/>
          <bitfield name="WDTPSS" caption="Watchdog Timer Post-scale Select Sleep" mask="0x1f000000"/>
          <bitfield name="QSPIDDRM" caption="QSPI DDR Mode Clock Enable" mask="0x20000000"/>
          <bitfield name="CLKZBREF" caption="External Reference Clock ZB Enable" mask="0x40000000"/>
          <bitfield name="CAN1_PIN_EN" caption="CAN1 Pin Enable" mask="0x80000000"/>
        </register>
        <register name="CFGCON2" offset="0x20" rw="RW" size="4" access-size="4" initval="0x7f7fff38" caption="">
          <bitfield name="ACMP_CYCLE" caption="AC SIB Comparator Result Wait Cycles" mask="0x7"/>
          <bitfield name="DMTINTV" caption="Dead Man Timer Count Window Interval" mask="0x38"/>
          <bitfield name="PMUTEST_VDD_EN" caption="PMU Test Output or VDD/2 Enable via ADC IE12" mask="0x80"/>
          <bitfield name="POSCMOD" caption="Primary Oscillator Configuration" mask="0x300"/>
          <bitfield name="WDTRMCS" caption="WDT RUN Mode Clock Select" mask="0xc00"/>
          <bitfield name="SOSCSEL" caption="SOSC Selection Configuration" mask="0x1000"/>
          <bitfield name="WAKE2SPD" caption="2-Speed startup enabled in Sleep mode" mask="0x2000"/>
          <bitfield name="CKSWEN" caption="Software Clock Switching Enable" mask="0x4000"/>
          <bitfield name="FSCMEN" caption="Fail-Safe Clock Monitor Enable" mask="0x8000"/>
          <bitfield name="WDTPSR" caption="Watchdog Timer Post-scale Select Run" mask="0x1f0000"/>
          <bitfield name="WDTSPGM" caption="Watchdog Timer Stop during Flash Programming" mask="0x200000"/>
          <bitfield name="WINDIS" caption="Windowed Watchdog Timer Disable" mask="0x400000"/>
          <bitfield name="WDTEN" caption="Watchdog Timer Enable" mask="0x800000"/>
          <bitfield name="WDTWINSZ" caption="Watchdog Timer Window Size" mask="0x3000000"/>
          <bitfield name="DMTCNT" caption="Dead Man Timer Count Select" mask="0x7c000000"/>
          <bitfield name="DMTEN" caption="Dead Man Timer Enable" mask="0x80000000"/>
        </register>
        <register name="CFGCON4" offset="0x40" rw="RW" size="4" access-size="4" initval="0x840e4000" caption="">
          <bitfield name="SOSC_CFG" caption="SOSC Configuration" mask="0xff"/>
          <bitfield name="RTCEVENT_SEL" caption="RTC Event Selection" mask="0x300"/>
          <bitfield name="RTCEVENT_EN" caption="Pad Output Enable for MCHP legacy RTC event output" mask="0x400"/>
          <bitfield name="VBKP_1KCSEL" caption="VDDBUKPCORE LPCLK Clock Selection" mask="0x800"/>
          <bitfield name="VBKP_32KCSEL" caption="VDDBUKPCORE 32KHz clock source selection" mask="0x3000"/>
          <bitfield name="VBKP_DIVSEL" caption="VDDBUKPCORE LPCLK Clock Divider Selection" mask="0x4000"/>
          <bitfield name="LPCLK_MOD" caption="LPCLK modifier in counter/delay mode" mask="0x8000"/>
          <bitfield name="RTCEVTYPE" caption="RTC Event Type" mask="0x10000"/>
          <bitfield name="CPEN_DLY" caption="Charge-pump ready digital delay" mask="0xe0000"/>
          <bitfield name="DSZPBOREN" caption="Deep Sleep Zero-Power BOR Enable" mask="0x100000"/>
          <bitfield name="DSWDTPS" caption="Deep Sleep Watchdog Timer Postscale Select" mask="0x3e00000"/>
          <bitfield name="DSWDTOSC" caption="Deep Sleep Watchdog Timer Reference Clock Select" mask="0x4000000"/>
          <bitfield name="DSWDTEN" caption="Deep Sleep Watchdog Timer Enable" mask="0x8000000"/>
          <bitfield name="DSEN" caption="Deep Sleep Bit Enable" mask="0x10000000"/>
          <bitfield name="UVREGROVR" caption="ULPVREG Retention Mode Override" mask="0x20000000"/>
          <bitfield name="LPOSCEN" caption="Low Power (Secondary) Oscillator Enable" mask="0x40000000"/>
          <bitfield name="RTCNTM_CSEL" caption="RTC Counter Mode Clock Select" mask="0x80000000"/>
        </register>
        <register name="CFGPGQOS1" offset="0x50" rw="RW" size="4" access-size="4" initval="0xe040004c" caption="">
          <bitfield name="CPUPG" caption="CPU (Code) Permission Group" mask="0x3"/>
          <bitfield name="CPUQOS" caption="CPU I/D and System Bus QOS Control" mask="0xc"/>
          <bitfield name="DMAPG" caption="DMA (Rd/Wr) Permission Group" mask="0x300"/>
          <bitfield name="CRYPTOPG" caption="Crypto Permission Group" mask="0x300000"/>
          <bitfield name="CRYPTOQOS" caption="Crypto QOS Control" mask="0xc00000"/>
          <bitfield name="DSUPG" caption="DSU Permission Group" mask="0x3000000"/>
          <bitfield name="FCQOS" caption="FC Controller QOS Control" mask="0x30000000"/>
          <bitfield name="WISIBQOS" caption="Wireless SIB QOS Control" mask="0xc0000000"/>
        </register>
        <register name="CFGPGQOS2" offset="0x60" rw="RW" size="4" access-size="4" initval="0x84444" caption="">
          <bitfield name="ADCPG" caption="ADC Permission Group" mask="0x3"/>
          <bitfield name="ADCQOS" caption="ADC QOS Control bits" mask="0xC"/>
          <bitfield name="USBPG" caption="USB Permission Group" mask="0x30"/>
          <bitfield name="USBQOS" caption="USB QOS Control bits" mask="0xC0"/>
          <bitfield name="CAN0PG" caption="CAN0 Permission Group" mask="0x300"/>
          <bitfield name="CAN0QOS" caption="CAN0 QOS Control bits" mask="0xC00"/>
          <bitfield name="CAN1PG" caption="CAN1 Permission Group" mask="0x3000"/>
          <bitfield name="CAN1QOS" caption="CAN1 QOS Control bits" mask="0xC000"/>
          <bitfield name="ETHPG" caption="ETH Permission Group" mask="0x30000"/>
          <bitfield name="ETHQOS" caption="ETH QOS Control bits" mask="0xC0000"/>
        </register>
        <register name="CFGI2C" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SMBUSEN0" caption="SMBus Enable for SERCOM0" mask="0x1"/>
          <bitfield name="SMBUSEN1" caption="SMBus Enable for SERCOM1" mask="0x2"/>
          <bitfield name="SMBUSEN2" caption="SMBus Enable for SERCOM2" mask="0x4"/>
          <bitfield name="SMBUSEN6" caption="SMBus Enable for SERCOM6" mask="0x40"/>
          <bitfield name="I2CDSEL0" caption="I2C Delay Select for SERCOM0" mask="0x100"/>
          <bitfield name="I2CDSEL1" caption="I2C Delay Select for SERCOM1" mask="0x200"/>
          <bitfield name="I2CDSEL2" caption="I2C Delay Select for SERCOM2" mask="0x400"/>
          <bitfield name="I2CDSEL6" caption="I2C Delay Select for SERCOM6" mask="0x4000"/>
          <bitfield name="SLRCTRL0" caption="I2C Slew Rate Control for SERCOM0" mask="0x10000"/>
          <bitfield name="SLRCTRL1" caption="I2C Slew Rate Control for SERCOM1" mask="0x20000"/>
          <bitfield name="SLRCTRL2" caption="I2C Slew Rate Control for SERCOM2" mask="0x40000"/>
          <bitfield name="SLRCTRL6" caption="I2C Slew Rate Control for SERCOM6" mask="0x400000"/>
          <bitfield name="SLRTEN0" caption="SLRT Enable for SERCOM0" mask="0x1000000"/>
          <bitfield name="SLRTEN1" caption="SLRT Enable for SERCOM1" mask="0x2000000"/>
          <bitfield name="SLRTEN2" caption="SLRT Enable for SERCOM2" mask="0x4000000"/>
          <bitfield name="SLRTEN6" caption="SLRT Enable for SERCOM6" mask="0x40000000"/>
        </register>
        <register name="CFGPCLKGEN1" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EIC__CCL_CSEL" caption="EIC/CCL Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EIC__CCL_CD" caption="EIC/CCL Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="FREQM_REF_CSEL" caption="FREQMRC Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="FREQM_REF_CD" caption="FREQMRC Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="FREQM_MSR_CSEL" caption="FREQMMC Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="FREQM_MSR_CD" caption="FREQMMC Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="SERCOM_0_1_2_CSEL" caption="SERCOM0/1/2 Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="SERCOM_0_1_2_CD" caption="SERCOM0/1/2 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="SERCOM_6_CSEL" caption="SERCOM6 Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="SERCOM_6_CD" caption="SERCOM6 Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="TCC_1_2_CSEL" caption="TCC1/2 Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="TCC_1_2_CD" caption="TCC1/2 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="SERCOM_3_4_5_CSEL" caption="SERCOM3/4/5 Clock Selection" mask="0x7000000" values="PCLKGENSEL"/>
          <bitfield name="SERCOM_3_4_5_CD" caption="SERCOM3/4/5 Clock Disable" mask="0x8000000" values="PGCLK__CTRL"/>
          <bitfield name="CM4TCSEL" caption="CM4T Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="CM4TCD" caption="CM4T Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="CFGPCLKGEN2" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EVSYS_1_CSEL" caption="EVSYSC1 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_1_CD" caption="EVSYSC1 Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_2_CSEL" caption="EVSYSC2 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_2_CD" caption="EVSYSC2 Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_3_CSEL" caption="EVSYSC3 Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_3_CD" caption="EVSYSC3 Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_4_CSEL" caption="EVSYSC4 Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_4_CD" caption="EVSYSC4 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_5_CSEL" caption="EVSYSC5 Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_5_CD" caption="EVSYSC5 Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_6_CSEL" caption="EVSYSC6 Peripheral Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_6_CD" caption="EVSYSC6 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_7_CSEL" caption="EVSYSC7 Peripheral Clock Selection" mask="0x7000000" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_7_CD" caption="EVSYSC7 Clock Disable" mask="0x8000000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_8_CSEL" caption="EVSYSC8 Peripheral Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_8_CD" caption="EVSYSC8 Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="CFGPCLKGEN3" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EVSYS_9_CSEL" caption="EVSYSC9 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_9_CD" caption="EVSYSC9 Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_10_CSEL" caption="EVSYSC10 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_10_CD" caption="EVSYSC10 Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_11_CSEL" caption="EVSYSC11 Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_11_CD" caption="EVSYSC11 Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="EVSYS_12_CSEL" caption="EVSYSC12 Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="EVSYS_12_CD" caption="EVSYSC12 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="ACCSEL" caption="AC Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="ACCD" caption="AC Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="TCC_0_CSEL" caption="TCC0 Peripheral Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="TCC_0_CD" caption="TCC0 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="ETHCSEL" caption="Ethernet Clock Selection" mask="0x7000000" values="PCLKGENSEL"/>
          <bitfield name="ETHCD" caption="Ethernet Clock Disable" mask="0x8000000" values="PGCLK__CTRL"/>
          <bitfield name="CVDCSEL" caption="CVD Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="CVDCD" caption="CVD Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="CFGPCLKGEN4" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC_0_CSEL" caption="TC0 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="TC_0_CD" caption="TC0 Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="TC_1_CSEL" caption="TC1 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="TC_1_CD" caption="TC1 Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="TC_2_3_CSEL" caption="TC23 Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="TC_2_3_CD" caption="TC23 Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="TC_4_5_CSEL" caption="TC45 Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="TC_4_5_CD" caption="TC45 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="TC_6_7_CSEL" caption="TC67 Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="TC_6_7_CD" caption="TC67 Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="TC_8_9_CSEL" caption="TC89 Peripheral Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="TC_8_9_CD" caption="TC89 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="CAN_0_CSEL" caption="CAN0 Clock Selection" mask="0x7000000" values="PCLKGENSEL"/>
          <bitfield name="CAN_0_CD" caption="CAN0 Clock Disable" mask="0x8000000" values="PGCLK__CTRL"/>
          <bitfield name="CAN_1_CSEL" caption="CAN1 Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="CAN_1_CD" caption="CAN1 Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="USER_ID" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="USER_ID" caption="User unique ID, readable using the SWD USER_ID instruction" mask="0xffff"/>
        </register>
