zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register caption="" name="PB2DIVCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x174"> </register>
        <register caption="" name="PB2DIVSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x178"> </register>
        <register caption="" name="PB2DIVINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x17C"> </register>
        <register caption="PB3 CLOCK DIVISOR CONTROL REGISTER" initval="0x8813" name="PB3DIV" offset="0x180" rw="RW" size="4">
          <bitfield caption="PB3 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB3DIV__PBDIV"/>
          <bitfield caption="PB3 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB3DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB3DIV__PBDIVON"/>
        </register>
        <register caption="" name="PB3DIVCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x184"> </register>
        <register caption="" name="PB3DIVSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x188"> </register>
        <register caption="" name="PB3DIVINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x18C"> </register>
        <register caption="PB4 CLOCK DIVISOR CONTROL REGISTER" initval="0x8801" name="PB4DIV" offset="0x190" rw="RW" size="4">
          <bitfield caption="PB4 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB4DIV__PBDIV"/>
          <bitfield caption="PB4 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB4DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB4DIV__PBDIVON"/>
        </register>
        <register caption="" name="PB4DIVCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x194"> </register>
        <register caption="" name="PB4DIVSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x198"> </register>
        <register caption="" name="PB4DIVINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x19C"> </register>
        <register caption="PB5 CLOCK DIVISOR CONTROL REGISTER" initval="0x8801" name="PB5DIV" offset="0x1a0" rw="RW" size="4">
          <bitfield caption="PB5 Peripheral Clock Divisor Control value" mask="0x0000007F" name="PBDIV" values="PB5DIV__PBDIV"/>
          <bitfield caption="PB5 Peripheral Clock Divisor Ready" mask="0x00000800" name="PBDIVRDY" values="PB5DIV__PBDIVRDY"/>
          <bitfield caption="Output Enable bit" mask="0x00008000" name="PBDIVON" values="PB5DIV__PBDIVON"/>
        </register>
        <register caption="" name="PB5DIVCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1a4"> </register>
        <register caption="" name="PB5DIVSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1a8"> </register>
        <register caption="" name="PB5DIVINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1ac"> </register>
        <register caption="SLEW RATE CONTROL FOR CLOCK SWITCHING REGISTER" initval="0x0" name="SLEWCON" offset="0x1b0" rw="RW" size="4">
          <bitfield caption="Clock Switch Slewing Active Status Bit - Read-Only" mask="0x00000001" name="BUSY" values="SLEWCON__BUSY"/>
          <bitfield caption="Clock slew enable for switching down to slower clocks" mask="0x00000002" name="DNEN" values="SLEWCON__DNEN"/>
          <bitfield caption="Clock slew enable for switching up to faster clocks" mask="0x00000004" name="UPEN" values="SLEWCON__UPEN"/>
          <bitfield caption="Divisor steps used when doing slewed clock switches" mask="0x00000700" name="SLWDIV" values="SLEWCON__SLWDIV"/>
          <bitfield caption="PBx Peripheral Clock Divisor Control value" mask="0x000F0000" name="SYSDIV" values="SLEWCON__SYSDIV"/>
          <bitfield caption="Number of clocks generated at each slew step for a clock switch" mask="0x0F000000" name="SLWDLY" values="SLEWCON__SLWDLY"/>
        </register>
        <register caption="" name="SLEWCONCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1b4"> </register>
        <register caption="" name="SLEWCONSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1b8"> </register>
        <register caption="" name="SLEWCONINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1bc"> </register>
        <register caption="CLOCK STATUS REGISTER" initval="0x0" name="CLKSTAT" offset="0x1c0" rw="RW" size="4">
          <bitfield caption="FRC Ready Status value" mask="0x00000001" name="FRCRDY" values="CLKSTAT__FRCRDY"/>
          <bitfield caption="System PLL1 Ready Status value" mask="0x00000002" name="SPLL1RDY" values="CLKSTAT__SPLL1RDY"/>
          <bitfield caption="Primary Oscillator Ready Status value" mask="0x00000004" name="POSCRDY" values="CLKSTAT__POSCRDY"/>
          <bitfield caption="SOSC Ready Status value" mask="0x00000008" name="SOSCRDY" values="CLKSTAT__SOSCRDY"/>
          <bitfield caption="LPRC Ready Status value" mask="0x00000010" name="LPRCRDY" values="CLKSTAT__LPRCRDY"/>
          <bitfield caption="Ethernet PLL2 Ready Status value" mask="0x00000020" name="EPLL2RDY" values="CLKSTAT__EPLL2RDY"/>
          <bitfield caption="USB PLL Ready Status value" mask="0x00000040" name="UPLLRDY" values="CLKSTAT__UPLLRDY"/>
          <bitfield caption="System PLL Ready Status value" mask="0x00000080" name="SPLLRDY" values="CLKSTAT__SPLLRDY"/>
          <bitfield caption="Ethernet PLL1 Ready Status value" mask="0x00000100" name="EPLL1RDY" values="CLKSTAT__EPLL1RDY"/>
          <bitfield caption="System Clock Ready Status value" mask="0x000000200" name="SYSRDY" values="CLKSTAT__SYSRDY_VALUE"/>
          <bitfield caption="PB1 Clock Ready Status value " mask="0x000000400" name="PB1RDY" values="CLKSTAT__PB1RDY_VALUE"/>
        </register>
        <register caption="" name="CLKSTATCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1c4"> </register>
        <register caption="" name="CLKSTATSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1c8"> </register>
        <register caption="" name="CLKSTATINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1cc"> </register>
        <register caption="USER CLK DIAGNOSTICS CONTROL REGISTER" initval="0x0" name="CLKDIAG" offset="0x1e0" rw="RW" size="4">
          <bitfield caption="POSC Clock Stop Control value" mask="0x00000001" name="POSCSTOP" values="CLKDIAG__POSCSTOP"/>
          <bitfield caption="SOSC Clock Stop Control value" mask="0x00000002" name="SOSCSTOP" values="CLKDIAG__SOSCSTOP"/>
          <bitfield caption="FRC Clock Stop Control value" mask="0x00000004" name="FRCSTOP" values="CLKDIAG__FRCSTOP"/>
          <bitfield caption="LPRC Clock Stop Control value" mask="0x00000008" name="LPRCSTOP" values="CLKDIAG__LPRCSTOP"/>
          <bitfield caption="SPLL1 Clock Stop Control value" mask="0x00000010" name="SPLL1STOP" values="CLKDIAG__SPLL1STOP"/>
          <bitfield caption="EPLL Clock Stop Control value" mask="0x00000020" name="EPLLSTOP" values="CLKDIAG__EPLLSTOP"/>
          <bitfield caption="UPLL Clock Stop Control value" mask="0x00000040" name="UPLLSTOP" values="CLKDIAG__UPLLSTOP"/>
          <bitfield caption="NMI Counter value" mask="0xFFFF0000" name="NMICNT"/>
        </register>
        <register caption="" name="CLKDIAGCLR" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1e4"> </register>
        <register caption="" name="CLKDIAGSET" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1e8"> </register>
        <register caption="" name="CLKDIAGINV" initval="0x00000000" access-size="4" size="4" rw="RW" offset="0x1ec"> </register>
      </register-group>
