zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
        <value caption="Request oscillator switch to selection specified by NOSC[3:0] bits" name="SWITCH" value="0x1"/>
        <value caption="Oscillator switch is complete" name="SWITCH_COMPLETE" value="0x0"/>
      </value-group>
      <value-group caption="32 kHz Secondary (LP) Oscillator Enable bit" name="OSCCON__SOSCEN">
        <value caption="Enable Secondary Oscillator" name="ON" value="0x1"/>
        <value caption="Disable Secondary Oscillator" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Clock Fail Detect bit (Read / writable / Clearable by application)" name="OSCCON__CF">
        <value caption="FSCM has detected clock failure" name="FAIL_DET" value="0x1"/>
        <value caption="FSCM has not detected clock failure" name="NO_FAILDET" value="0x0"/>
      </value-group>
      <value-group caption="Enable SLEEP Mode bit" name="OSCCON__SLPEN">
        <value caption="When a WAIT Instruction is executed device will enter SLEEP Mode" name="SLEEP" value="0x1"/>
        <value caption="When a WAIT instruction is executed device will enter IDLE Mode" name="IDLE" value="0x0"/>
      </value-group>
      <value-group caption="Clock Lock Enabled bit" name="OSCCON__CLKLOCK">
        <value caption="All clock and PLL configuration registers are locked.  These include OSCCON, OSCTRIM, SPLLCON, UPLLCON, PBxDIV" name="LOCKED" value="0x1"/>
        <value caption="Clock and PLL selection registers are not locked, configurations may be modified" name="UNLOCKED" value="0x0"/>
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
        <value caption="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV ( Supports FRC/16 and FRC/1)" name="FRCDIV" value="0x0"/>
        <value caption="System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)" name="SPLL" value="0x1"/>
        <value caption="Primary Oscillator" name="POSC" value="0x2"/>
        <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x3"/>
        <value caption="Low Power RC Oscillator (LPRC)" name="LPRC" value="0x4"/>
        <value caption="Ethernet PLL Clock-2 (EPLL Module) (input clock and divider set by APLLCON)" name="EPLL" value="0x5"/>
        <value caption="USB PLL Clock (UPLL Module) (input clock and divider set by UPLLCON)" name="UPLL" value="0x6"/>
      </value-group>
      <value-group caption="Current Oscillator Selection bits (Read-only)" name="OSCCON__COSC">
        <value caption="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV (Supports FRC/16 and FRC/1)" name="FRCDIV" value="0x0"/>
        <value caption="System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)" name="SPLL" value="0x1"/>
        <value caption="Primary Oscillator- POSC" name="POSC" value="0x2"/>
        <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x3"/>
        <value caption="Low Power RC Oscillator (LPRC)" name="LPRC" value="0x4"/>
        <value caption="Ethernet PLL Clock-2 (EPLL Module) (input clock and divider set by APLLCON)" name="EPLL" value="0x5"/>
        <value caption="USB PLL Clock (UPLL Module) (input clock and divider set by UPLLCON)" name="UPLL" value="0x6"/>
      </value-group>
      <value-group caption="" name="OSCCON__WAKE2SPD">
        <value caption="When the device EXITS Sleep Mode, the sys_clk will be from FRC until the selected clock is ready" name="FRC" value="0x1"/>
        <value caption="When the device EXITS Sleep Mode, the sys_clk will be from the selected clock." name="SELECTED_CLK" value="0x0"/>
      </value-group>
      <value-group caption="Enable Dream Mode bit" name="OSCCON__DRMEN">
        <value caption="When the cpu_si_sleep input is asserted and SLPEN = 1, DMA transfer complete causes SLEEP Mode to be entered" name="SLEEP" value="0x1"/>
        <value caption="DMA transfer has no effect" name="NO_EFFECT" value="0x0"/>
      </value-group>
      <value-group caption="Fast RC Clock Divider bits" name="OSCCON__FRCDIV">
        <value caption="FRC Divide by 1" name="DIV_1" value="0x0"/>
        <value caption="FRC Divide by 2" name="DIV_2" value="0x1"/>
        <value caption="FRC Divide by 4" name="DIV_4" value="0x2"/>
        <value caption="FRC Divide by 8" name="DIV_8" value="0x3"/>
        <value caption="FRC Divide by 16" name="DIV_16" value="0x4"/>
        <value caption="FRC Divide by 32" name="DIV_32" value="0x5"/>
        <value caption="FRC Divide by 64" name="DIV_64" value="0x6"/>
        <value caption="FRC Divide by 256" name="DIV_256" value="0x7"/>
      </value-group>
      <value-group caption="Internal Fast RC (FRC) Oscillator Tuning bits" name="OSCTUN__TUN">
        <value caption="Maximum Frequency" name="Max" value="0x1f"/>
        <value caption="Center Frequency, oscillator is running at calibrated frequency" name="Center" value="0x0"/>
        <value caption="Minimum Frequency" name="Min" value="0x20"/>
      </value-group>
      <value-group caption="PLL Power Down Register bit" name="SPLLCON__SPLLPWDN">
        <value caption="PLL is powered down" name="PLL_OFF" value="0x1"/>
        <value caption="PLL is active" name="PLL_ON" value="0x0"/>
      </value-group>
      <value-group caption="System PLL Force Lock" name="SPLLCON__SPLLFLOCK">
        <value caption="Force the SPLL lock signal to be asserted" name="ASSERT" value="0x1"/>
        <value caption="Do not force the SPLL lock signal to be asserted" name="NO_ASSERT" value="0x0"/>
      </value-group>
      <value-group caption="System PLL Reset" name="SPLLCON__SPLLRST">
        <value caption="Assert the reset to the SPLL" name="ASSERT" value="0x1"/>
        <value caption="De-assert the reset to the SPLL" name="NO_ASSERT" value="0x0"/>
      </value-group>
      <value-group caption="ADC-CP Post Divide Value, 1 to 15" name="SPLLCON__SPLLPOSTDIV2">
        <value caption="Disable" name="DISABLE" value="0x0"/>
        <value caption="Second post divide by 1" name="DIV_1" value="0x1"/>
        <value caption="Second post divide by 2" name="DIV_2" value="0x2"/>
        <value caption="Second post divide by 3" name="DIV_3" value="0x3"/>
        <value caption="Second post divide by 4" name="DIV_4" value="0x4"/>
        <value caption="Second post divide by 5" name="DIV_5" value="0x5"/>
        <value caption="Second post divide by 6" name="DIV_6" value="0x6"/>
        <value caption="Second post divide by 7" name="DIV_7" value="0x7"/>
        <value caption="Second post divide by 8" name="DIV_8" value="0x8"/>
        <value caption="Second post divide by 9" name="DIV_9" value="0x9"/>
        <value caption="Second post divide by 10" name="DIV_10" value="0xa"/>
        <value caption="Second post divide by 11" name="DIV_11" value="0xb"/>
        <value caption="Second post divide by 12" name="DIV_12" value="0xc"/>
        <value caption="Second post divide by 13" name="DIV_13" value="0xd"/>
        <value caption="Second post divide by 14" name="DIV_14" value="0xe"/>
        <value caption="Second post divide by 15" name="DIV_15" value="0xf"/>
      </value-group>
      <value-group caption="SPLL Bypass; when this bit is set, the input clock REF bypasses PLL to PLLOUTx." name="SPLLCON__SPLL_BYP">
        <value caption="SPLL3 (RFPLL) Clock is the clock source for ADC CP Clock Generation." name="SPLL3" value="0x0"/>
        <value caption="FRC is used as clock source for ADC CP Clock Generation." name="FRC" value="0x3"/>
        <value caption="POSC is used as clock source for ADC CP Clock Generation." name="POSC" value="0x2"/>
      </value-group>
      <value-group caption="UPLL bandwith select" name="UPLLCON__UPLLBWSEL">
        <value caption="UPLL closed loop bandwith 400KHz" name="400KHz" value="0x1"/>
        <value caption="UPLL closed loop bandwith 1MHz" name="1MHz" value="0x2"/>
        <value caption="UPLL closed loop bandwith 2MHz" name="2MHz" value="0x3"/>
        <value caption="UPLL closed loop bandwith 3MHz" name="3MHz" value="0x4"/>
      </value-group>
      <value-group caption="UPLL Power Down Register bit" name="UPLLCON__UPLLPWDN">
        <value caption="UPLL is powered down" name="PLL_OFF" value="0x1"/>
        <value caption="UPLL is active" name="PLL_ON" value="0x0"/>
      </value-group>
      <value-group caption="USB PLL Force Lock" name="UPLLCON__UPLLFLOCK">
        <value caption="Force the UPLL lock signal to be asserted" name="ASSERT" value="0x1"/>
        <value caption="Do not force the SPLL lock signal to be asserted" name="NO_ASSERT" value="0x0"/>
      </value-group>
      <value-group caption="USB PLL Reset" name="UPLLCON__UPLLRESET">
        <value caption="Assert the reset to the UPLL" name="ASSERT" value="0x1"/>
        <value caption="De-assert the reset to the UPLL" name="NO_ASSERT" value="0x0"/>
      </value-group>
      <value-group caption="UPLL Bypass" name="UPLLCON__UPLL_BYP">
        <value caption="UPLL Bypass; when this bit is set, the input clock REF bypasses PLL to PLLOUTx" name="BYPASS" value="0x1"/>
        <value caption="The input clock dont bypass" name="NOT_BYPASS" value="0x0"/>
      </value-group>
      <value-group caption="EPLL bandwith select" name="EPLLCON__EPLLBWSEL">
        <value caption="EPLL closed loop bandwith 400KHz" name="400KHz" value="0x1"/>
        <value caption="EPLL closed loop bandwith 1MHz" name="1MHz" value="0x2"/>
        <value caption="EPLL closed loop bandwith 2MHz" name="2MHz" value="0x3"/>
        <value caption="EPLL closed loop bandwith 3MHz" name="3MHz" value="0x4"/>
      </value-group>
