zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
      <value-group caption="Primary Oscillator Ready Status value" name="CLKSTAT__POSCRDY">
        <value caption="POSC is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="POSC is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="SOSC Ready Status value" name="CLKSTAT__SOSCRDY">
        <value caption="SOSC is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="SOSC is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="LPRC Ready Status value" name="CLKSTAT__LPRCRDY">
        <value caption="LPRC is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="LPRC is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="Ethernet PLL2 Ready Status value" name="CLKSTAT__EPLL2RDY">
        <value caption="EPLL2 is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="EPLL2 is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="USB PLL Ready Status value" name="CLKSTAT__UPLLRDY">
        <value caption="UPLL is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="UPLL is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="System PLL Ready Status value" name="CLKSTAT__SPLLRDY">
        <value caption="SPLL is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="SPLL is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="Ethernet PLL1 Ready Status value" name="CLKSTAT__EPLL1RDY">
        <value caption="EPLL1 is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="EPLL1 is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="System Clock Ready Status value" name="CLKSTAT__SYSRDY_VALUE">
        <value caption="System clock is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="System clock is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="PB1 Clock Ready Status value" name="CLKSTAT__PB1RDY_VALUE">
        <value caption="PB1 clock is not stable and not ready" name="NOTRDY" value="0x0"/>
        <value caption="PB1 clock is stable and ready" name="RDY" value="0x1"/>
      </value-group>
      <value-group caption="POSC Clock Stop Control value" name="CLKDIAG__POSCSTOP">
        <value caption="POSC clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="POSC clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="SOSC Clock Stop Control value" name="CLKDIAG__SOSCSTOP">
        <value caption="SOSC clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="SOSC clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="FRC Clock Stop Control value" name="CLKDIAG__FRCSTOP">
        <value caption="FRC clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="FRC clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="LPRC Clock Stop Control value" name="CLKDIAG__LPRCSTOP">
        <value caption="LPRC clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="LPRC clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="SPLL1 Clock Stop Control value" name="CLKDIAG__SPLL1STOP">
        <value caption="SPLL1 clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="SPLL1 clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="UPLL Clock Stop Control value" name="CLKDIAG__UPLLSTOP">
        <value caption="UPLL clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="UPLL clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
      <value-group caption="EPLL Clock Stop Control value" name="CLKDIAG__EPLLSTOP">
        <value caption="EPLL clock source runs as normal" name="NORM" value="0x0"/>
        <value caption="EPLL clock source is stopped" name="STOP" value="0x1"/>
      </value-group>
    </module>
    <module name="CVD" id="05033" name2="adc_cvd_ctrl_upb_v2" version="Rev A.1" caption="Hardware CVD Controller Macro">
      <register-group name="CVD" caption="Hardware CVD Controller Macro">
        <register name="CVDCON" offset="0x0" rw="RW" size="4" initval="0x00020000" caption="CVD Control Register">
          <bitfield name="TRIGSEL" caption="Selects one of 15 external trigger inputs to start scanning." mask="0xF"/>
          <bitfield name="CLKSEL" caption="Clock Select for FSM00= UPB_FSM_CLK01= External clock source 110= External clock source 211= External clock source 3" mask="0x30"/>
          <bitfield name="FIFOTH" caption="Threshold for the results FIFO that will cause an interrupt and watermark FIFOWM status bitassertion" mask="0x3FF00"/>
          <bitfield name="FIFOTHIEN" caption="FIFO Threshold Interrupt Enable1= Controller will assert an interrupt when the FIFO threshold is met0= Controller will not assert an interrupt when the FIFO threshold is met" mask="0x40000"/>
          <bitfield name="CVDIEN" caption="Global Interrupt Enable for full macro. Gates any enabled FIFO or Scan Descriptor interrupts." mask="0x80000"/>
          <bitfield name="THSTR" caption="Threshold Store Mode1= Store only results which exceed the programmed threshold for the Scan Descriptor0= Store all results in FIFO" mask="0x800000"/>
          <bitfield name="SWTRIG" caption="Software Trigger control. Starts scan manuallyCleared by Hardware." mask="0x1000000"/>
          <bitfield name="ABORT" caption="Instructs the controller to abort the current scan. The controller will move on to the next enabled ScanDescriptor if there is one, else it will go idle.Cleared by Hardware" mask="0x2000000"/>
          <bitfield name="SDWREN" caption="Scan Descriptor Write Enable1= Enables writes to the scan descriptors, and prevents Scan Descriptor EN bits from being decoded and captured intoFSM_CLK domain by the Descriptor Selection Logic. This simplifies synchronization issues. The currently active ScanDescriptor registers should NOT be written even if SDWREN is asserted, as the FSM uses those bits directly without asynchronizer as a means of saving gates.0= Prevents writes to the scan descriptors, and enables the Descriptor Selector Logic to decode the next Scan Descriptor to run and capture it into the FSM domain." mask="0x8000000"/>
          <bitfield name="ORDER" caption="RX/TX Loop Order1= Scan all requested TX indexes, then increment RX index and continue0= Scan all requested RX indexes, then increment TX index and continue" mask="0x10000000"/>
          <bitfield name="SIDL" caption="Stop in Idle Mode bit1= CVD controller halts when device enters Idle mode0= CVD controller continues running in Idle mode" mask="0x20000000"/>
          <bitfield name="FRZ" caption="Freeze Mode1= CVD controller halts in debugger mode0= CVD controller runs in debugger mode" mask="0x40000000"/>
          <bitfield name="ON" caption="Enables the State Machine to scan enabled Scan Descriptors upon next trigger." mask="0x80000000"/>
        </register>
