zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="CVDADC" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CVD ADC Configuration Register">
          <bitfield name="CVDCPL" caption="Capacitor Party Line" mask="0x07"/>
          <bitfield name="CVDEN" caption="Enable CVD" mask="0x08"/>
          <bitfield name="SELRES" caption="Shared sarcore resolution select" mask="0x300"/>
          <bitfield name="DIFFPEN" caption="Shared sarcore differential enabled" mask="0x400"/>
          <bitfield name="ANN1EN" caption="ANN1 channel enabled" mask="0x800"/>
        </register>
        <register name="CVDSTAT" offset="0x8" rw="RW" size="4" initval="0x20000000" caption="CVD Status Register">
          <bitfield name="SD1BUSY" caption="Scan Descriptor 1 is in progress" mask="0x1"/>
          <bitfield name="SD1DONE" caption="Core will set this bit if Scan Descriptor 1 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 1." mask="0x2"/>
          <bitfield name="SD1INT" caption="Scan Descriptor 1 has caused an interrupt" mask="0x4"/>
          <bitfield name="SD2BUSY" caption="Scan Descriptor 2 is in progress" mask="0x10"/>
          <bitfield name="SD2DONE" caption="Core will set this bit if Scan Descriptor 2 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 2." mask="0x20"/>
          <bitfield name="SD2INT" caption="Scan Descriptor 2 has caused an interrupt" mask="0x40"/>
          <bitfield name="SD3BUSY" caption="Scan Descriptor 3 is in progress" mask="0x100"/>
          <bitfield name="SD3DONE" caption="Core will set this bit if Scan Descriptor 3 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 3." mask="0x200"/>
          <bitfield name="SD3INT" caption="Scan Descriptor 3 has caused an interrupt" mask="0x400"/>
          <bitfield name="SD4BUSY" caption="Scan Descriptor 4 is in progress" mask="0x1000"/>
          <bitfield name="SD4DONE" caption="Core will set this bit if Scan Descriptor 4 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 4." mask="0x2000"/>
          <bitfield name="SD4INT" caption="Scan Descriptor 4 has caused an interrupt." mask="0x4000"/>
          <bitfield name="FIFOCNT" caption="Results FIFO word count: Indicates the number of words in the Results FIFO." mask="0x3FF0000"/>
          <bitfield name="FIFOMT" caption="The Results FIFO is empty." mask="0x20000000"/>
          <bitfield name="FIFOWM" caption="The Results FIFO has reached the programmed FIFOTHRESH threshold." mask="0x40000000"/>
          <bitfield name="FIFOFULL" caption="The Results FIFO is full." mask="0x80000000"/>
        </register>
        <register name="CVDRESH" offset="0x10" rw="R" size="4" initval="0x00000000" caption="CVD RESULTS POS FIFO Read Register (CVDRESH)">
          <bitfield name="POS" caption="The accumulated result of the positive-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned." mask="0xFFFFFF"/>
        </register>
        <register name="CVDRESL" offset="0x14" rw="R" size="4" initval="0x00000000" caption="CVD RESULTS NEG FIFO Read Register">
          <bitfield name="NEG" caption="The accumulated result of the negative-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned." mask="0xFFFFFF"/>
        </register>
        <register name="CVDRESD" offset="0x18" rw="R" size="4" initval="0x00000000" caption="CVD RESULTS DESCRIPTOR FIFO Read Register">
          <bitfield name="DELTA" caption="Delta of the accumulated results of the negative-side and positive-side measurements." mask="0x3FFFF"/>
          <bitfield name="RXINDEX" caption="Receive Index for this result. If the Stride of the Scan Descriptor was more than one, the ReceiveIndex indicates the first one of the group." mask="0xF80000"/>
          <bitfield name="SDNUM" caption="Scan Descriptor Number that generated this result" mask="0x3000000"/>
          <bitfield name="TXINDEX" caption="Transmit Index for this result. If the Stride of the Scan Descriptor was more than one, the Transmit Index indicates the first one of the group." mask="0xF8000000"/>
        </register>
        <register name="CVDRX0" offset="0x80" rw="RW" size="4" initval="0x00000000" caption="CVD RECEIVE INDEX 0-3 CONFIGURATION Register">
          <bitfield name="RXAN1" caption="ANx/CVDR channel to use for RX Index 0" mask="0x3F"/>
          <bitfield name="RXAN2" caption="ANx/CVDR channel to use for RX Index 1" mask="0x3F00"/>
          <bitfield name="RXAN3" caption="ANx/CVDR channel to use for RX Index 2" mask="0x3F0000"/>
          <bitfield name="RXAN4" caption="ANx/CVDR channel to use for RX Index 3" mask="0x3F000000"/>
        </register>
        <register name="CVDRX1" offset="0x84" rw="RW" size="4" initval="0x00000000" caption="CVD RECEIVE INDEX 4-7 CONFIGURATION Register">
          <bitfield name="RXAN5" caption="ANx/CVDR channel to use for RX Index 4" mask="0x3F"/>
          <bitfield name="RXAN6" caption="ANx/CVDR channel to use for RX Index 5" mask="0x3F00"/>
          <bitfield name="RXAN7" caption="ANx/CVDR channel to use for RX Index 6" mask="0x3F0000"/>
          <bitfield name="RXAN8" caption="ANx/CVDR channel to use for RX Index 7" mask="0x3F000000"/>
        </register>
        <register name="CVDRX2" offset="0x88" rw="RW" size="4" initval="0x00000000" caption="CVD RECEIVE INDEX 8-11 CONFIGURATION Register">
          <bitfield name="RXAN9" caption="ANx/CVDR channel to use for RX Index 8" mask="0x3F"/>
          <bitfield name="RXAN10" caption="ANx/CVDR channel to use for RX Index 9" mask="0x3F00"/>
          <bitfield name="RXAN11" caption="ANx/CVDR channel to use for RX Index 10" mask="0x3F0000"/>
          <bitfield name="RXAN12" caption="ANx/CVDR channel to use for RX Index 11" mask="0x3F000000"/>
        </register>
        <register name="CVDRX3" offset="0x8C" rw="RW" size="4" initval="0x00000000" caption="CVD RECEIVE INDEX 12-15 CONFIGURATION Register">
          <bitfield name="RXAN13" caption="ANx/CVDR channel to use for RX Index 12" mask="0x3F"/>
          <bitfield name="RXAN14" caption="ANx/CVDR channel to use for RX Index 13" mask="0x3F00"/>
          <bitfield name="RXAN15" caption="ANx/CVDR channel to use for RX Index 14" mask="0x3F0000"/>
          <bitfield name="RXAN16" caption="ANx/CVDR channel to use for RX Index 15" mask="0x3F000000"/>
        </register>
        <register name="CVDRX4" offset="0x90" rw="RW" size="4" initval="0x00000000" caption="CVD RECEIVE INDEX 16-17 CONFIGURATION Register">
          <bitfield name="RXAN17" caption="ANx/CVDR channel to use for RX Index 16" mask="0x3F"/>
          <bitfield name="RXAN18" caption="ANx/CVDR channel to use for RX Index 17" mask="0x3F00"/>
        </register>
