zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="CVDTX0" offset="0xC0" rw="RW" size="4" initval="0x00000000" caption="CVD TRANSMIT INDEX 0-3 NCONFIGURATION">
          <bitfield name="TXAN0" caption="CVDT channel to use for TX Index 0" mask="0x3F"/>
          <bitfield name="TXAN1" caption="CVDT channel to use for TX Index 1" mask="0x3F00"/>
          <bitfield name="TXAN2" caption="CVDT channel to use for TX Index 2" mask="0x3F0000"/>
          <bitfield name="TXAN3" caption="CVDT channel to use for TX Index 3" mask="0x3F000000"/>
        </register>
        <register name="CVDTX1" offset="0xC4" rw="RW" size="4" initval="0x00000000" caption="CVD TRANSMIT INDEX 4-7 NCONFIGURATION">
          <bitfield name="TXAN4" caption="CVDT channel to use for TX Index 4" mask="0x3F"/>
          <bitfield name="TXAN5" caption="CVDT channel to use for TX Index 5" mask="0x3F00"/>
          <bitfield name="TXAN6" caption="CVDT channel to use for TX Index 6" mask="0x3F0000"/>
          <bitfield name="TXAN7" caption="CVDT channel to use for TX Index 7" mask="0x3F000000"/>
        </register>
        <register name="CVDTX2" offset="0xC8" rw="RW" size="4" initval="0x00000000" caption="CVD TRANSMIT INDEX 8-11 NCONFIGURATION">
          <bitfield name="TXAN8" caption="CVDT channel to use for TX Index 8" mask="0x3F"/>
          <bitfield name="TXAN9" caption="CVDT channel to use for TX Index 9" mask="0x3F00"/>
          <bitfield name="TXAN10" caption="CVDT channel to use for TX Index 10" mask="0x3F0000"/>
          <bitfield name="TXAN11" caption="CVDT channel to use for TX Index 11" mask="0x3F000000"/>
        </register>
        <register name="CVDTX3" offset="0xCC" rw="RW" size="4" initval="0x00000000" caption="CVD TRANSMIT INDEX 12-15 NCONFIGURATION">
          <bitfield name="TXAN12" caption="CVDT channel to use for TX Index 12" mask="0x3F"/>
          <bitfield name="TXAN13" caption="CVDT channel to use for TX Index 13" mask="0x3F00"/>
          <bitfield name="TXAN14" caption="CVDT channel to use for TX Index 14" mask="0x3F0000"/>
          <bitfield name="TXAN15" caption="CVDT channel to use for TX Index 15" mask="0x3F000000"/>
        </register>
        <register name="CVDTX4" offset="0xD0" rw="RW" size="4" initval="0x00000000" caption="CVD TRANSMIT INDEX 12-15 NCONFIGURATION">
          <bitfield name="TXAN16" caption="CVDT channel to use for TX Index 16" mask="0x3F"/>
          <bitfield name="TXAN17" caption="CVDT channel to use for TX Index 17" mask="0x3F00"/>
        </register>
        <register name="CVDSD0C1" offset="0x100" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL1 REGISTER">
          <bitfield name="SDOVRSAMP" caption="Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated" mask="0x7F"/>
          <bitfield name="SDTH" caption="Scan Descriptor Threshold." mask="0xFFFFFF00"/>
        </register>
        <register name="CVDSD1C1" offset="0x110" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL1 REGISTER">
          <bitfield name="SDOVRSAMP" caption="Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated" mask="0x7F"/>
          <bitfield name="SDTH" caption="Scan Descriptor Threshold." mask="0xFFFFFF00"/>
        </register>
        <register name="CVDSD2C1" offset="0x120" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL1 REGISTER">
          <bitfield name="SDOVRSAMP" caption="Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated" mask="0x7F"/>
          <bitfield name="SDTH" caption="Scan Descriptor Threshold." mask="0xFFFFFF00"/>
        </register>
        <register name="CVDSD3C1" offset="0x130" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL1 REGISTER">
          <bitfield name="SDOVRSAMP" caption="Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated" mask="0x7F"/>
          <bitfield name="SDTH" caption="Scan Descriptor Threshold." mask="0xFFFFFF00"/>
        </register>
        <register name="CVDSD0C2" offset="0x104" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL2 REGISTER">
          <bitfield name="SDRXBEG" caption="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan." mask="0x3F"/>
          <bitfield name="SDRXSTRIDE0" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC0"/>
          <bitfield name="SDRXEND" caption="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete." mask="0x3F00"/>
          <bitfield name="SDRXSTRIDE1" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC000"/>
          <bitfield name="SDTXBEG" caption="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan." mask="0x3F0000"/>
          <bitfield name="SDTXSTRIDE0" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC00000"/>
          <bitfield name="SDTXEND" caption="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete." mask="0x3F000000"/>
          <bitfield name="SDTXSTRIDE1" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC0000000"/>
        </register>
        <register name="CVDSD1C2" offset="0x114" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL2 REGISTER">
          <bitfield name="SDRXBEG" caption="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan." mask="0x3F"/>
          <bitfield name="SDRXSTRIDE0" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC0"/>
          <bitfield name="SDRXEND" caption="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete." mask="0x3F00"/>
          <bitfield name="SDRXSTRIDE1" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC000"/>
          <bitfield name="SDTXBEG" caption="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan." mask="0x3F0000"/>
          <bitfield name="SDTXSTRIDE0" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC00000"/>
          <bitfield name="SDTXEND" caption="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete." mask="0x3F000000"/>
          <bitfield name="SDTXSTRIDE1" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC0000000"/>
        </register>
        <register name="CVDSD2C2" offset="0x124" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL2 REGISTER">
          <bitfield name="SDRXBEG" caption="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan." mask="0x3F"/>
          <bitfield name="SDRXSTRIDE0" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC0"/>
          <bitfield name="SDRXEND" caption="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete." mask="0x3F00"/>
          <bitfield name="SDRXSTRIDE1" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC000"/>
          <bitfield name="SDTXBEG" caption="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan." mask="0x3F0000"/>
          <bitfield name="SDTXSTRIDE0" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC00000"/>
          <bitfield name="SDTXEND" caption="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete." mask="0x3F000000"/>
          <bitfield name="SDTXSTRIDE1" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC0000000"/>
        </register>
        <register name="CVDSD3C2" offset="0x134" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL2 REGISTER">
          <bitfield name="SDRXBEG" caption="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan." mask="0x3F"/>
          <bitfield name="SDRXSTRIDE0" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC0"/>
          <bitfield name="SDRXEND" caption="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete." mask="0x3F00"/>
          <bitfield name="SDRXSTRIDE1" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC000"/>
          <bitfield name="SDTXBEG" caption="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan." mask="0x3F0000"/>
          <bitfield name="SDTXSTRIDE0" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC00000"/>
          <bitfield name="SDTXEND" caption="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete." mask="0x3F000000"/>
          <bitfield name="SDTXSTRIDE1" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC0000000"/>
        </register>
        <register name="CVDSD0C3" offset="0x108" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL3 REGISTER">
          <bitfield name="SDCHGTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s)" mask="0x7F"/>
          <bitfield name="SDACQTIME" caption="Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle" mask="0x7F00"/>
          <bitfield name="CVDCPL" caption="Capacitor Voltage Divider (CVD) Setting bits" mask="0x70000"/>
          <bitfield name="CVDEN" caption=" Capacitive Voltage Division Enable bit" mask="0x80000"/>
          <bitfield name="SDMUT" caption="Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements" mask="0x1000000"/>
          <bitfield name="SDSELF" caption="Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements" mask="0x2000000"/>
          <bitfield name="SDINTEN" caption="Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt" mask="0x4000000"/>
          <bitfield name="SDBUF" caption="Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist)" mask="0x8000000"/>
          <bitfield name="SDEN" caption="Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors." mask="0xC0000000"/>
        </register>
        <register name="CVDSD1C3" offset="0x118" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL3 REGISTER">
          <bitfield name="SDCHGTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s)" mask="0x7F"/>
          <bitfield name="SDACQTIME" caption="Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle" mask="0x7F00"/>
          <bitfield name="CVDCPL" caption="Capacitor Voltage Divider (CVD) Setting bits" mask="0x70000"/>
          <bitfield name="CVDEN" caption=" Capacitive Voltage Division Enable bit" mask="0x80000"/>
          <bitfield name="SDMUT" caption="Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements" mask="0x1000000"/>
          <bitfield name="SDSELF" caption="Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements" mask="0x2000000"/>
          <bitfield name="SDINTEN" caption="Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt" mask="0x4000000"/>
          <bitfield name="SDBUF" caption="Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist)" mask="0x8000000"/>
          <bitfield name="SDEN" caption="Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors." mask="0xC0000000"/>
        </register>
