zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
      <value-group name="DMAC_PRICTRL0__QOS2">
        <value name="REGULAR" caption="Regular delivery" value="0"/>
        <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
        <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
        <value name="CRITICAL" caption="Latency critical" value="3"/>
      </value-group>
      <value-group name="DMAC_PRICTRL0__QOS3">
        <value name="REGULAR" caption="Regular delivery" value="0"/>
        <value name="SHORTAGE" caption="Bandwidth shortage" value="1"/>
        <value name="SENSITIVE" caption="Latency sensitive" value="2"/>
        <value name="CRITICAL" caption="Latency critical" value="3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLA__BURSTLEN">
        <value name="SINGLE" caption="Single-beat burst length" value="0"/>
        <value name="2BEAT" caption="2-beats burst length" value="1"/>
        <value name="3BEAT" caption="3-beats burst length" value="2"/>
        <value name="4BEAT" caption="4-beats burst length" value="3"/>
        <value name="5BEAT" caption="5-beats burst length" value="4"/>
        <value name="6BEAT" caption="6-beats burst length" value="5"/>
        <value name="7BEAT" caption="7-beats burst length" value="6"/>
        <value name="8BEAT" caption="8-beats burst length" value="7"/>
        <value name="9BEAT" caption="9-beats burst length" value="8"/>
        <value name="10BEAT" caption="10-beats burst length" value="9"/>
        <value name="11BEAT" caption="11-beats burst length" value="10"/>
        <value name="12BEAT" caption="12-beats burst length" value="11"/>
        <value name="13BEAT" caption="13-beats burst length" value="12"/>
        <value name="14BEAT" caption="14-beats burst length" value="13"/>
        <value name="15BEAT" caption="15-beats burst length" value="14"/>
        <value name="16BEAT" caption="16-beats burst length" value="15"/>
      </value-group>
      <value-group name="DMAC_CHCTRLA__THRESHOLD">
        <value name="1BEAT" caption="Destination write starts after each beat source address read" value="0"/>
        <value name="2BEATS" caption="Destination write starts after 2-beats source address read" value="1"/>
        <value name="4BEATS" caption="Destination write starts after 4-beats source address read" value="2"/>
        <value name="8BEATS" caption="Destination write starts after 8-beats source address read" value="3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLA__TRIGACT">
        <value name="BLOCK" caption="One trigger required for each block transfer" value="0"/>
        <value name="BURST" caption="One trigger required for each burst transfer" value="2"/>
        <value name="TRANSACTION" caption="One trigger required for each transaction" value="3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLA__TRIGSRC">
        <value name="DISABLE" caption="Only software/event triggers" value="0"/>
        <value name="RTC_DMAC_ID_TIMESTAMP" caption="Trigger source is RTC" value="1"/>
        <value name="DSU_DMAC_ID_DCC0" caption="Trigger source is DSU DCC0" value="2"/>
        <value name="DSU_DMAC_ID_DCC1" caption="Trigger source is DSU DCC1" value="3"/>
        <value name="SERCOM0_DMAC_ID_RX" caption="Trigger source is SERCOM0 RX" value="4"/>
        <value name="SERCOM0_DMAC_ID_TX" caption="Trigger source is SERCOM0 TX" value="5"/>
        <value name="SERCOM1_DMAC_ID_RX" caption="Trigger source is SERCOM1 RX" value="6"/>
        <value name="SERCOM1_DMAC_ID_TX" caption="Trigger source is SERCOM1 TX" value="7"/>
        <value name="SERCOM2_DMAC_ID_RX" caption="Trigger source is SERCOM2 RX" value="8"/>
        <value name="SERCOM2_DMAC_ID_TX" caption="Trigger source is SERCOM2 TX" value="9"/>
        <value name="SERCOM3_DMAC_ID_RX" caption="Trigger source is SERCOM3 RX" value="10"/>
        <value name="SERCOM3_DMAC_ID_TX" caption="Trigger source is SERCOM3 TX" value="11"/>
        <value name="SERCOM4_DMAC_ID_RX" caption="Trigger source is SERCOM4 RX" value="12"/>
        <value name="SERCOM4_DMAC_ID_TX" caption="Trigger source is SERCOM4 TX" value="13"/>
        <value name="SERCOM5_DMAC_ID_RX" caption="Trigger source is SERCOM5 RX" value="14"/>
        <value name="SERCOM5_DMAC_ID_TX" caption="Trigger source is SERCOM5 TX" value="15"/>
        <value name="SERCOM6_DMAC_ID_RX" caption="Trigger source is SERCOM6 RX" value="16"/>
        <value name="SERCOM6_DMAC_ID_TX" caption="Trigger source is SERCOM6 TX" value="17"/>
        <value name="TCC0_DMAC_ID_OVF" caption="Trigger source is TCC0 OVF" value="18"/>
        <value name="TCC0_DMAC_ID_MC_0" caption="Trigger source is TCC0 MC0" value="19"/>
        <value name="TCC0_DMAC_ID_MC_1" caption="Trigger source is TCC0 MC1" value="20"/>
        <value name="TCC0_DMAC_ID_MC_2" caption="Trigger source is TCC0 MC2" value="21"/>
        <value name="TCC0_DMAC_ID_MC_3" caption="Trigger source is TCC0 MC3" value="22"/>
        <value name="TCC0_DMAC_ID_MC_4" caption="Trigger source is TCC0 MC4" value="23"/>
        <value name="TCC0_DMAC_ID_MC_5" caption="Trigger source is TCC0 MC5" value="24"/>
        <value name="TCC1_DMAC_ID_OVF" caption="Trigger source is TCC1 OVF" value="25"/>
        <value name="TCC1_DMAC_ID_MC_0" caption="Trigger source is TCC1 MC0" value="26"/>
        <value name="TCC1_DMAC_ID_MC_1" caption="Trigger source is TCC1 MC1" value="27"/>
        <value name="TCC1_DMAC_ID_MC_2" caption="Trigger source is TCC1 MC2" value="28"/>
        <value name="TCC1_DMAC_ID_MC_3" caption="Trigger source is TCC1 MC3" value="29"/>
        <value name="TCC1_DMAC_ID_MC_4" caption="Trigger source is TCC1 MC4" value="30"/>
        <value name="TCC1_DMAC_ID_MC_5" caption="Trigger source is TCC1 MC5" value="31"/>
        <value name="TCC2_DMAC_ID_OVF" caption="Trigger source is TCC2 OVF" value="32"/>
        <value name="TCC2_DMAC_ID_MC_0" caption="Trigger source is TCC2 MC0" value="33"/>
        <value name="TCC2_DMAC_ID_MC_1" caption="Trigger source is TCC2 MC1" value="34"/>
        <value name="TC0_DMAC_ID_OVF" caption="Trigger source is TCO OVF" value="35"/>
        <value name="TC0_DMAC_ID_MC_0" caption="Trigger source is TC0 MC0" value="36"/>
        <value name="TC0_DMAC_ID_MC_1" caption="Trigger source is TC0 MC1" value="37"/>
        <value name="TC1_DMAC_ID_OVF" caption="Trigger source is TC1 OVF" value="38"/>
        <value name="TC1_DMAC_ID_MC_0" caption="Trigger source is TC1 MC0" value="39"/>
        <value name="TC1_DMAC_ID_MC_1" caption="Trigger source is TC1 MC1" value="40"/>
        <value name="TC2_DMAC_ID_OVF" caption="Trigger source is TC2 OVF" value="41"/>
        <value name="TC2_DMAC_ID_MC_0" caption="Trigger source is TC2 MC0" value="42"/>
        <value name="TC2_DMAC_ID_MC_1" caption="Trigger source is TC2 MC1" value="43"/>
        <value name="TC3_DMAC_ID_OVF" caption="Trigger source is TC3 OVF" value="44"/>
        <value name="TC3_DMAC_ID_MC_0" caption="Trigger source is TC3 MC0" value="45"/>
        <value name="TC3_DMAC_ID_MC_1" caption="Trigger source is TC3 MC1" value="46"/>
        <value name="TC4_DMAC_ID_OVF" caption="Trigger source is TC4 OVF" value="47"/>
        <value name="TC4_DMAC_ID_MC_0" caption="Trigger source is TC4 MC0" value="48"/>
        <value name="TC4_DMAC_ID_MC_1" caption="Trigger source is TC4 MC1" value="49"/>
        <value name="TC5_DMAC_ID_OVF" caption="Trigger source is TC5 OVF" value="50"/>
        <value name="TC5_DMAC_ID_MC_0" caption="Trigger source is TC5 MC0" value="51"/>
        <value name="TC5_DMAC_ID_MC_1" caption="Trigger source is TC5 MC1" value="52"/>
        <value name="TC6_DMAC_ID_OVF" caption="Trigger source is TC6 OVF" value="53"/>
        <value name="TC6_DMAC_ID_MC_0" caption="Trigger source is TC6 MC0" value="54"/>
        <value name="TC6_DMAC_ID_MC_1" caption="Trigger source is TC6 MC1" value="55"/>
        <value name="TC7_DMAC_ID_OVF" caption="Trigger source is TC7 OVF" value="56"/>
        <value name="TC7_DMAC_ID_MC_0" caption="Trigger source is TC7 MC0" value="57"/>
        <value name="TC7_DMAC_ID_MC_1" caption="Trigger source is TC7 MC1" value="58"/>
        <value name="TC8_DMAC_ID_OVF" caption="Trigger source is TC8 OVF" value="59"/>
        <value name="TC8_DMAC_ID_MC_0" caption="Trigger source is TC8 MC0" value="60"/>
        <value name="TC8_DMAC_ID_MC_1" caption="Trigger source is TC8 MC1" value="61"/>
        <value name="TC9_DMAC_ID_OVF" caption="Trigger source is TC9 OVF" value="62"/>
        <value name="TC9_DMAC_ID_MC_0" caption="Trigger source is TC9 MC0" value="63"/>
        <value name="TC9_DMAC_ID_MC_1" caption="Trigger source is TC9 MC1" value="64"/>
        <value name="QSPI_DMAC_ID_RX" caption="Trigger source is QSPI RX" value="65"/>
        <value name="QSPI_DMAC_ID_TX" caption="Trigger source is QSPI TX" value="66"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__CMD">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x1"/>
        <value name="RESUME" caption="Channel resume operation" value="0x2"/>
      </value-group>
