zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="DMTPSINTVCLR" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTPSINTVSET" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTPSINTVINV" offset="0x7c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
      </register-group>
    </module>
    <module name="DSCON" id="04824" version="1.0" caption="">
      <register-group name="DSCON" caption="">
        <register name="DSCON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DSSR" caption="" mask="0x1"/>
          <bitfield name="ZPBOR" caption="" mask="0x2"/>
          <bitfield name="RTCCWDIS" caption="" mask="0x100"/>
          <bitfield name="RTCPWREQ" caption="" mask="0x1000"/>
          <bitfield name="XSEMAEN" caption="" mask="0x2000"/>
          <bitfield name="DSEN" caption="" mask="0x8000"/>
        </register>
        <register name="DSWSRC" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ICD" caption="" mask="0x2"/>
          <bitfield name="MCLR" caption="" mask="0x4"/>
          <bitfield name="RTCC" caption="" mask="0x8"/>
          <bitfield name="DSWDT" caption="" mask="0x10"/>
          <bitfield name="EXT" caption="" mask="0x20"/>
          <bitfield name="FAULT" caption="" mask="0x80"/>
          <bitfield name="INT0" caption="" mask="0x100"/>
        </register>
        <register name="DSSEMA1" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DSSEMA" caption="" mask="0xffffffff"/>
        </register>
        <register name="DSXSEMA1" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DSXSEMA" caption="" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="DSU" id="05006" name2="icd_dsu_u2410_v4" version="A" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRL" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="CRC" caption="32-bit Cyclic Redundancy Code" mask="0x4"/>
          <bitfield name="CE" caption="Chip-Erase" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x1" rw="RW" size="1" initval="0x00" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="CRSTEXT" caption="CPU Reset Phase Extension" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="PERR" caption="Protection Error" mask="0x10"/>
        </register>
        <register name="STATUSB" offset="0x2" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="PROT" caption="Protected" mask="0x1"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x2"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x10"/>
        </register>
        <register name="ADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Address">
          <bitfield name="AMOD" caption="Access Mode" mask="0x3"/>
          <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="LENGTH" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Length">
          <bitfield name="LENGTH" caption="Length" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Data">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCC" offset="0x10" rw="RW" size="4" count="2" initval="0x00000000" caption="Debug Communication Channel n">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DID" offset="0x18" rw="R" size="4" initval="0x0001A800" caption="Device Identification">
          <bitfield name="DEVSEL" caption="Device Select" mask="0xFF"/>
          <bitfield name="DIE" caption="Die Number" mask="0xFF00"/>
          <bitfield name="SERIES" caption="Series" mask="0x3F0000"/>
          <bitfield name="FAMILY" caption="Family" mask="0xF800000"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0000000"/>
        </register>
        <register name="CFG" offset="0x1C" rw="RW" size="4" initval="0x00000002" caption="Configuration">
          <bitfield name="LQOS" caption="Latency Quality Of Service" mask="0x3"/>
          <bitfield name="DCCDMALEVEL" caption="DMA Trigger Level" mask="0xC" values="DSU_CFG__DCCDMALEVEL"/>
          <bitfield name="ETBRAMEN" caption="Trace Control" mask="0x10"/>
        </register>
        <register name="UUID" offset="0x38" rw="R" size="4" count="4" initval="0x00000000" caption="Unique Identifier n">
          <bitfield name="UUID" caption="UUID" mask="0xFFFFFFFF"/>
        </register>
        <register name="SECCFG" offset="0x48" rw="R" size="4" initval="0x00000000" caption="Secure Config">
          <bitfield name="SECCFG" caption="Secure Config" mask="0xFFFFFFFF"/>
        </register>
        <register name="CTR_STAT" offset="0x4C" rw="R" size="4" initval="0x00000000" caption="RoT Rollback counter">
          <bitfield name="ROLLBACK_CTR" caption="Rollback counter" mask="0xFF"/>
        </register>
        <register name="BOOT_STAT" offset="0x50" rw="R" size="4" initval="0x00000000" caption="RoT Boot Status">
          <bitfield name="BOOT_STATUS" caption="Boot Status" mask="0xFF"/>
        </register>
        <register name="BOOT_KEY" offset="0x54" rw="R" size="4" count="12" initval="0x00000000" caption="Secure Boot Key n">
          <bitfield name="BOOT_KEY" caption="Secure Boot Key" mask="0xFFFFFFFF"/>
        </register>
        <register name="ENTRY0" offset="0x1000" rw="R" size="4" initval="0x9F0FC002" caption="CoreSight ROM Table Entry 0">
          <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="ENTRY1" offset="0x1004" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Entry 1">
		</register>
        <register name="END" offset="0x1008" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table End">
          <bitfield name="END" caption="End Marker" mask="0xFFFFFFFF"/>
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Memory Type">
          <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 4">
          <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="FKBC" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="Peripheral Identification 0">
          <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x0000009C" caption="Peripheral Identification 1">
          <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
          <bitfield name="JEPIDCL" caption="Low part of the JEP-106 Identity Code" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x0000000A" caption="Peripheral Identification 2">
          <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
          <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="Peripheral Identification 3">
          <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
          <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="Component Identification 0">
          <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
        </register>
