zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="USER" offset="0x120" rw="RW" size="4" count="59" initval="0x00000000" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0x3F"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
      </value-group>
    </module>
    <module name="FREQM" id="U2257" version="1.1.0" caption="Frequency Meter">
      <register-group name="FREQM" caption="Frequency Meter">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B Register">
          <bitfield name="START" caption="Start Measurement" mask="0x1"/>
        </register>
        <register name="CFGA" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Config A register">
          <bitfield name="REFNUM" caption="Number of Reference Clock Cycles" mask="0xFF"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Register">
          <bitfield name="DONE" caption="Measurement Done" mask="0x1"/>
        </register>
        <register name="STATUS" offset="0xB" rw="RW" size="1" initval="0x00" caption="Status Register">
          <bitfield name="BUSY" caption="FREQM Status" mask="0x1"/>
          <bitfield name="OVF" caption="Sticky Count Value Overflow" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Count Value Register">
          <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="FUSES" id="fuses" version="A" caption="Non-Volatile Fuses">
      <register-group name="FUSES_DEVICECFG">
        <register name="FBCFG7" initval="0xFFFFFFFF" offset="0x100" size="4" rw="RW" caption="RESERVED"/>
        <register name="FBCFG6" initval="0xFFFFFFFF" offset="0x104" size="4" rw="RW" caption="RESERVED"/>
        <register name="FUSERID" initval="0x0000FFFF" offset="0x108" size="4" rw="RW" caption="USER Page USERID">
          <bitfield name="USER_ID" caption="User unique ID, readable using the SWD USER_ID instruction" mask="0xffff"/>
        </register>
        <register name="DEVCFG4" initval="0x840e4000" offset="0x10C" size="4" rw="RW" caption="USER Page CFGCON4 Fuses">
          <bitfield name="SOSCCFG" caption="SOSC Configuration" mask="0xff"/>
          <bitfield name="RTCEVENT_SEL" caption="RTC Event Selection" mask="0x300" values="DEVCFG4__RTCEVENT_SEL"/>
          <bitfield name="RTCEVENT_EN" caption="Pad Output Enable for MCHP legacy RTC event output" mask="0x400" values="DEVCFG4__RTCEVENT_EN"/>
          <bitfield name="VBKP_1KCSEL" caption="VDDBUKPCORE LPCLK Clock Selection" mask="0x800" values="DEVCFG4__VBKP_1KCSEL"/>
          <bitfield name="VBKP_32KCSEL" caption="VDDBUKPCORE 32kHz clock source selection" mask="0x3000" values="DEVCFG4__VBKP_32KCSEL"/>
          <bitfield name="VBKP_DIVSEL" caption="VDDBUKPCORE LPCLK Clock Divider Selection" mask="0x4000" values="DEVCFG4__VBKP_DIVSEL"/>
          <bitfield name="LPCLK_MOD" caption="LPCLK modifier in counter/delay mode" mask="0x8000" values="DEVCFG4__LPCLK_MOD"/>
          <bitfield name="RTCEVTYPE" caption="RTC Event Type" mask="0x10000" values="DEVCFG4__RTCEVTYPE"/>
          <bitfield name="CPEN_DLY" caption="Charge-pump ready digital delay" mask="0xe0000" values="DEVCFG4__CPEN_DLY"/>
          <bitfield name="DSZPBOREN" caption="Deep Sleep Zero-Power BOR Enable" mask="0x100000" values="DEVCFG4__DSZPBOREN"/>
          <bitfield name="DSWDTPS" caption="Deep Sleep Watchdog Timer Postscale Select" mask="0x3e00000" values="DEVCFG4__DSWDTPS"/>
          <bitfield name="DSWDTOSC" caption="Deep Sleep Watchdog Timer Reference Clock Select" mask="0x4000000" values="DEVCFG4__DSWDTOSC"/>
          <bitfield name="DSWDTEN" caption="Deep Sleep Watchdog Timer Enable" mask="0x8000000" values="DEVCFG4__DSWDTEN"/>
          <bitfield name="DSEN" caption="Deep Sleep Bit Enable" mask="0x10000000" values="DEVCFG4__DSEN"/>
          <bitfield name="UVREGROVR" caption="ULPVREG Retention Mode Override" mask="0x20000000" values="DEVCFG4__UVREGROVR"/>
          <bitfield name="LPOSCEN" caption="Low Power (Secondary) Oscillator Enable" mask="0x40000000" values="DEVCFG4__LPOSCEN"/>
          <bitfield name="RTCNTM_CSEL" caption="RTC Counter Mode Clock Select" mask="0x80000000" values="DEVCFG4__RTCNTM_CSEL"/>
        </register>
        <register name="DEVCFG2" initval="0x5f74ff38" offset="0x110" size="4" rw="RW" caption="USER Page CFGCON2 Fuses">
          <bitfield name="ACMP_CYCLE" caption="AC Comparator Result Wait Cycles" mask="0x7" values="DEVCFG2__ACMP_CYCLE"/>
          <bitfield name="DMTINTV" caption="Dead Man Timer Count Window Interval" mask="0x38" values="DEVCFG2__DMTINTV"/>
          <bitfield name="PMUTEST_VDD_EN" caption="PMU Test Output or VDD/2 Enable via ADC IE12" mask="0x80" values="DEVCFG2__PMUTEST_VDD_EN"/>
          <bitfield name="POSCMOD" caption="Primary Oscillator Configuration" mask="0x300" values="DEVCFG2__POSCMOD"/>
          <bitfield name="WDTRMCS" caption="WDT RUN Mode Clock Select" mask="0xc00" values="DEVCFG2__WDTRMCS"/>
          <bitfield name="SOSCSEL" caption="SOSC Selection Configuration" mask="0x1000" values="DEVCFG2__SOSCSEL"/>
          <bitfield name="WAKE2SPD" caption="2-Speed startup enabled in Sleep mode" mask="0x2000" values="DEVCFG2__WAKE2SPD"/>
          <bitfield name="CKSWEN" caption="Software Clock Switching Enable" mask="0x4000" values="DEVCFG2__CKSWEN"/>
          <bitfield name="FSCMEN" caption="Fail-Safe Clock Monitor Enable" mask="0x8000" values="DEVCFG2__FSCMEN"/>
          <bitfield name="WDTPSR" caption="Watchdog Timer Post-scale Select Run" mask="0x1f0000" values="DEVCFG2__WDTPSR"/>
          <bitfield name="WDTSPGM" caption="Watchdog Timer Stop during Flash Programming" mask="0x200000" values="DEVCFG2__WDTSPGM"/>
          <bitfield name="WINDIS" caption="Windowed Watchdog Timer Disable" mask="0x400000" values="DEVCFG2__WINDIS"/>
          <bitfield name="WDTEN" caption="Watchdog Timer Enable" mask="0x800000" values="DEVCFG2__WDTEN"/>
          <bitfield name="WDTWINSZ" caption="Watchdog Timer Window Size" mask="0x3000000" values="DEVCFG2__WDTWINSZ"/>
          <bitfield name="DMTCNT" caption="Dead Man Timer Count Select" mask="0x7c000000" values="DEVCFG2__DMTCNT"/>
          <bitfield name="DMTEN" caption="Dead Man Timer Enable" mask="0x80000000" values="DEVCFG2__DMTEN"/>
        </register>
        <register name="DEVCFG1" initval="0x1400403b" offset="0x114" size="4" rw="RW" caption="USER Page CFGCON1 Fuses">
          <bitfield name="CAN0_PIN_EN" caption="CAN0 Pin Enable" mask="0x04"/>
          <bitfield name="TRCEN" caption="Trace Enable" mask="0x20" values="DEVCFG1__TRCEN"/>
          <bitfield name="CCL_OE" caption="CCL Pads (via PPS) Output Enable" mask="0x40" values="DEVCFG1__CCL_OE"/>
          <bitfield name="ZBTWKSYS" caption="ZBT Subsystem External Wake-up source" mask="0x80" values="DEVCFG1__ZBTWKSYS"/>
          <bitfield name="CMP0_OE" caption="Analog Comparator-0 Output Enable" mask="0x100" values="DEVCFG1__CMP0_OE"/>
          <bitfield name="CMP1_OE" caption="Analog Comparator-1 Output Enable" mask="0x200" values="DEVCFG1__CMP1_OE"/>
          <bitfield name="QSPI_HSEN" caption="QSPI (Direct) Enable" mask="0x400" values="DEVCFG1__QSPI_HSEN"/>
          <bitfield name="SCOM0_HSEN" caption="SERCOM0 Direct (High Speed) Pin Enable" mask="0x800" values="DEVCFG1__SCOM0_HSEN"/>
          <bitfield name="SCOM1_HSEN" caption="SERCOM1 Direct (High Speed) Pin Enable" mask="0x1000" values="DEVCFG1__SCOM1_HSEN"/>
          <bitfield name="SCOM2_HSEN" caption="SERCOM2 Direct (High Speed) Pin Enable" mask="0x2000" values="DEVCFG1__SCOM2_HSEN"/>
          <bitfield name="SMCLR" caption="Selects CRU handling of MCLR Control" mask="0x4000" values="DEVCFG1__SMCLR"/>
          <bitfield name="QSCHE_EN" caption="QSPI Address Space Cache Attribute" mask="0x8000" values="DEVCFG1__QSCHE_EN"/>
          <bitfield name="USBDMFTRIM" caption="USB DM Fall Trim fuse bits" mask="0x30000" values="DEVCFG1__USBDMFTRIM"/>
          <bitfield name="USBDMRTRIM" caption="USB DM Rise Trim fuse bits" mask="0xC0000" values="DEVCFG1__USBDMRTRIM"/>
          <bitfield name="USBDPFTRIM" caption="USB DP Fall Trim fuse bits" mask="0x300000" values="DEVCFG1__USBDPFTRIM"/>
          <bitfield name="USBDPRTRIM" caption="USB DP Rise Trim fuse bits" mask="0xC00000" values="DEVCFG1__USBDPRTRIM"/>
          <bitfield name="WDTPSS" caption="Watchdog Timer Post-scale Select Sleep" mask="0x1f000000" values="DEVCFG1__WDTPSS"/>
          <bitfield name="QSPIDDRM" caption="QSPI DDR Mode Clock Enable" mask="0x20000000" values="DEVCFG1__QSPIDDRM"/>
          <bitfield name="CLKZBREF" caption="External Reference Clock ZB Enable" mask="0x40000000" values="DEVCFG1__CLKZBREF"/>
          <bitfield name="CAN1_PIN_EN" caption="CAN1 Pin Enable" mask="0x80000000"/>
        </register>
        <register name="DEVCFG0" initval="0x7960000b" offset="0x118" size="4" rw="RW" caption="USER Page CFGCON0 Fuses">
          <bitfield name="SWOEN" caption="SWO enable on 2-wire debug interface" mask="0x2" values="DEVCFG0__SWOEN"/>
          <bitfield name="TROEN" caption="Trace Output Enable" mask="0x4" values="DEVCFG0__TROEN"/>
          <bitfield name="ADCPOVR" caption="ADC Charge Pump Override" mask="0x10" values="DEVCFG0__ADCPOVR"/>
          <bitfield name="CPENFILT" caption="ADC CP Filter Enable" mask="0x80" values="DEVCFG0__CPENFILT"/>
          <bitfield name="RTCIN0_ALTEN" caption="RTCIN0 Alternate Enable" mask="0x100" values="DEVCFG0__RTCIN0_ALTEN"/>
          <bitfield name="RTCOUT_ALTEN" caption="RTCOUT Alternate Enable" mask="0x200" values="DEVCFG0__RTCOUT_ALTEN"/>
          <bitfield name="USBSSEN" caption="USB Suspend Sleep Enable" mask="0x20000"/>
          <bitfield name="EPLLHWMD" caption="EWPLL HW Control Mode for PWDN and RESET" mask="0x40000" values="DEVCFG0__EPLLHWMD"/>
          <bitfield name="UPLLHWMD" caption="UWPLL HW Control Mode for PWDN and RESET" mask="0x80000" values="DEVCFG0__UPLLHWMD"/>
          <bitfield name="HPLUGDIS" caption="Hot Plugging Disable" mask="0x100000" values="DEVCFG0__HPLUGDIS"/>
          <bitfield name="USBIDIO" caption="USB USBID Selection bit" mask="0x200000"/>
          <bitfield name="VBUSONIO" caption="USB VBUS_ON Selection bit" mask="0x400000"/>
          <bitfield name="SMBUS3EN2" caption="SMBus3 Enable for SERCOM2" mask="0x800000"/>
          <bitfield name="PCM" caption="PCHE I/D Cacheable Mode" mask="0x1000000" values="DEVCFG0__PCM"/>
          <bitfield name="INT0E" caption="INT0 Enable" mask="0x2000000" values="DEVCFG0__INT0E"/>
          <bitfield name="INT0P" caption="INT0P Polarity" mask="0x4000000" values="DEVCFG0__INT0P"/>
          <bitfield name="CMEN" caption="SPA/DPA Countermeasures Enable" mask="0x8000000"/>
          <bitfield name="FECCCON" caption="Flash ECC Control" mask="0x30000000" values="DEVCFG0__FECCCON"/>
          <bitfield name="FRECCDIS" caption="Flex RAM ECC Control" mask="0x40000000" values="DEVCFG0__FRECCDIS"/>
        </register>
        <register name="FBCFG0" initval="0x00000000" offset="0x11C" size="4" rw="RW" caption="NVR BCFG User Configuration Area">
          <bitfield name="BINFOVALID" caption="BCFG info valid" mask="0x80000000" values="FBCFG0__BINFOVALID"/>
          <bitfield name="PCSCMODE" caption="PCache Single cache Mode" mask="0x00000002" values="FBCFG0__PCSCMODE"/>
        </register>
        <register name="FCPN3" initval="0xFFFFFFFF" offset="0x130" size="4" rw="RW" caption="RESERVED"/>
        <register name="FCPN2" initval="0xFFFFFFFF" offset="0x134" size="4" rw="RW" caption="RESERVED"/>
