zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="CNCONSET" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNCONINV" offset="0x7C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNEN" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNIE0" caption="" mask="0x1"/>
          <bitfield name="CNIE1" caption="" mask="0x2"/>
          <bitfield name="CNIE2" caption="" mask="0x4"/>
          <bitfield name="CNIE3" caption="" mask="0x8"/>
          <bitfield name="CNIE4" caption="" mask="0x10"/>
          <bitfield name="CNIE5" caption="" mask="0x20"/>
          <bitfield name="CNIE6" caption="" mask="0x40"/>
          <bitfield name="CNIE7" caption="" mask="0x80"/>
          <bitfield name="CNIE8" caption="" mask="0x100"/>
          <bitfield name="CNIE9" caption="" mask="0x200"/>
          <bitfield name="CNIE10" caption="" mask="0x400"/>
          <bitfield name="CNIE11" caption="" mask="0x800"/>
          <bitfield name="CNIE12" caption="" mask="0x1000"/>
          <bitfield name="CNIE13" caption="" mask="0x2000"/>
          <bitfield name="CNIE14" caption="" mask="0x4000"/>
          <bitfield name="CNIE15" caption="" mask="0x8000"/>
        </register>
        <register name="CNENCLR" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNENSET" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNENINV" offset="0x8C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNSTAT" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNSTAT0" caption="" mask="0x1"/>
          <bitfield name="CNSTAT1" caption="" mask="0x2"/>
          <bitfield name="CNSTAT2" caption="" mask="0x4"/>
          <bitfield name="CNSTAT3" caption="" mask="0x8"/>
          <bitfield name="CNSTAT4" caption="" mask="0x10"/>
          <bitfield name="CNSTAT5" caption="" mask="0x20"/>
          <bitfield name="CNSTAT6" caption="" mask="0x40"/>
          <bitfield name="CNSTAT7" caption="" mask="0x80"/>
          <bitfield name="CNSTAT8" caption="" mask="0x100"/>
          <bitfield name="CNSTAT9" caption="" mask="0x200"/>
          <bitfield name="CNSTAT10" caption="" mask="0x400"/>
          <bitfield name="CNSTAT11" caption="" mask="0x800"/>
          <bitfield name="CNSTAT12" caption="" mask="0x1000"/>
          <bitfield name="CNSTAT13" caption="" mask="0x2000"/>
          <bitfield name="CNSTAT14" caption="" mask="0x4000"/>
          <bitfield name="CNSTAT15" caption="" mask="0x8000"/>
        </register>
        <register name="CNSTATCLR" offset="0x94" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNSTATSET" offset="0x98" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNSTATINV" offset="0x9C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNNE" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNNE0" caption="" mask="0x1"/>
          <bitfield name="CNNE1" caption="" mask="0x2"/>
          <bitfield name="CNNE2" caption="" mask="0x4"/>
          <bitfield name="CNNE3" caption="" mask="0x8"/>
          <bitfield name="CNNE4" caption="" mask="0x10"/>
          <bitfield name="CNNE5" caption="" mask="0x20"/>
          <bitfield name="CNNE6" caption="" mask="0x40"/>
          <bitfield name="CNNE7" caption="" mask="0x80"/>
          <bitfield name="CNNE8" caption="" mask="0x100"/>
          <bitfield name="CNNE9" caption="" mask="0x200"/>
          <bitfield name="CNNE10" caption="" mask="0x400"/>
          <bitfield name="CNNE11" caption="" mask="0x800"/>
          <bitfield name="CNNE12" caption="" mask="0x1000"/>
          <bitfield name="CNNE13" caption="" mask="0x2000"/>
          <bitfield name="CNNE14" caption="" mask="0x4000"/>
          <bitfield name="CNNE15" caption="" mask="0x8000"/>
        </register>
        <register name="CNNECLR" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNNESET" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNNEINV" offset="0xaC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNF" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNF0" caption="" mask="0x1"/>
          <bitfield name="CNF1" caption="" mask="0x2"/>
          <bitfield name="CNF2" caption="" mask="0x4"/>
          <bitfield name="CNF3" caption="" mask="0x8"/>
          <bitfield name="CNF4" caption="" mask="0x10"/>
          <bitfield name="CNF5" caption="" mask="0x20"/>
          <bitfield name="CNF6" caption="" mask="0x40"/>
          <bitfield name="CNF7" caption="" mask="0x80"/>
          <bitfield name="CNF8" caption="" mask="0x100"/>
          <bitfield name="CNF9" caption="" mask="0x200"/>
          <bitfield name="CNF10" caption="" mask="0x400"/>
          <bitfield name="CNF11" caption="" mask="0x800"/>
          <bitfield name="CNF12" caption="" mask="0x1000"/>
          <bitfield name="CNF13" caption="" mask="0x2000"/>
          <bitfield name="CNF14" caption="" mask="0x4000"/>
          <bitfield name="CNF15" caption="" mask="0x8000"/>
        </register>
        <register name="CNFCLR" offset="0xb4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNFSET" offset="0xb8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNFINV" offset="0xbC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON0" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SR00" caption="" mask="0x1"/>
          <bitfield name="SR01" caption="" mask="0x2"/>
          <bitfield name="SR02" caption="" mask="0x4"/>
          <bitfield name="SR03" caption="" mask="0x8"/>
          <bitfield name="SR04" caption="" mask="0x10"/>
          <bitfield name="SR05" caption="" mask="0x20"/>
          <bitfield name="SR06" caption="" mask="0x40"/>
          <bitfield name="SR07" caption="" mask="0x80"/>
          <bitfield name="SR08" caption="" mask="0x100"/>
          <bitfield name="SR09" caption="" mask="0x200"/>
          <bitfield name="SR010" caption="" mask="0x400"/>
          <bitfield name="SR011" caption="" mask="0x800"/>
          <bitfield name="SR012" caption="" mask="0x1000"/>
          <bitfield name="SR013" caption="" mask="0x2000"/>
          <bitfield name="SR014" caption="" mask="0x4000"/>
          <bitfield name="SR015" caption="" mask="0x8000"/>
        </register>
