zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="Bridge interrupt flag status">
          <bitfield name="SRAM0_" caption="SRAM0" mask="0x1"/>
          <bitfield name="SRAM1_" caption="SRAM1" mask="0x2"/>
          <bitfield name="SRAM2_" caption="SRAM2" mask="0x4"/>
          <bitfield name="SRAM3_" caption="SRAM3" mask="0x8"/>
          <bitfield name="CFLASH_" caption="CFLASH" mask="0x10"/>
          <bitfield name="PFLASH_" caption="PFLASH" mask="0x20"/>
          <bitfield name="HPBA_" caption="HPBA" mask="0x40"/>
          <bitfield name="HPBB_" caption="HPBB" mask="0x80"/>
          <bitfield name="HPBC_" caption="HPBC" mask="0x100"/>
          <bitfield name="HPBPIC_" caption="HPBPIC0" mask="0x200"/>
          <bitfield name="QSPI_" caption="QSPI" mask="0x400"/>
          <bitfield name="ROT_" caption="ROT" mask="0x800"/>
          <bitfield name="CRYPTO_" caption="CRYPTO" mask="0x1000"/>
          <bitfield name="PBDB_" caption="PBDB" mask="0x2000"/>
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="FREQM_" caption="FREQM" mask="0x2"/>
          <bitfield name="EIC_" caption="EIC" mask="0x4"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x8"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x10"/>
          <bitfield name="TC0_" caption="TC0" mask="0x20"/>
          <bitfield name="TC1_" caption="TC1" mask="0x40"/>
          <bitfield name="TC2_" caption="TC2" mask="0x80"/>
          <bitfield name="TC3_" caption="TC3" mask="0x100"/>
          <bitfield name="TC4_" caption="TC4" mask="0x200"/>
          <bitfield name="TC5_" caption="TC5" mask="0x400"/>
          <bitfield name="TC6_" caption="TC6" mask="0x800"/>
          <bitfield name="TC7_" caption="TC7" mask="0x1000"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x2000"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x4000"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x8000"/>
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="DSU_" caption="DSU" mask="0x1"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x4"/>
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x8"/>
          <bitfield name="RAMECC_" caption="RAMECC" mask="0x10"/>
          <bitfield name="ETH_" caption="ETH" mask="0x20"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="QSPI_" caption="QSPI" mask="0x1"/>
          <bitfield name="SERCOM6_" caption="SERCOM6" mask="0x2"/>
          <bitfield name="CCL_" caption="CCL" mask="0x40"/>
          <bitfield name="AC_" caption="AC" mask="0x80"/>
          <bitfield name="HMTX_" caption="HMTX" mask="0x200"/>
        </register>
        <register name="INTFLAGD" offset="0x20" rw="RW" size="4" atomic-op="clear:INTFLAGD" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge D">
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x1"/>
          <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x2"/>
          <bitfield name="SERCOM4_" caption="SERCOM4" mask="0x4"/>
          <bitfield name="SERCOM5_" caption="SERCOM5" mask="0x8"/>
          <bitfield name="TC8_" caption="TC8" mask="0x10"/>
          <bitfield name="TC9_" caption="TC9" mask="0x20"/>
          <bitfield name="CAN0_" caption="CAN0" mask="0x100"/>
          <bitfield name="CAN1_" caption="CAN1" mask="0x200"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x2"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x8"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x10"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x20"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x40"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x80"/>
          <bitfield name="TC3_" caption="TC3 APB Protect Enable" mask="0x100"/>
          <bitfield name="TC4_" caption="TC4 APB Protect Enable" mask="0x200"/>
          <bitfield name="TC5_" caption="TC5 APB Protect Enable" mask="0x400"/>
          <bitfield name="TC6_" caption="TC6 APB Protect Enable" mask="0x800"/>
          <bitfield name="TC7_" caption="TC7 APB Protect Enable" mask="0x1000"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x2000"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x4000"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x8000"/>
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge B">
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x1"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x4"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x8"/>
          <bitfield name="RAMECC_" caption="RAMECC APB Protect Enable" mask="0x10"/>
          <bitfield name="ETH_" caption="ETH APB Protect Enable" mask="0x20"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="QSPI_" caption="QSPI APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM6_" caption="SERCOM6 APB Protect Enable" mask="0x2"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x40"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x80"/>
          <bitfield name="HMTX_" caption="HMTX Protect Enable" mask="0x200"/>
        </register>
        <register name="STATUSD" offset="0x40" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge D">
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Protect Enable" mask="0x8"/>
          <bitfield name="TC8_" caption="TC8 APB Protect Enable" mask="0x10"/>
          <bitfield name="TC9_" caption="TC9 APB Protect Enable" mask="0x20"/>
          <bitfield name="CAN0_" caption="CAN0 APB Protect Enable" mask="0x100"/>
          <bitfield name="CAN1_" caption="CAN1 APB Protect Enable" mask="0x200"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PCHE" id="03088" version="1.0" caption="this is the PCHE">
      <register-group name="PCHE" caption="this is the PCHE">
        <register name="CHECON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x0700010F" caption="">
          <bitfield name="PFMWS" caption="" mask="0xf"/>
          <bitfield name="PREFEN" caption="" mask="0x30"/>
          <bitfield name="PFMSECEN" caption="" mask="0x80"/>
          <bitfield name="ADRWS" caption="" mask="0x100"/>
          <bitfield name="CHEPERF" caption="" mask="0x1000"/>
          <bitfield name="ICHECOH" caption="" mask="0x10000"/>
          <bitfield name="DCHECOH" caption="" mask="0x20000"/>
          <bitfield name="ACHECOH" caption="" mask="0x40000"/>
          <bitfield name="ICHEINV" caption="" mask="0x100000"/>
          <bitfield name="DCHEINV" caption="" mask="0x200000"/>
          <bitfield name="ACHEINV" caption="" mask="0x400000"/>
          <bitfield name="ICHEEN" caption="" mask="0x1000000"/>
          <bitfield name="DCHEEN" caption="" mask="0x2000000"/>
          <bitfield name="ACHEEN" caption="" mask="0x4000000"/>
        </register>
        <register name="CHECONCLR" offset="0x04" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHECONSET" offset="0x08" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHECONINV" offset="0x0C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CHESTAT" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PFMSECCNT" caption="" mask="0xff"/>
          <bitfield name="PFMSEC" caption="" mask="0x4000000"/>
          <bitfield name="PFMDED" caption="" mask="0x8000000"/>
        </register>
        <register name="CHESTATCLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
