zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="OVERCTRL" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x80400000" caption="">
          <bitfield name="VREG4OCTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3OCTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2OCTRL" caption="" mask="0x1f0000"/>
          <bitfield name="PHWC" caption="" mask="0x400000"/>
          <bitfield name="OVEREN" caption="" mask="0x800000"/>
          <bitfield name="VREG1OCTRL" caption="" mask="0x1f000000"/>
          <bitfield name="OBUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="OMLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="OBUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="PMUCMODE" offset="0x20" rw="RW" size="4" access-size="4" initval="0x40000040" caption="">
          <bitfield name="CVREG4OCTRL" caption="" mask="0x1f"/>
          <bitfield name="SUPFSM" caption="" mask="0xE0"/>
          <bitfield name="CVREG3OCTRL" caption="" mask="0x1f00"/>
          <bitfield name="CVREG2OCTRL" caption="" mask="0x1f0000"/>
          <bitfield name="ADCBOR" caption="" mask="0x200000"/>
          <bitfield name="BUCKBOR" caption="" mask="0x400000"/>
          <bitfield name="MLDOEXTBOR" caption="" mask="0x800000"/>
          <bitfield name="CVREG1OCTRL" caption="" mask="0x1f000000"/>
          <bitfield name="CBUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="CMLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="CBUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="PMUSTATUS" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PMUSTATUS" caption="" mask="0x1f"/>
          <bitfield name="WCMRM" caption="" mask="0x20"/>
          <bitfield name="PMUANA_BUCKBOR" caption="" mask="0x40"/>
          <bitfield name="BSSEDATA" caption="" mask="0xffff00"/>
          <bitfield name="BSSENUM" caption="" mask="0x7f000000"/>
          <bitfield name="BSSERR" caption="" mask="0x80000000"/>
        </register>
        <register name="PMUSEQ1" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUSEQ2" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUSEQ3" offset="0x30" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUSEQ4" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DELAY" caption="" mask="0x3f"/>
          <bitfield name="CMPBVAL" caption="" mask="0x40"/>
          <bitfield name="CMD" caption="" mask="0x80"/>
          <bitfield name="SPIRADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="PMUCFG" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="BUCK_SW_DELAY" caption="" mask="0x7f"/>
          <bitfield name="MLDO_SW_DELAY" caption="" mask="0x3f80"/>
          <bitfield name="MLDOEXT_L" caption="" mask="0xc000"/>
          <bitfield name="BUCK_CP_L" caption="" mask="0xf0000"/>
          <bitfield name="BUCK_CP_H" caption="" mask="0xf00000"/>
          <bitfield name="ADC_CP_L" caption="" mask="0xf000000"/>
          <bitfield name="ADC_CP_H" caption="" mask="0xf0000000"/>
        </register>
        <register name="PMU_VBCCMD" offset="0x48" rw="RW" size="4" access-size="4" initval="0x10000000" caption="">
          <bitfield name="VBCADDR" caption="" mask="0xffff"/>
          <bitfield name="VBCRDY" caption="" mask="0x10000000"/>
          <bitfield name="CMD" caption="" mask="0x40000000"/>
        </register>
        <register name="PMU_VBCWDATA" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VBCWDATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="PMU_VBCRDATA" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VBCRDATA" caption="" mask="0xffffffff"/>
        </register>
        <register name="WCMCFG" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00001100" caption="">
          <bitfield name="SRAM1_CFG" caption="" mask="0x700"/>
          <bitfield name="SRAM2_CFG" caption="" mask="0x7000"/>
        </register>
        <register name="PMUIENB" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCBORIEN" caption="" mask="0x1"/>
          <bitfield name="BUCKBORIEN" caption="" mask="0x2"/>
          <bitfield name="SCMPIEN" caption="" mask="0x4"/>
          <bitfield name="WCMIAIEN" caption="" mask="0x8"/>
          <bitfield name="VBCIAIEN" caption="" mask="0x10"/>
        </register>
        <register name="PMUISTAT" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ADCBORINT" caption="" mask="0x1"/>
          <bitfield name="BUCKBORINT" caption="" mask="0x2"/>
          <bitfield name="SCMPINT" caption="" mask="0x4"/>
          <bitfield name="WCMIAINT" caption="" mask="0x8"/>
          <bitfield name="VBCIAINT" caption="" mask="0x10"/>
        </register>
        <register name="WCMSIZ" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SRAM1_SIZ" caption="" mask="0x300" values="DSSIZESEL"/>
        </register>
      </register-group>
