zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
      <value-group name="DSSIZESEL">
        <value name="NO_SRAM_RETENTION" caption="FlexRAM is completely powered OFF in deep sleep" value="0x0"/>
        <value name="16K_SRAM" caption="16K Flex RAM available in retention" value="0x1"/>
        <value name="32K_SRAM" caption="32K Flex RAM available in retention" value="0x2"/>
        <value name="64K_SRAM" caption="64K Flex RAM available in retention" value="0x3"/>
      </value-group>
    </module>
    <!-- THIS IS FOR 132-PIN DEVICE ONLY -->
    <module name="PPS" id="U1132" version="1.0" caption="PPS">
      <register-group name="PPS" caption="PPS">
        <!-- Next lines are INPUT function pin mappings -->
        <register name="EXTINT0R" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT0" caption="EXTINT0" mask="0x1f" values="EXTINT0_PINS"/>
        </register>
        <register name="EXTINT1R" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT1" caption="EXTINT1" mask="0x1f" values="EXTINT1_PINS"/>
        </register>
        <register name="EXTINT2R" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT2" caption="EXTINT2" mask="0x1f" values="EXTINT2_PINS"/>
        </register>
        <register name="EXTINT3R" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT3" caption="EXTINT3" mask="0x1f" values="EXTINT3_PINS"/>
        </register>
        <register name="NMIR" offset="0x3c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NMI" caption="NMI" mask="0x1f" values="NMI_PINS"/>
        </register>
        <register name="SCOM0P0R" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P0" caption="SERCOM0/PAD0" mask="0x1f" values="SCOM0P0_PINS"/>
        </register>
        <register name="SCOM0P1R" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P1" caption="SERCOM0/PAD1" mask="0x1f" values="SCOM0P1_PINS"/>
        </register>
        <register name="SCOM0P2R" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P2" caption="SERCOM0/PAD2" mask="0x1f" values="SCOM0P2_PINS"/>
        </register>
        <register name="SCOM0P3R" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P3" caption="SERCOM0/PAD3" mask="0x1f" values="SCOM0P3_PINS"/>
        </register>
        <register name="SCOM1P0R" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P0" caption="SERCOM1/PAD0" mask="0x1f" values="SCOM1P0_PINS"/>
        </register>
        <register name="SCOM1P1R" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P1" caption="SERCOM1/PAD1" mask="0x1f" values="SCOM1P1_PINS"/>
        </register>
        <register name="SCOM1P2R" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P2" caption="SERCOM1/PAD2" mask="0x1f" values="SCOM1P2_PINS"/>
        </register>
        <register name="SCOM1P3R" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P3" caption="SERCOM1/PAD3" mask="0x1f" values="SCOM1P3_PINS"/>
        </register>
        <register name="SCOM2P0R" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM2P0" caption="SERCOM2/PAD0" mask="0x1f" values="SCOM2P0_PINS"/>
        </register>
        <register name="SCOM2P1R" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM2P1" caption="SERCOM2/PAD1" mask="0x1f" values="SCOM2P1_PINS"/>
        </register>
        <register name="SCOM2P2R" offset="0x68" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM2P2" caption="SERCOM2/PAD2" mask="0x1f" values="SCOM2P2_PINS"/>
        </register>
        <register name="SCOM2P3R" offset="0x6c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM2P3" caption="SERCOM2/PAD3" mask="0x1f" values="SCOM2P3_PINS"/>
        </register>
        <register name="SCOM3P0R" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM3P0" caption="SERCOM3/PAD0" mask="0x1f" values="SCOM3P0_PINS"/>
        </register>
        <register name="SCOM3P1R" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM3P1" caption="SERCOM3/PAD1" mask="0x1f" values="SCOM3P1_PINS"/>
        </register>
        <register name="SCOM3P2R" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM3P2" caption="SERCOM3/PAD2" mask="0x1f" values="SCOM3P2_PINS"/>
        </register>
        <register name="SCOM3P3R" offset="0x7c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM3P3" caption="SERCOM3/PAD3" mask="0x1f" values="SCOM3P3_PINS"/>
        </register>
        <register name="SCOM4P0R" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM4P0" caption="SERCOM4/PAD0" mask="0x1f" values="SCOM4P0_PINS"/>
        </register>
        <register name="SCOM4P1R" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM4P1" caption="SERCOM4/PAD1" mask="0x1f" values="SCOM4P1_PINS"/>
        </register>
        <register name="SCOM4P2R" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM4P2" caption="SERCOM4/PAD2" mask="0x1f" values="SCOM4P2_PINS"/>
        </register>
