zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="SCOM4P3R" offset="0x8c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM4P3" caption="SERCOM4/PAD3" mask="0x1f" values="SCOM4P3_PINS"/>
        </register>
        <register name="SCOM5P0R" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM5P0" caption="SERCOM5/PAD0" mask="0x1f" values="SCOM5P0_PINS"/>
        </register>
        <register name="SCOM5P1R" offset="0x94" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM5P1" caption="SERCOM5/PAD1" mask="0x1f" values="SCOM5P1_PINS"/>
        </register>
        <register name="SCOM5P2R" offset="0x98" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM5P2" caption="SERCOM5/PAD2" mask="0x1f" values="SCOM5P2_PINS"/>
        </register>
        <register name="SCOM5P3R" offset="0x9c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM5P3" caption="SERCOM5/PAD3" mask="0x1f" values="SCOM5P3_PINS"/>
        </register>
        <register name="QD0R" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD0" caption="QD0" mask="0x1f" values="QD0_PINS"/>
        </register>
        <register name="QD1R" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD1" caption="QD1" mask="0x1f" values="QD1_PINS"/>
        </register>
        <register name="QD2R" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD2" caption="QD2" mask="0x1f" values="QD2_PINS"/>
        </register>
        <register name="QD3R" offset="0xac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD3" caption="QD3" mask="0x1f" values="QD3_PINS"/>
        </register>
        <register name="REFIR" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="REFI" caption="REFI" mask="0x1f" values="REFI_PINS"/>
        </register>
        <register name="CCLIN0R" offset="0xb4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN0" caption="CCL/IN0" mask="0x1f" values="CCLIN0_PINS"/>
        </register>
        <register name="CCLIN1R" offset="0xb8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN1" caption="CCL/IN1" mask="0x1f" values="CCLIN1_PINS"/>
        </register>
        <register name="CCLIN2R" offset="0xbc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN2" caption="CCL/IN2" mask="0x1f" values="CCLIN2_PINS"/>
        </register>
        <register name="CCLIN3R" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN3" caption="CCL/IN3" mask="0x1f" values="CCLIN3_PINS"/>
        </register>
        <register name="CCLIN4R" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN4" caption="CCL/IN4" mask="0x1f" values="CCLIN4_PINS"/>
        </register>
        <register name="CCLIN5R" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN5" caption="CCL/IN5" mask="0x1f" values="CCLIN5_PINS"/>
        </register>
        <register name="TC0WO0G1R" offset="0xcc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0G1" caption="TC0/WO0G1" mask="0x1f" values="TC0WO0G1_PINS"/>
        </register>
        <register name="TC0WO0G2R" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0G2" caption="TC0/WO0G2" mask="0x1f" values="TC0WO0G2_PINS"/>
        </register>
        <register name="TC0WO1G3R" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1G3" caption="TC0/WO1G3" mask="0x1f" values="TC0WO1G3_PINS"/>
        </register>
        <register name="TC0WO1G4R" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1G4" caption="TC0/WO1G4" mask="0x1f" values="TC0WO1G4_PINS"/>
        </register>
        <register name="TC1WO0G1R" offset="0xdc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO0G1" caption="TC1/WO0G1" mask="0x1f" values="TC1WO0G1_PINS"/>
        </register>
        <register name="TC1WO1G2R" offset="0xe4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO1G2" caption="TC1/WO1G2" mask="0x1f" values="TC1WO1G2_PINS"/>
        </register>
        <register name="TC2WO0G1R" offset="0xec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0G1" caption="TC2/WO0G1" mask="0x1f" values="TC2WO0G1_PINS"/>
        </register>
        <register name="TC2WO0G3R" offset="0xf0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0G3" caption="TC2/WO0G3" mask="0x1f" values="TC2WO0G3_PINS"/>
        </register>
        <register name="TC2WO1G2R" offset="0xf4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1G2" caption="TC2/WO1G2" mask="0x1f" values="TC2WO1G2_PINS"/>
        </register>
        <register name="TC2WO1G4R" offset="0xf8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1G4" caption="TC2/WO1G4" mask="0x1f" values="TC2WO1G4_PINS"/>
        </register>
        <register name="TC3WO0G1R" offset="0xfc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0G1" caption="TC3/WO0G1" mask="0x1f" values="TC3WO0G1_PINS"/>
        </register>
        <register name="TC3WO0G3R" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0G3" caption="TC3/WO0G3" mask="0x1f" values="TC3WO0G3_PINS"/>
        </register>
        <register name="TC3WO1G2R" offset="0x104" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1G2" caption="TC3/WO1G2" mask="0x1f" values="TC3WO1G2_PINS"/>
        </register>
        <register name="TC3WO1G4R" offset="0x108" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1G4" caption="TC3/WO1G4" mask="0x1f" values="TC3WO1G4_PINS"/>
        </register>
