zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="TC4WO0G1R" offset="0x10c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO0G1" caption="TC4/WO0G1" mask="0x1f" values="TC4WO0G1_PINS"/>
        </register>
        <register name="TC4WO0G3R" offset="0x110" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO0G3" caption="TC4/WO0G3" mask="0x1f" values="TC4WO0G3_PINS"/>
        </register>
        <register name="TC4WO1G2R" offset="0x114" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO1G2" caption="TC4/WO1G2" mask="0x1f" values="TC4WO1G2_PINS"/>
        </register>
        <register name="TC4WO1G4R" offset="0x118" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO1G4" caption="TC4/WO1G4" mask="0x1f" values="TC4WO1G4_PINS"/>
        </register>
        <register name="TC5WO0G1R" offset="0x11c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO0G1" caption="TC5/WO0G1" mask="0x1f" values="TC5WO0G1_PINS"/>
        </register>
        <register name="TC5WO0G3R" offset="0x120" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO0G3" caption="TC5/WO0G3" mask="0x1f" values="TC5WO0G3_PINS"/>
        </register>
        <register name="TC5WO1G2R" offset="0x124" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO1G2" caption="TC5/WO1G2" mask="0x1f" values="TC5WO1G2_PINS"/>
        </register>
        <register name="TC5WO1G4R" offset="0x128" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO1G4" caption="TC5/WO1G4" mask="0x1f" values="TC5WO1G4_PINS"/>
        </register>
        <register name="TC6WO0G1R" offset="0x12c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO0G1" caption="TC6/WO0G1" mask="0x1f" values="TC6WO0G1_PINS"/>
        </register>
        <register name="TC6WO0G3R" offset="0x130" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO0G3" caption="TC6/WO0G3" mask="0x1f" values="TC6WO0G3_PINS"/>
        </register>
        <register name="TC6WO1G2R" offset="0x134" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO1G2" caption="TC6/WO1G2" mask="0x1f" values="TC6WO1G2_PINS"/>
        </register>
        <register name="TC6WO1G4R" offset="0x138" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO1G4" caption="TC6/WO1G4" mask="0x1f" values="TC6WO1G4_PINS"/>
        </register>
        <register name="TC7WO0G1R" offset="0x13c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO0G1" caption="TC7/WO0G1" mask="0x1f" values="TC7WO0G1_PINS"/>
        </register>
        <register name="TC7WO0G3R" offset="0x140" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO0G3" caption="TC7/WO0G3" mask="0x1f" values="TC7WO0G3_PINS"/>
        </register>
        <register name="TC7WO1G2R" offset="0x144" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO1G2" caption="TC7/WO1G2" mask="0x1f" values="TC7WO1G2_PINS"/>
        </register>
        <register name="TC7WO1G4R" offset="0x148" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO1G4" caption="TC7/WO1G4" mask="0x1f" values="TC7WO1G4_PINS"/>
        </register>
        <register name="TC8WO0G1R" offset="0x14c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC8WO0G1" caption="TC8/WO0G1" mask="0x1f" values="TC8WO0G1_PINS"/>
        </register>
        <register name="TC8WO0G3R" offset="0x150" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC8WO0G3" caption="TC8/WO0G3" mask="0x1f" values="TC8WO0G3_PINS"/>
        </register>
        <register name="TC8WO1G2R" offset="0x154" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC8WO1G2" caption="TC8/WO1G2" mask="0x1f" values="TC8WO1G2_PINS"/>
        </register>
        <register name="TC8WO1G5R" offset="0x158" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC8WO1G5" caption="TC8/WO1G5" mask="0x1f" values="TC8WO1G5_PINS"/>
        </register>
        <register name="TC9WO0G2R" offset="0x15c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC9WO0G2" caption="TC9/WO0G2" mask="0x1f" values="TC9WO0G2_PINS"/>
        </register>
        <register name="TC9WO0G4R" offset="0x160" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC9WO0G4" caption="TC9/WO0G4" mask="0x1f" values="TC9WO0G4_PINS"/>
        </register>
        <register name="TC9WO1G3R" offset="0x164" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC9WO1G3" caption="TC9/WO1G3" mask="0x1f" values="TC9WO1G3_PINS"/>
        </register>
        <register name="TC9WO1G5R" offset="0x168" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC9WO1G5" caption="TC9/WO1G5" mask="0x1f" values="TC9WO1G5_PINS"/>
        </register>
        <register name="QEIHOME0G1R" offset="0x16c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIHOME0G1" caption="QEI/HOME0G1" mask="0x1f" values="QEIHOME0G1_PINS"/>
        </register>
        <register name="QEIHOME0G2R" offset="0x170" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIHOME0G2" caption="QEI/HOME0G2" mask="0x1f" values="QEIHOME0G2_PINS"/>
        </register>
        <register name="QEIINDX0G2R" offset="0x174" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QEIINDX0G2" caption="QEI/INDX0G2" mask="0x1f" values="QEIINDX0G2_PINS"/>
        </register>
