zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="RPA5G6R" offset="0x250" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G6R" caption="RPA5/G6" mask="0x3f" values="RPA5G6_PINS"/>
        </register>
        <register name="RPA6G1R" offset="0x254" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G1R" caption="RPA6/G1" mask="0x3f" values="RPA6G1_PINS"/>
        </register>
        <register name="RPA6G4R" offset="0x258" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G4R" caption="RPA6/G4" mask="0x3f" values="RPA6G4_PINS"/>
        </register>
        <register name="RPA6G6R" offset="0x25c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G6R" caption="RPA6/G6" mask="0x3f" values="RPA6G6_PINS"/>
        </register>
        <register name="RPA7G1R" offset="0x260" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA7G1R" caption="RPA7/G1" mask="0x3f" values="RPA7G1_PINS"/>
        </register>
        <register name="RPA7G2R" offset="0x264" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA7G2R" caption="RPA7/G2" mask="0x3f" values="RPA7G2_PINS"/>
        </register>
        <register name="RPA7G6R" offset="0x268" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA7G6R" caption="RPA7/G6" mask="0x3f" values="RPA7G6_PINS"/>
        </register>
        <register name="RPA8G2R" offset="0x26c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA8G2R" caption="RPA8/G2" mask="0x3f" values="RPA8G2_PINS"/>
        </register>
        <register name="RPA8G3R" offset="0x270" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA8G3R" caption="RPA8/G3" mask="0x3f" values="RPA8G3_PINS"/>
        </register>
        <register name="RPA8G4R" offset="0x274" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA8G4R" caption="RPA8/G4" mask="0x3f" values="RPA8G4_PINS"/>
        </register>
        <register name="RPA9G1R" offset="0x278" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA9G1R" caption="RPA9/G1" mask="0x3f" values="RPA9G1_PINS"/>
        </register>
        <register name="RPA9G3R" offset="0x27c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA9G3R" caption="RPA9/G3" mask="0x3f" values="RPA9G3_PINS"/>
        </register>
        <register name="RPA9G4R" offset="0x280" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA9G4R" caption="RPA9/G4" mask="0x3f" values="RPA9G4_PINS"/>
        </register>
        <register name="RPA10G1R" offset="0x284" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA10G1R" caption="RPA10/G1" mask="0x3f" values="RPA10G1_PINS"/>
        </register>
        <register name="RPA10G4R" offset="0x288" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA10G4R" caption="RPA10/G4" mask="0x3f" values="RPA10G4_PINS"/>
        </register>
        <register name="RPA10G5R" offset="0x28c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA10G5R" caption="RPA10/G5" mask="0x3f" values="RPA10G5_PINS"/>
        </register>
        <register name="RPA13G3R" offset="0x2a0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA13G3R" caption="RPA13/G3" mask="0x3f" values="RPA13G3_PINS"/>
        </register>
        <register name="RPA13G4R" offset="0x2a4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA13G4R" caption="RPA13/G4" mask="0x3f" values="RPA13G4_PINS"/>
        </register>
        <register name="RPA14G1R" offset="0x2a8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA14G1R" caption="RPA14/G1" mask="0x3f" values="RPA14G1_PINS"/>
        </register>
        <register name="RPA14G4R" offset="0x2ac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA14G4R" caption="RPA14/G4" mask="0x3f" values="RPA14G4_PINS"/>
        </register>
        <register name="RPA15G5R" offset="0x2b0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA15G5R" caption="RPA15/G5" mask="0x3f" values="RPA15G5_PINS"/>
        </register>
        <register name="RPB0G1R" offset="0x2b4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB0G1R" caption="RPB0/G1" mask="0x3f" values="RPB0G1_PINS"/>
        </register>
        <register name="RPB0G2R" offset="0x2b8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB0G2R" caption="RPB0/G2" mask="0x3f" values="RPB0G2_PINS"/>
        </register>
        <register name="RPB0G5R" offset="0x2bc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB0G5R" caption="RPB0/G5" mask="0x3f" values="RPB0G5_PINS"/>
        </register>
        <register name="RPB1G1R" offset="0x2c0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB1G1R" caption="RPB1/G1" mask="0x3f" values="RPB1G1_PINS"/>
        </register>
        <register name="RPB1G2R" offset="0x2c4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB1G2R" caption="RPB1/G2" mask="0x3f" values="RPB1G2_PINS"/>
        </register>
        <register name="RPB1G3R" offset="0x2c8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB1G3R" caption="RPB1/G3" mask="0x3f" values="RPB1G3_PINS"/>
        </register>
