zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="RPB10G4R" offset="0x33c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB10G4R" caption="RPB10/G4" mask="0x3f" values="RPB10G4_PINS"/>
        </register>
        <register name="RPB10G5R" offset="0x340" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB10G5R" caption="RPB10/G5" mask="0x3f" values="RPB10G5_PINS"/>
        </register>
        <register name="RPB11G1R" offset="0x344" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB11G1R" caption="RPB11/G1" mask="0x3f" values="RPB11G1_PINS"/>
        </register>
        <register name="RPB11G4R" offset="0x348" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB11G4R" caption="RPB11/G4" mask="0x3f" values="RPB11G4_PINS"/>
        </register>
        <register name="RPB12G1R" offset="0x34c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB12G1R" caption="RPB12/G1" mask="0x3f" values="RPB12G1_PINS"/>
        </register>
        <register name="RPB12G2R" offset="0x350" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB12G2R" caption="RPB12/G2" mask="0x3f" values="RPB12G2_PINS"/>
        </register>
        <register name="RPB13G2R" offset="0x354" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB13G2R" caption="RPB13/G2" mask="0x3f" values="RPB13G2_PINS"/>
        </register>
        <register name="RPB13G3R" offset="0x358" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB13G3R" caption="RPB13/G3" mask="0x3f" values="RPB13G3_PINS"/>
        </register>
        <register name="RPB14G5R" offset="0x35c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB14G5R" caption="RPB14/G5" mask="0x3f" values="RPB14G5_PINS"/>
        </register>
        <register name="RPB15G5R" offset="0x360" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB15G5R" caption="RPB15/G5" mask="0x3f" values="RPB15G5_PINS"/>
        </register>
        <register name="RPC0G1R" offset="0x364" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC0G1R" caption="RPC0/G1" mask="0x3f" values="RPC0G1_PINS"/>
        </register>
        <register name="RPC0G2R" offset="0x368" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC0G2R" caption="RPC0/G2" mask="0x3f" values="RPC0G2_PINS"/>
        </register>
        <register name="RPC1G2R" offset="0x36c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC1G2R" caption="RPC1/G2" mask="0x3f" values="RPC1G2_PINS"/>
        </register>
        <register name="RPC1G3R" offset="0x370" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC1G3R" caption="RPC1/G3" mask="0x3f" values="RPC1G3_PINS"/>
        </register>
        <register name="RPC7G2R" offset="0x388" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC7G2R" caption="RPC7/G2" mask="0x3f" values="RPC7G2_PINS"/>
        </register>
        <register name="RPC7G4R" offset="0x38c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC7G4R" caption="RPC7/G4" mask="0x3f" values="RPC7G4_PINS"/>
        </register>
        <register name="RPC8G3R" offset="0x390" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC8G3R" caption="RPC8/G3" mask="0x3f" values="RPC8G3_PINS"/>
        </register>
        <register name="RPC8G5R" offset="0x394" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC8G5R" caption="RPC8/G5" mask="0x3f" values="RPC8G5_PINS"/>
        </register>
        <register name="RPC9G1R" offset="0x398" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC9G1R" caption="RPC9/G1" mask="0x3f" values="RPC9G1_PINS"/>
        </register>
        <register name="RPC9G4R" offset="0x39c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC9G4R" caption="RPC9/G4" mask="0x3f" values="RPC9G4_PINS"/>
        </register>
        <register name="RPC10G5R" offset="0x3a0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC10G5R" caption="RPC10/G5" mask="0x3f" values="RPC10G5_PINS"/>
        </register>
        <register name="RPC11G5R" offset="0x3a4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPC11G5R" caption="RPC11/G5" mask="0x3f" values="RPC11G5_PINS"/>
        </register>
        <register name="RPD0G5R" offset="0x3b8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD0G5R" caption="RPD0/G5" mask="0x3f" values="RPD0G5_PINS"/>
        </register>
        <register name="RPD1G5R" offset="0x3bc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD1G5R" caption="RPD1/G5" mask="0x3f" values="RPD1G5_PINS"/>
        </register>
        <register name="RPD2G3R" offset="0x3c0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD2G3R" caption="RPD2/G3" mask="0x3f" values="RPD2G3_PINS"/>
        </register>
        <register name="RPD2G5R" offset="0x3c4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD2G5R" caption="RPD2/G5" mask="0x3f" values="RPD2G5_PINS"/>
        </register>
        <register name="RPD3G1R" offset="0x3c8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD3G1R" caption="RPD3/G1" mask="0x3f" values="RPD3G1_PINS"/>
        </register>
