zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="RPD3G4R" offset="0x3cc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD3G4R" caption="RPD3/G4" mask="0x3f" values="RPD3G4_PINS"/>
        </register>
        <register name="RPD4G2R" offset="0x3d0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD4G2R" caption="RPD4/G2" mask="0x3f" values="RPD4G2_PINS"/>
        </register>
        <register name="RPD4G5R" offset="0x3d4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD4G5R" caption="RPD4/G5" mask="0x3f" values="RPD4G5_PINS"/>
        </register>
        <register name="RPD5G6R" offset="0x3d8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD5G6R" caption="RPD5/G6" mask="0x3f" values="RPD5G6_PINS"/>
        </register>
        <register name="RPD6G1R" offset="0x3dc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD6G1R" caption="RPD6/G1" mask="0x3f" values="RPD6G1_PINS"/>
        </register>
        <register name="RPD6G3R" offset="0x3e0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD6G3R" caption="RPD6/G3" mask="0x3f" values="RPD6G3_PINS"/>
        </register>
        <register name="RPD7G2R" offset="0x3e4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD7G2R" caption="RPD7/G2" mask="0x3f" values="RPD7G2_PINS"/>
        </register>
        <register name="RPD7G4R" offset="0x3e8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPD7G4R" caption="RPD7/G4" mask="0x3f" values="RPD7G4_PINS"/>
        </register>
        <register name="RPE0G1R" offset="0x40c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE0G1R" caption="RPE0/G1" mask="0x3f" values="RPE0G1_PINS"/>
        </register>
        <register name="RPE0G3R" offset="0x410" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE0G3R" caption="RPE0/G3" mask="0x3f" values="RPE0G3_PINS"/>
        </register>
        <register name="RPE1G2R" offset="0x414" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE1G2R" caption="RPE1/G2" mask="0x3f" values="RPE1G2_PINS"/>
        </register>
        <register name="RPE1G4R" offset="0x418" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE1G4R" caption="RPE1/G4" mask="0x3f" values="RPE1G4_PINS"/>
        </register>
        <register name="RPE2G3R" offset="0x41c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE2G3R" caption="RPE2/G3" mask="0x3f" values="RPE2G3_PINS"/>
        </register>
        <register name="RPE2G5R" offset="0x420" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE2G5R" caption="RPE2/G5" mask="0x3f" values="RPE2G5_PINS"/>
        </register>
        <register name="RPE3G4R" offset="0x424" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE3G4R" caption="RPE3/G4" mask="0x3f" values="RPE3G4_PINS"/>
        </register>
        <register name="RPE4G1R" offset="0x428" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE4G1R" caption="RPE4/G1" mask="0x3f" values="RPE4G1_PINS"/>
        </register>
        <register name="RPE4G5R" offset="0x42c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE4G5R" caption="RPE4/G5" mask="0x3f" values="RPE4G5_PINS"/>
        </register>
        <register name="RPE5G6R" offset="0x430" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE5G6R" caption="RPE5/G6" mask="0x3f" values="RPE5G6_PINS"/>
        </register>
        <register name="RPE6G1R" offset="0x434" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE6G1R" caption="RPE6/G1" mask="0x3f" values="RPE6G1_PINS"/>
        </register>
        <register name="RPE6G2R" offset="0x438" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPE6G2R" caption="RPE6/G2" mask="0x3f" values="RPE6G2_PINS"/>
        </register>
      </register-group>
      <!-- INPUT pin group values -->
      <value-group name="EXTINT0_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA0" caption="RPA0" value="1"/>
        <value name="RPA6" caption="RPA6" value="2"/>
        <value name="RPA11" caption="RPA11" value="3"/>
        <value name="RPB0" caption="RPB0" value="4"/>
        <value name="RPB6" caption="RPB6" value="5"/>
        <value name="RPB11" caption="RPB11" value="6"/>
        <value name="RPC0" caption="RPC0" value="7"/>
        <value name="RPD6" caption="RPD6" value="8"/>
        <value name="RPE0" caption="RPE0" value="9"/>
        <value name="RPE6" caption="RPE6" value="10"/>
        <value name="RPB1" caption="RPB1" value="11"/>
        <value name="RPC9" caption="RPC9" value="12"/>
        <value name="RPD3" caption="RPD3" value="13"/>
        <value name="RPE4" caption="RPE4" value="14"/>
        <value name="RPA3" caption="RPA3" value="15"/>
        <value name="RPA7" caption="RPA7" value="16"/>
        <value name="RPB4" caption="RPB4" value="17"/>
        <value name="RPB8" caption="RPB8" value="18"/>
        <value name="RPB12" caption="RPB12" value="19"/>
        <value name="RPA2" caption="RPA2" value="20"/>
        <value name="RPA10" caption="RPA10" value="21"/>
        <value name="RPA14" caption="RPA14" value="22"/>
        <value name="RPB3" caption="RPB3" value="23"/>
        <value name="RPB7" caption="RPB7" value="24"/>
        <value name="RPA9" caption="RPA9" value="25"/>
      </value-group>
      <value-group name="EXTINT1_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA1" caption="RPA1" value="1"/>
        <value name="RPA7" caption="RPA7" value="2"/>
        <value name="RPA12" caption="RPA12" value="3"/>
        <value name="RPB1" caption="RPB1" value="4"/>
        <value name="RPB7" caption="RPB7" value="5"/>
        <value name="RPC1" caption="RPC1" value="6"/>
        <value name="RPC7" caption="RPC7" value="7"/>
        <value name="RPD7" caption="RPD7" value="8"/>
        <value name="RPE1" caption="RPE1" value="9"/>
        <value name="RPA3" caption="RPA3" value="10"/>
        <value name="RPB2" caption="RPB2" value="11"/>
        <value name="RPC0" caption="RPC0" value="12"/>
        <value name="RPD4" caption="RPD4" value="13"/>
        <value name="RPE6" caption="RPE6" value="14"/>
        <value name="RPA4" caption="RPA4" value="15"/>
        <value name="RPA8" caption="RPA8" value="16"/>
        <value name="RPB12" caption="RPB12" value="17"/>
        <value name="RPB5" caption="RPB5" value="18"/>
        <value name="RPB9" caption="RPB9" value="19"/>
        <value name="RPB13" caption="RPB13" value="20"/>
        <value name="RPB0" caption="RPB0" value="21"/>
        <value name="RPB4" caption="RPB4" value="22"/>
        <value name="RPB8" caption="RPB8" value="23"/>
        <value name="RPA0" caption="RPA0" value="24"/>
        <value name="RPA11" caption="RPA11" value="25"/>
      </value-group>
      <value-group name="EXTINT2_PINS" caption="Group3">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="RPA2" caption="RPA2" value="1"/>
        <value name="RPA8" caption="RPA8" value="2"/>
        <value name="RPA13" caption="RPA13" value="3"/>
        <value name="RPB2" caption="RPB2" value="4"/>
        <value name="RPB8" caption="RPB8" value="5"/>
        <value name="RPB13" caption="RPB13" value="6"/>
        <value name="RPC8" caption="RPC8" value="7"/>
        <value name="RPD2" caption="RPD2" value="8"/>
        <value name="RPE2" caption="RPE2" value="9"/>
        <value name="RPA4" caption="RPA4" value="10"/>
        <value name="RPB3" caption="RPB3" value="11"/>
        <value name="RPC1" caption="RPC1" value="12"/>
        <value name="RPD6" caption="RPD6" value="13"/>
        <value name="RPE0" caption="RPE0" value="14"/>
        <value name="RPA5" caption="RPA5" value="15"/>
        <value name="RPA9" caption="RPA9" value="16"/>
        <value name="RPB6" caption="RPB6" value="17"/>
        <value name="RPB10" caption="RPB10" value="18"/>
        <value name="RPA0" caption="RPA0" value="19"/>
        <value name="RPB1" caption="RPB1" value="20"/>
        <value name="RPB5" caption="RPB5" value="21"/>
        <value name="RPB9" caption="RPB9" value="22"/>
        <value name="RPA1" caption="RPA1" value="23"/>
        <value name="RPA12" caption="RPA12" value="24"/>
      </value-group>
