zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register caption="Position Counter Register" name="POSCNT" offset="0x30" rw="RW" size="4">
          <bitfield caption="Position Counter" mask="0xFFFFFFFF" name="POSCNT"/>
        </register>
        <register name="POSCNTCLR" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="POSCNTSET" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="POSCNTINV" offset="0x3c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register caption="Position Count Hold Register" name="POSHLD" offset="0x40" rw="RW" size="4">
          <bitfield caption="Position Count Hold" mask="0xFFFFFFFF" name="POSHLD"/>
        </register>
        <register name="POSHLDCLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="POSHLDSET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="POSHLDINV" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register caption="Velocity Counter Register" name="VELCNT" offset="0x50" rw="RW" size="4">
          <bitfield caption="Velocity Counter" mask="0xFFFFFFFF" name="VELCNT"/>
        </register>
        <register name="VELCNTCLR" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="VELCNTSET" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="VELCNTINV" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register caption="Velocity Counter Holding Register" name="VELHLD" offset="0x60" rw="RW" size="4">
          <bitfield caption="Velocity Cout Hold" mask="0xFFFFFFFF" name="VELHLD"/>
        </register>
        <register name="VELHLDCLR" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="VELHLDSET" offset="0x68" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="VELHLDINV" offset="0x6c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register caption="Interval Timer Register" name="INTTMR" offset="0x70" rw="RW" size="4">
          <bitfield caption="Interval Timer" mask="0xFFFFFFFF" name="INTTMR"/>
        </register>
        <register name="INTTMRCLR" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="INTTMRSET" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="INTTMRINV" offset="0x7c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register caption="Interval Timer Holding Register" name="INTHLD" offset="0x80" rw="RW" size="4">
          <bitfield caption="Interval Count Hold" mask="0xFFFFFFFF" name="INTHLD"/>
        </register>
        <register name="INTHLDCLR" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="INTHLDSET" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="INTHLDINV" offset="0x8c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register caption="Index Counter Register" name="INDXCNT" offset="0x90" rw="RW" size="4">
          <bitfield caption="Index Counter" mask="0xFFFFFFFF" name="INDXCNT"/>
        </register>
        <register name="INDXCNTCLR" offset="0x94" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="INDXCNTSET" offset="0x98" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="INDXCNTINV" offset="0x9c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register caption="Index Counter Holding Register" name="INDXHLD" offset="0xa0" rw="RW" size="4">
          <bitfield caption="Index Count Hold" mask="0xFFFFFFFF" name="INDXHLD"/>
        </register>
        <register name="INDXHLDCLR" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="INDXHLDSET" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="INDXHLDINV" offset="0xac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register caption="QEI Initialize/Capture/Compare Register" name="QEIICC" offset="0xb0" rw="RW" size="4">
          <bitfield caption="32-bit Initialize/Capture/Compare High bits" mask="0xFFFFFFFF" name="QEIICC"/>
        </register>
        <register name="QEIICCCLR" offset="0xb4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="QEIICCSET" offset="0xb8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="QEIICCINV" offset="0xbc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register caption="Capture Low Register" name="QEICMPL" offset="0xc0" rw="RW" size="4">
          <bitfield caption="32-bit Compare Low Value bits" mask="0xFFFFFFFF" name="QEICMPL"/>
        </register>
        <register name="QEICMPLCLR" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="QEICMPLSET" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="QEICMPLINV" offset="0xcc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
      </register-group>
