zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
      <value-group caption="(Device mode) Packet Transfer Disable bit / (Host mode) Token Busy Indicator bit" name="U1CON__PKTDIS_TOKBUSY">
        <value caption="(Device mode)Token and packet processing disabled (set upon SETUP token received) / (Host mode)Token being executed by the USB module" name="ON" value="0x1"/>
        <value caption="(Device mode)Token and packet processing enabled / (Host mode)No token being executed" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Live Single-Ended Zero flag bit" name="U1CON__SE0">
        <value caption="Single Ended Zero detected on the USB" name="DETECT" value="0x1"/>
        <value caption="No Single Ended Zero detected" name="NOT_DETECT" value="0x0"/>
      </value-group>
      <value-group caption="Live Differential Receiver JSTATE flag bit" name="U1CON__JSTATE">
        <value caption="JSTATE detected on the USB" name="DETECT" value="0x1"/>
        <value caption="No JSTATE detected" name="NOT_DETECT" value="0x0"/>
      </value-group>
      <value-group caption="Low Speed Enable Indicator bit" name="U1ADDR__LSPDEN">
        <value caption="Next token command to be executed at Low Speed" name="LOW_SPEED" value="0x1"/>
        <value caption="Next token command to be executed at Full Speed" name="FULL_SPEED" value="0x0"/>
      </value-group>
      <value-group caption="Token Type Indicator bits" name="U1TOK__PID">
        <value caption="OUT (TX) token type transaction" name="OUT" value="0x1"/>
        <value caption="IN (RX) token type transaction" name="IN" value="0x9"/>
        <value caption="SETUP (TX) token type transaction" name="SETUP" value="0xd"/>
      </value-group>
      <value-group caption="SOF Threshold Value bits" name="U1SOF__CNT">
        <value caption="64-byte packet" name="BYTE64" value="0x4a"/>
        <value caption="32-byte packet" name="BYTE32" value="0x2a"/>
        <value caption="16-byte packet" name="BYTE16" value="0x1a"/>
        <value caption="8-byte packet" name="BYTE8" value="0x12"/>
      </value-group>
      <value-group caption="Automatic Suspend Enable bit" name="U1CNFG1__UASUSPND">
        <value caption="USB module automatically suspends upon entry to Sleep mode. See the USUSPEND bit (UxPWRC) in" name="AUTO_SUSPEND" value="0x1"/>
        <value caption="USB module does not automatically suspend upon entry to Sleep mode. Software must use the USUSPEND bit (UxPWRC) to suspend the module" name="NO_AUTO_SUSPEND" value="0x0"/>
      </value-group>
      <value-group caption="Low-Speed Device Enable bit" name="U1CNFG1__LSDEV">
        <value caption="USB module to operate in Low-Speed Device mode" name="LOW_SPEED" value="0x1"/>
        <value caption="USB module to operate in OTG" name="OTG" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U1CNFG1__USBSIDL">
        <value caption="Discontinue module operation when device enters Idle mode" name="DISCONTINUE" value="0x1"/>
        <value caption="Continue module operation in Idle mode" name="CONTINUE" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U1CNFG1__PFRZ">
        <value caption="When emulator is in Debug mode, module freezes operation" name="FREEZE" value="0x1"/>
        <value caption="When emulator is in Debug mode, module continues operation" name="NOT_FREEZE" value="0x0"/>
      </value-group>
      <value-group caption="USB" name="U1CNFG1__UOEMON">
        <value caption="OE signal is active; it indicates intervals during which the D+/D- lines are driving" name="ACTIVE" value="0x1"/>
        <value caption="OE signal is inactive" name="INACTIVE" value="0x0"/>
      </value-group>
      <value-group caption="USB Eye-Pattern Test Enable bit" name="U1CNFG1__UTEYE">
        <value caption="Eye-Pattern Test is enabled" name="ON" value="0x1"/>
        <value caption="Eye-Pattern Test is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP1__EPHSHK">
        <value caption="Endpoint Handshake is enabled" name="ON" value="0x1"/>
        <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP1__EPSTALL">
        <value caption="Endpoint 1 was stalled" name="STALL" value="0x1"/>
        <value caption="Endpoint 1 was not stalled" name="NOT_STALL" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP1__EPTXEN">
        <value caption="Endpoint 1 transmit is enabled" name="ON" value="0x1"/>
        <value caption="Endpoint 1 transmit is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP1__EPRXEN">
        <value caption="Endpoint 1 receive is enabled" name="ON" value="0x1"/>
        <value caption="Endpoint 1 receive is disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP1__EPCONDIS">
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint 1 from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="DISABLE_1" value="0x1"/>
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint 1 for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="ENABLE_1" value="0x0"/>
      </value-group>
      <value-group caption="Retry Disable bit" name="U1EP__RETRYDIS">
        <value caption="Retry NAKed transactions is disabled" name="ON" value="0x1"/>
        <value caption="Retry NAKed transactions is enabled; retry done in hardware" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Low-Speed Direct Connection Enable bit" name="U1EP__LSPD">
        <value caption="Direct connection to a low-speed device is enabled" name="ON" value="0x1"/>
        <value caption="Direct connection to a low-speed device is disabled; hub required with PRE_PID" name="OFF" value="0x0"/>
      </value-group>
    </module>
