zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
    <module name="WDT" id="02674" caption="Watch Dog Timer">
      <register-group name="WDT">
        <register name="WDTCON" offset="0x0" rw="RW" size="4" caption="Watchdog Timer Control Register">
          <bitfield caption="Watchdog Timer Window Enable bit" mask="0x00000001" name="WDTWINEN" values="WDTCON__WDTWINEN"/>
          <bitfield name="SLPDIV" caption="" mask="0x3e"/>
          <bitfield name="CLKSEL" caption="" mask="0xc0"/>
          <bitfield name="RUNDIV" caption="" mask="0x1f00"/>
          <bitfield caption="Watchdog Timer Enable bit" mask="0x00008000" name="ON" values="WDTCON__ON"/>
          <bitfield name="WDTCLRKEY" caption="" mask="0xffff0000"/>
        </register>
        <register name="WDTCONCLR" offset="0x04" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="WDTCONSET" offset="0x08" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
        <register name="WDTCONINV" offset="0x0C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
    </register>
      </register-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="WDTCON__WDTWINEN">
        <value caption="Enable windowed Watchdog Timer" name="WDTWINEN" value="0x1"/>
        <value caption="Disable windowed Watchdog Timer" name="WDTWINDIS" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="WDTCON__ON">
        <value caption="The WDT module is enabled" name="WDTEN" value="0x1"/>
        <value caption="The WDT module is disabled" name="WDTOFF" value="0x0"/>
      </value-group>
    </module>
    <module name="BTZBSYS" id="04997" version="3.0.0" caption="BT ZB Subsystem">
      <register-group name="BTZBSYS" caption="">
        <register name="SUBSYS_CNTRL_REG0" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_CNTRL_REG0">
          <bitfield name="ant_div_sel_ovrd_en" caption="ant_div_sel_ovrd_en" mask="0x80000000"/>
          <bitfield name="ant_div_sel_ovrd_val" caption="ant_div_sel_ovrd_val" mask="0x60000000"/>
          <bitfield name="disable_pclk_bt" caption="disable_pclk_bt" mask="0x10000000"/>
          <bitfield name="disable_pclk_zb_mac" caption="disable_pclk_zb_mac" mask="0x8000000"/>
          <bitfield name="disable_pclk_arb" caption="disable_pclk_arb" mask="0x4000000"/>
          <bitfield name="subsys_dbg_bus_sel" caption="subsys_dbg_bus_sel" mask="0x2000000"/>
          <bitfield name="aclb_pwr_rst_n" caption="aclb_pwr_rst_n" mask="0x1000000"/>
          <bitfield name="aclb_soft_rst_n" caption="aclb_soft_rst_n" mask="0x800000"/>
          <bitfield name="subsys_dbg_bus_sel_top" caption="subsys_dbg_bus_sel_top" mask="0x400000"/>
          <bitfield name="bt_en_main_clk" caption="bt_en_main_clk" mask="0x100000"/>
          <bitfield name="bt_reset_by_fw" caption="bt_reset_by_fw" mask="0x80000"/>
          <bitfield name="bt_hw_rc_re_cal" caption="bt_hw_rc_re_cal" mask="0x40000"/>
          <bitfield name="bt_sfr_wakeup_bit" caption="bt_sfr_wakeup_bit" mask="0x20000"/>
          <bitfield name="bt_pdc_ov" caption="bt_pdc_ov" mask="0x10000"/>
          <bitfield name="ant_div_sel_2_iom_en" caption="ant_div_sel_2_iom_en" mask="0x40"/>
          <bitfield name="ant_div_sel_1_iom_en" caption="ant_div_sel_1_iom_en" mask="0x20"/>
          <bitfield name="zb_en_main_clk" caption="zb_en_main_clk" mask="0x10"/>
          <bitfield name="zb_reset_by_fw" caption="zb_reset_by_fw" mask="0x8"/>
          <bitfield name="zb_soft_reset_in" caption="zb_soft_reset_in" mask="0x2"/>
          <bitfield name="zb_slp_ctrl" caption="zb_slp_ctrl" mask="0x1"/>
        </register>
        <register name="SUBSYS_CNTRL_REG1" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00001800" caption="SUBSYS_CNTRL_REG1">
          <bitfield name="disable_adc_clk_gating" caption="disable_adc_clk_gating" mask="0x80000000"/>
          <bitfield name="die_clk_sel" caption="die_clk_sel" mask="0x40000000"/>
          <bitfield name="pll_lock_flops_rstn_ovrd_val" caption="pll_lock_flops_rstn_ovrd_val" mask="0x20000000"/>
          <bitfield name="pll_lock_flops_rstn_ovrd_en" caption="pll_lock_flops_rstn_ovrd_en" mask="0x10000000"/>
          <bitfield name="xtal_lock_cnt_rstn_ovrd_val" caption="xtal_lock_cnt_rstn_ovrd_val" mask="0x8000000"/>
          <bitfield name="xtal_lock_cnt_rstn_ovrd_en" caption="xtal_lock_cnt_rstn_ovrd_en" mask="0x4000000"/>
          <bitfield name="clk_lp_req" caption="clk_lp_req" mask="0x800000"/>
          <bitfield name="invert_btadc_clk" caption="invert_btadc_clk" mask="0x400000"/>
          <bitfield name="zb_bt_bar_ovrd_val" caption="zb_bt_bar_ovrd_val" mask="0x200000"/>
          <bitfield name="zb_bt_bar_ovrd_en" caption="zb_bt_bar_ovrd_en" mask="0x100000"/>
          <bitfield name="lna_on_iom_en" caption="lna_on_iom_en" mask="0x80000"/>
          <bitfield name="pa_on_iom_en" caption="pa_on_iom_en" mask="0x40000"/>
          <bitfield name="tr_sw_n_iom_en" caption="tr_sw_n_iom_en" mask="0x20000"/>
          <bitfield name="tr_sw_iom_en" caption="tr_sw_iom_en" mask="0x10000"/>
          <bitfield name="subsys_xtal_ready_delay" caption="subsys_xtal_ready_delay" mask="0xF000"/>
          <bitfield name="subsys_dbg_bus_en" caption="subsys_dbg_bus_en" mask="0x800"/>
          <bitfield name="disable_one_sec_counter" caption="disable_one_sec_counter" mask="0x400"/>
          <bitfield name="ssubsys_clk_div_sel" caption="subsys_clk_div_sel" mask="0x40"/>
          <bitfield name="subsys_clk_src_sel" caption="subsys_clk_src_sel" mask="0x30"/>
          <bitfield name="subsys_dbg_bus_sel" caption="subsys_dbg_bus_sel" mask="0xC"/>
          <bitfield name="subsys_dbg_bus_sel_top" caption="subsys_dbg_bus_sel_top" mask="0x3"/>
        </register>
        <register name="SUBSYS_CNTRL_REG2" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_CNTRL_REG2">
          <bitfield name="crossbar_data_invert" caption="crossbar_data_invert" mask="0xFC000000"/>
          <bitfield name="crossbar_data_line_sel_5" caption="crossbar_data_line_sel_5" mask="0x700000"/>
          <bitfield name="crossbar_data_line_sel_4" caption="crossbar_data_line_sel_4" mask="0x70000"/>
          <bitfield name="crossbar_data_line_sel_3" caption="crossbar_data_line_sel_3" mask="0x7000"/>
          <bitfield name="crossbar_data_line_sel_2" caption="crossbar_data_line_sel_2" mask="0x700"/>
          <bitfield name="crossbar_data_line_sel_1" caption="crossbar_data_line_sel_1" mask="0x70"/>
          <bitfield name="crossbar_data_line_sel_0" caption="crossbar_data_line_sel_0" mask="0x7"/>
        </register>
        <register name="SUBSYS_CNTRL_REG3" offset="0xC" rw="RW" size="4" access-size="4" initval="0x00000240" caption="SUBSYS_CNTRL_REG3">
          <bitfield name="pll_lock_fifo_empty_rst_en" caption="pll_lock_fifo_empty_rst_en" mask="0x2000"/>
          <bitfield name="pll_lock_fifo_clk_src_sel" caption="pll_lock_fifo_clk_src_sel" mask="0x1000"/>
          <bitfield name="pll_lock_fifo_empty_soft_reset" caption="pll_lock_fifo_empty_soft_reset" mask="0x800"/>
          <bitfield name="pll_auto_relock_en" caption="pll_auto_relock_en" mask="0x400"/>
          <bitfield name="pll_lock_fifo_en" caption="pll_lock_fifo_en" mask="0x200"/>
          <bitfield name="disable_pclk_zb_mdm" caption="disable_pclk_zb_mdm" mask="0x100"/>
          <bitfield name="disable_pclk_dfe" caption="disable_pclk_dfe" mask="0x80"/>
          <bitfield name="subsys_pll_ready_delay" caption="subsys_pll_ready_delay" mask="0x7E"/>
          <bitfield name="le_2m_fpga_v1c0_mode" caption="le_2m_fpga_v1c0_mode" mask="0x1"/>
        </register>
        <register name="SUBSYS_STATUS_REG0" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000000" caption="SUBSYS_STATUS_REG0">
          <bitfield name="bt_rf_idle" caption="bt_rf_idle" mask="0x20000"/>
          <bitfield name="bt_low_power_mode" caption="bt_low_power_mode" mask="0x10000"/>
          <bitfield name="radio_idle_zb" caption="radio_idle_zb" mask="0x4"/>
          <bitfield name="zb_deep_sleep_mode" caption="zb_deep_sleep_mode" mask="0x2"/>
          <bitfield name="zb_sleep_mode" caption="zb_sleep_mode" mask="0x1"/>
        </register>
