zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
        <register name="ICER" offset="0x80" rw="RW" size="4" access-size="4" count="2" initval="0x00000000" caption="Interrupt Clear Enable Register">
          <bitfield name="CLRENA" caption="Interrupt clear-enable bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="ISPR" offset="0x100" rw="RW" size="4" access-size="4" count="2" initval="0x00000000" caption="Interrupt Set Pending Register">
          <bitfield name="SETPEND" caption="Interrupt set-pending bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="ICPR" offset="0x180" rw="RW" size="4" access-size="4" count="2" initval="0x00000000" caption="Interrupt Clear Pending Register">
          <bitfield name="CLRPEND" caption="Interrupt clear-pending bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="IABR" offset="0x200" rw="RW" size="4" access-size="4" count="2" initval="0x00000000" caption="Interrupt Active Bit Register">
          <bitfield name="ACTIVE" caption="Interrupt active bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="IP" offset="0x300" rw="RW" size="1" access-size="1" count="58" initval="0x00" caption="Interrupt Priority Register n">
          <bitfield name="PRI0" caption="Priority of interrupt n" mask="0x7"/>
        </register>
        <register name="STIR" offset="0xE00" rw="W" size="4" access-size="4" caption="Software Trigger Interrupt Register">
          <bitfield name="INTID" caption="Interrupt ID to trigger" mask="0x1FF"/>
        </register>
      </register-group>
    </module>
    <module name="SOSC" id="02874" name2="osc_xtal_32k_v8" version="1.0.0" caption="">
    </module>
    <module name="SysTick" id="SYSTEM_IP" version="1.0.0" caption="System timer">
      <register-group name="SysTick" caption="System timer">
        <register name="CSR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000004" caption="SysTick Control and Status Register">
          <bitfield name="ENABLE" caption="SysTick Counter Enable" mask="0x1" values="CSR__ENABLE"/>
          <bitfield name="TICKINT" caption="SysTick Exception Request Enable" mask="0x2" values="CSR__TICKINT"/>
          <bitfield name="CLKSOURCE" caption="Clock Source 0=external, 1=processor" mask="0x4" values="CSR__CLKSOURCE"/>
          <bitfield name="COUNTFLAG" caption="Timer counted to 0 since last read of register" mask="0x10000"/>
        </register>
        <register name="RVR" offset="0x4" rw="RW" size="4" access-size="4" caption="SysTick Reload Value Register">
          <bitfield name="RELOAD" caption="Value to load into the SysTick Current Value Register when the counter reaches 0" mask="0xFFFFFF"/>
        </register>
        <register name="CVR" offset="0x8" rw="RW" size="4" access-size="4" caption="SysTick Current Value Register">
          <bitfield name="CURRENT" caption="Current value at the time the register is accessed" mask="0xFFFFFF"/>
        </register>
        <register name="CALIB" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="SysTick Calibration Value Register">
          <bitfield name="TENMS" caption="Reload value to use for 10ms timing" mask="0xFFFFFF"/>
          <bitfield name="SKEW" caption="TENMS is rounded from non-integer ratio" mask="0x40000000" values="CALIB__SKEW"/>
          <bitfield name="NOREF" caption="No Separate Reference Clock" mask="0x80000000" values="CALIB__NOREF"/>
        </register>
      </register-group>
      <value-group name="CSR__ENABLE">
        <value name="VALUE_0" caption="Counter disabled" value="0"/>
        <value name="VALUE_1" caption="Counter enabled" value="1"/>
      </value-group>
      <value-group name="CSR__TICKINT">
        <value name="VALUE_0" caption="Counting down to 0 does not assert the SysTick exception request" value="0"/>
        <value name="VALUE_1" caption="Counting down to 0 asserts the SysTick exception request" value="1"/>
      </value-group>
      <value-group name="CSR__CLKSOURCE">
        <value name="VALUE_0" caption="External clock" value="0"/>
        <value name="VALUE_1" caption="Processor clock" value="1"/>
      </value-group>
      <value-group name="CALIB__SKEW">
        <value name="VALUE_0" caption="10ms calibration value is exact" value="0"/>
        <value name="VALUE_1" caption="10ms calibration value is inexact, because of the clock frequency" value="1"/>
      </value-group>
      <value-group name="CALIB__NOREF">
        <value name="VALUE_0" caption="The reference clock is provided" value="0"/>
        <value name="VALUE_1" caption="The reference clock is not provided" value="1"/>
      </value-group>
    </module>
    <module name="SystemControl" id="SYSTEM_IP" version="1.0.0" caption="System Control Registers">
      <register-group name="SystemControl" caption="System Control Registers">
        <register name="ICTR" offset="0x4" rw="R" size="4" access-size="4" caption="Interrupt Controller Type Register">
          <bitfield name="INTLINESNUM" caption="" mask="0xF"/>
        </register>
        <register name="ACTLR" offset="0x8" rw="RW" size="4" access-size="4" caption="Auxiliary Control Register">
          <bitfield name="DISMCYCINT" caption="Disable interruption of LDM/STM instructions" mask="0x1"/>
          <bitfield name="DISDEFWBUF" caption="Disable wruite buffer use during default memory map accesses" mask="0x2"/>
          <bitfield name="DISFOLD" caption="Disable IT folding" mask="0x4"/>
          <bitfield name="DISFPCA" caption="Disable automatic update of CONTROL.FPCA" mask="0x100"/>
          <bitfield name="DISOOFP" caption="Disable out-of-order FP instructions" mask="0x200"/>
        </register>
        <register name="CPUID" offset="0xD00" rw="R" size="4" access-size="4" initval="0x410FC240" caption="CPUID Base Register">
          <bitfield name="REVISION" caption="Processor revision number" mask="0xF"/>
          <bitfield name="PARTNO" caption="Process Part Number, 0xC24=Cortex-M4" mask="0xFFF0"/>
          <bitfield name="CONSTANT" caption="Constant" mask="0xF0000"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF00000"/>
          <bitfield name="IMPLEMENTER" caption="Implementer code, 0x41=ARM" mask="0xFF000000"/>
        </register>
