zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/atdf/PIC32CX2051BZ62132.atdf
    <module name="ZIGBEE" id="04998" name2="zb_mac_v3" version="A" caption="ZigBee MAC DOS">
      <register-group name="ZIGBEE" caption="Zero Radio Registers"/>
    </module>
  </modules>
  <pinouts>
    <pinout name="DQFN132" caption="DQFN132">
      <pin position="1" pad="NC"/>
      <pin position="2" pad="NC"/>
      <pin position="3" pad="NC"/>
      <pin position="4" pad="PA0"/>
      <pin position="5" pad="VPMU_VDD"/>
      <pin position="6" pad="NC"/>
      <pin position="7" pad="PA1"/>
      <pin position="8" pad="PA2"/>
      <pin position="9" pad="PA5"/>
      <pin position="10" pad="PD0"/>
      <pin position="11" pad="PD1"/>
      <pin position="12" pad="VDD"/>
      <pin position="13" pad="NC"/>
      <pin position="14" pad="PA6"/>
      <pin position="15" pad="NC"/>
      <pin position="16" pad="PA7"/>
      <pin position="17" pad="NC"/>
      <pin position="18" pad="PA8"/>
      <pin position="19" pad="NC"/>
      <pin position="20" pad="PA9"/>
      <pin position="21" pad="NC"/>
      <pin position="22" pad="VDD"/>
      <pin position="23" pad="NC"/>
      <pin position="24" pad="PA10"/>
      <pin position="25" pad="PB12"/>
      <pin position="26" pad="PE2"/>
      <pin position="27" pad="PC9"/>
      <pin position="28" pad="PC8"/>
      <pin position="29" pad="PC10"/>
      <pin position="30" pad="PE3"/>
      <pin position="31" pad="NC"/>
      <pin position="32" pad="NC"/>
      <pin position="33" pad="NC"/>
      <pin position="34" pad="NC"/>
      <pin position="35" pad="NC"/>
      <pin position="36" pad="NC"/>
      <pin position="37" pad="PB9"/>
      <pin position="38" pad="PB13"/>
      <pin position="39" pad="PA4"/>
      <pin position="40" pad="PB8"/>
      <pin position="41" pad="PA14"/>
      <pin position="42" pad="PA13"/>
      <pin position="43" pad="VDD"/>
      <pin position="44" pad="VDD"/>
      <pin position="45" pad="PC1"/>
      <pin position="46" pad="PC0"/>
      <pin position="47" pad="PE1"/>
      <pin position="48" pad="PE0"/>
      <pin position="49" pad="PB11"/>
      <pin position="50" pad="NC"/>
      <pin position="51" pad="PB10"/>
      <pin position="52" pad="NC"/>
      <pin position="53" pad="NC"/>
      <pin position="54" pad="NC"/>
      <pin position="55" pad="NC"/>
      <pin position="56" pad="NC"/>
      <pin position="57" pad="CLDO_IN"/>
      <pin position="58" pad="NC"/>
      <pin position="59" pad="XO_N"/>
      <pin position="60" pad="NC"/>
      <pin position="61" pad="XO_P"/>
      <pin position="62" pad="NC"/>
      <pin position="63" pad="VDD_RF"/>
      <pin position="64" pad="NC"/>
      <pin position="65" pad="NC"/>
      <pin position="66" pad="NC"/>
      <pin position="67" pad="NC"/>
      <pin position="68" pad="NC"/>
      <pin position="69" pad="NC"/>
      <pin position="70" pad="CLDO_OUT"/>
      <pin position="71" pad="NC"/>
      <pin position="72" pad="RFLDO_OUT"/>
      <pin position="73" pad="NC"/>
      <pin position="74" pad="CLDO_BUCK"/>
      <pin position="75" pad="NC"/>
      <pin position="76" pad="BUCK_PA"/>
      <pin position="77" pad="NC"/>
      <pin position="78" pad="RFIO"/>
      <pin position="79" pad="NC"/>
      <pin position="80" pad="NC"/>
      <pin position="81" pad="PD2"/>
      <pin position="82" pad="PE6"/>
      <pin position="83" pad="PE5"/>
      <pin position="84" pad="PE4"/>
      <pin position="85" pad="PC11"/>
      <pin position="86" pad="VDD"/>
      <pin position="87" pad="PB6"/>
      <pin position="88" pad="PA3"/>
      <pin position="89" pad="PB2"/>
      <pin position="90" pad="PB4"/>
      <pin position="91" pad="PD3"/>
      <pin position="92" pad="PD5"/>
      <pin position="93" pad="PB3"/>
      <pin position="94" pad="VBUS"/>
      <pin position="95" pad="NC"/>
      <pin position="96" pad="AVDD"/>
      <pin position="97" pad="PA15"/>
      <pin position="98" pad="NC"/>
      <pin position="99" pad="NC"/>
      <pin position="100" pad="NC"/>
      <pin position="101" pad="NC"/>
      <pin position="102" pad="PB7"/>
      <pin position="103" pad="PD4"/>
      <pin position="104" pad="NC"/>
      <pin position="105" pad="VDD"/>
      <pin position="106" pad="PB15"/>
      <pin position="107" pad="PB14"/>
      <pin position="108" pad="PB0"/>
      <pin position="109" pad="NC"/>
      <pin position="110" pad="USB_DP"/>
      <pin position="111" pad="PB1"/>
      <pin position="112" pad="USB_DM"/>
      <pin position="113" pad="NC"/>
      <pin position="114" pad="PLL_VDD"/>
      <pin position="115" pad="SOC_LDO_VDD_IN"/>
      <pin position="116" pad="NC"/>
      <pin position="117" pad="SOC_LDO_VDD_IN"/>
      <pin position="118" pad="NC"/>
      <pin position="119" pad="PD6"/>
      <pin position="120" pad="PD7"/>
      <pin position="121" pad="PC7"/>
      <pin position="122" pad="PB5"/>
      <pin position="123" pad="MCLR"/>
      <pin position="124" pad="PA11"/>
      <pin position="125" pad="PA12"/>
      <pin position="126" pad="PMU_MLDO"/>
      <pin position="127" pad="NC"/>
      <pin position="128" pad="VPMU_VDD"/>
      <pin position="129" pad="NC"/>
      <pin position="130" pad="NC"/>
      <pin position="131" pad="PMU_BK"/>
      <pin position="132" pad="NC"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
